{
   "rss": {
      "channel": {
         "title": "RealGM Basketball Wiretap",
         "link": "https://basketball.realgm.com/news",
         "description": "Basketball News, Rumors, Scores, Stats, Analysis, Depth Charts, Forums",
         "language": "en-us",
         "pubDate": "Thu, 03 Nov 2022 11:17:01 EDT",
         "lastBuildDate": "Thu, 03 Nov 2022 11:17:01 EDT",
         "item": [
            {
               "title": "Donovan Mitchell On Cavs Big Men: Never Played With Bigs As Dynamic As Them On Offense",
               "link": "https://basketball.realgm.com/wiretap/269254/Donovan-Mitchell-On-Cavs-Big-Men-Never-Played-With-Bigs-As-Dynamic-As-Them-On-Offense",
               "description": "<p>Donovan Mitchell has talked regularly about his excitement to be with the Cleveland Cavaliers. Mitchell has also been careful to avoid directly comparing the Cavs to his time with the Utah Jazz. But sometimes it happens naturally.</p>\n<p>After Cleveland beat the Boston Celtics on Wednesday, Mitchell said he's been watching film of Darius Garland and how he works with Jarrett Allen and Evan Mobley on offense. In saying he wants to work with the talented young big men better, Mitchell perhaps unintentionally compared the duo to Rudy Gobert.</p>\n<p>\"I've never played with bigs as dynamic as them on offense,\" said Mitchell.</p>\n<p>Mitchell may not be wrong, and likely meant nothing more than praise for his now teammates. However, some are taking this as a shot at Gobert, given Mitchell and Gobert often struggled to mesh on offense during their time in Utah.</p>",
               "pubDate": "Thu, 03 Nov 2022 08:45:03 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269254/Donovan-Mitchell-On-Cavs-Big-Men-Never-Played-With-Bigs-As-Dynamic-As-Them-On-Offense",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Mitchell_Donovan_cle_221013.jpg"
               }
            },
            {
               "title": "Kyrie Irving's Trade Value Considered 'Radioactive'",
               "link": "https://basketball.realgm.com/wiretap/269246/Kyrie-Irvings-Trade-Value-Considered-Radioactive",
               "description": "<p>The trade value of Kyrie Irving appears to be at its nadir following his decision to link to an antisemitic movie and his subsequent media availability. The Los Angeles Lakers were the only team believed to have serious interest in trading for Irving this past offseason and those discussions involved the Brooklyn Nets taking back the contract of Russell Westbrook.</p>\n<p>\"I talked to a lot of people around the league over the weekend and the sense I get right now is he's radioactive,\" said Zach Lowe on his podcast with Nick Friedell. \"Even if you drop the price to nothing, the baggage is just too much. </p>\n<p>\"You want to talk about the Lakers are the most desperate team in the league. Alright, the Lakers also play in a gigantic cosmopolitan city. All of the residents are following this story.</p>\n<p>\"I just don't know what else they're supposed to do except try to salvage and you're telling me it's unsalvageable.\"</p>",
               "pubDate": "Wed, 02 Nov 2022 15:17:59 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269246/Kyrie-Irvings-Trade-Value-Considered-Radioactive",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Irving_Kyrie_bkn_220630.jpg"
               }
            },
            {
               "title": "Nets Began Discussions With Ime Udoka Before Parting Ways With Steve Nash",
               "link": "https://basketball.realgm.com/wiretap/269247/Nets-Began-Discussions-With-Ime-Udoka-Before-Parting-Ways-With-Steve-Nash",
               "description": "<p>Conversations between the Brooklyn Nets and Ime Udoka about him becoming the next head coach of the franchise began before they parted ways with Steve Nash on Tuesday.</p>\n<p>\"They have been vetting Ime Udoka for the last 24 to 48 hours,\" said Shams Charania. \"This goes back to the weekend: Sunday into Monday. They started discussions with Ime Udoka, I'm told, even before the firing of Nash. As far as the concept of hiring Ime Udoka.</p>\n<p>\"That is a process that is underway. There's obviously different steps they have to take. </p>\n<p>\"Ime Udoka is under a one-year suspension with the Celtics because of an improper workplace relationship they need to vet out.</p>\n<p>\"They need to have conversations with the Celtics to get Ime Udoka aboard. I'm told the Celtics have already granted permission to the Nets to speak with Udoka, and they will let him go freely. They will let him go without any compensation.\"</p>",
               "pubDate": "Wed, 02 Nov 2022 15:25:39 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269247/Nets-Began-Discussions-With-Ime-Udoka-Before-Parting-Ways-With-Steve-Nash",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Udoka_Ime_bos_220911.jpg"
               }
            },
            {
               "title": "Kyrie Irving, Nets, Anti-Defamation League Release Joint Statement",
               "link": "https://basketball.realgm.com/wiretap/269249/Kyrie-Irving-Nets-Anti-Defamation-League-Release-Joint-Statement",
               "description": "<p style=\"font-weight: 400;\">The Brooklyn Nets released the following statement with Kyrie Irving and the Anti-Defamation League: </p>\n<p style=\"font-weight: 400;\">The events of the past week have sparked many emotions within the Nets organization, our Brooklyn community, and the nation. The public discourse that followed has brought greater awareness to the challenges we face as a society when it comes to combating hate and hate speech. We are ready to take on this challenge and we recognize that this is a unique moment to make a lasting impact.</p>\n<p style=\"font-weight: 400;\">To promote education within our community, Kyrie Irving and the Brooklyn Nets will each donate $500,000 toward causes and organizations that work to eradicate hate and intolerance in our communities. The Nets and Kyrie Irving will work with ADL (the Anti-Defamation League), a nonprofit organization devoted to fighting antisemitism and all types of hate that undermine justice and fair treatment for every individual. This is an effort to develop educational programming that is inclusive and will comprehensively combat all forms of antisemitism and bigotry.</p>\n<p style=\"font-weight: 400;\">\"I oppose all forms of hatred and oppression and stand strong with communities that are marginalized and impacted every day,\" said Kyrie Irving. \"I am aware of the negative impact of my post towards the Jewish community and I take responsibility. I do not believe everything said in the documentary was true or reflects my morals and principles. I am a human being learning from all walks of life and I intend to do so with an open mind and a willingness to listen. So from my family and I, we meant no harm to any one group, race or religion of people, and wish to only be a beacon of truth and light.\"</p>\n<p style=\"font-weight: 400;\">\"There is no room for antisemitism, racism, false narratives or misguided attempts to create animosity and hate,\" said Sam Zussman, Chief Executive Officer of BSE Global, parent company of the Brooklyn Nets and Barclays Center. \"Now, more than ever, there is a pressing need to ensure education in these areas. We are putting our prior statements into practice because actions speak louder than words.\"</p>\n<p style=\"font-weight: 400;\">\"At a time when antisemitism has reached historic levels, we know the best way to fight the oldest hatred is to both confront it head-on and also to change hearts and minds. With this partnership, ADL will work with the Nets and Kyrie to open dialogue and increase understanding,\" said Jonathan Greenblatt, ADL CEO. \"At the same time, we will maintain our vigilance and call out the use of anti-Jewish stereotypes and tropes - whatever, whoever, or wherever the source - as we work toward a world without hate.\"</p>\n<p style=\"font-weight: 400;\">As in past years, the Brooklyn Nets will continue to support and participate in Shine A Light, an ongoing initiative dedicated to spotlighting modern day antisemitism.</p>\n<p style=\"font-weight: 400;\">Additionally, to ensure a sustainable and meaningful impact in driving awareness and education on the important topics of hatred based on race, ethnicity, and religion, the Brooklyn Nets, New York Liberty and the teams' affiliated organizations will host a series of community conversations at Barclays Center in Brooklyn, in partnership with ADL and other national civil rights organizations as well as local community associations.</p>",
               "pubDate": "Wed, 02 Nov 2022 19:42:06 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269249/Kyrie-Irving-Nets-Anti-Defamation-League-Release-Joint-Statement",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Irving_Kyrie_bkn_220603.jpg"
               }
            },
            {
               "title": "Nets Consider Hiring Ime Udoka 'Last-Ditch Effort To Make This Work'",
               "link": "https://basketball.realgm.com/wiretap/269245/Nets-Consider-Hiring-Ime-Udoka-Last-Ditch-Effort-To-Make-This-Work",
               "description": "<p>The Brooklyn Nets are expected to hire Ime Udoka as head coach as they reportedly view him as capable of salvaging their season. Udoka was previously an assistant coach with the Nets and was also an assistant coach with the Philadelphia 76ers where he worked with Ben Simmons.</p>\n<p>\"This very much is probably for this Nets' group, this iteration, this core, this is probably the last ditch effort to make this work,\" said Adrian Wojnarowski.</p>\n<p>The Nets previously traded away control of their upcoming drafts to the Houston Rockets as part of the James Harden deal, which limits the incentives for them to enter into a complete rebuild where they bottom out.</p>\n<p>Kevin Durant previously requested a trade while Kyrie Irving very nearly opted out of the final season of his contract. </p>",
               "pubDate": "Wed, 02 Nov 2022 12:04:59 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269245/Nets-Consider-Hiring-Ime-Udoka-Last-Ditch-Effort-To-Make-This-Work",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Udoka_Ime_bos_220920.jpg"
               }
            },
            {
               "title": "Nets Reportedly Engaged In 'Cursory' Trade Talks Involving Ben Simmons For Veteran Shooter",
               "link": "https://basketball.realgm.com/wiretap/269250/Nets-Reportedly-Engaged-In-Cursory-Trade-Talks-Involving-Ben-Simmons-For-Veteran-Shooter",
               "description": "<p>The Brooklyn Nets engaged in \"cursory\" trade talks last week with a Western Conference team to return a veteran shooter, sources told Ian Begley of SNY.</p>\n<p>Begley adds that Ben Simmons' availability came up in the discussions.</p>\n<p>The team is aggressively pursuing perimeter shooting, with Sean Marks admitting that there are holes in the roster.</p>\n<p>\"I'll be the first to tell you, there's certainly holes (in our roster). We're not a finished product,\" said Marks on Tuesday.</p>\n<p>Simmons is averaging 6.2 points, 7.3 assists, and 6.5 rebounds on the season. </p>",
               "pubDate": "Thu, 03 Nov 2022 00:51:27 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269250/Nets-Reportedly-Engaged-In-Cursory-Trade-Talks-Involving-Ben-Simmons-For-Veteran-Shooter",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Simmons_Ben_bkn_221025.jpg"
               }
            },
            {
               "title": "Celtics' Players Expected Ime Udoka To Return Next Season",
               "link": "https://basketball.realgm.com/wiretap/269248/Celtics-Players-Expected-Ime-Udoka-To-Return-Next-Season",
               "description": "<p>Marcus Smart and other members of the Boston Celtics were led to believe Ime Udoka would return as head coach following his one-year suspension.</p>\n<p>\"From what we know and were told, it was just a suspension. We didn't know he was leaving to go coach somebody else,\" Smart said. \"We thought they just suspended him for the year and he'd be back. That's why it's confusing. We weren't told too much about it.\"</p>\n<p>Udoka was suspended by the Celtics for multiple violations of team policies related to an intimate relationship with a female staff member in the organization in mid-September. </p>\n<p>The Celtics elevated Joe Mazzulla to interim head coach in place of Udoka. </p>\n<p>Udoka is now on the verge of being hired by the Brooklyn Nets.</p>\n<p>Jaylen Brown said he played a role in initially bringing Udoka to Boston and was pleased to see him get another chance so quickly.</p>\n<p>\"It would've been awesome if we could've figured out a way for it to be with us, but I guess that wasn't the case,\" Brown said. \"I'm just happy to see a Black head coach end up back on his feet because I've seen situations where something like this might not have been the case.\"</p>\n<p>Smart said asking questions to Celtics president Brad Stevens, his former head coach, wouldn't help because no one can divulge much information.</p>\n<p>\"I don't think you'll ever get a straight answer about what's really going on because there's only so much they can say and that they know,\" Smart said. \"You can ask, but I don't think it's going to change anything, help anything. I think asking is just to express how you feel, whatever you feel, off your chest. But really that's it. I don't think it'll change or affect any outcome. They made their decision.\"</p>",
               "pubDate": "Wed, 02 Nov 2022 15:30:53 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269248/Celtics-Players-Expected-Ime-Udoka-To-Return-Next-Season",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Udoka_Ime_bos_211227.jpg"
               }
            },
            {
               "title": "Kevin Durant 'Shocked' Nets Parted Ways With Steve Nash",
               "link": "https://basketball.realgm.com/wiretap/269244/Kevin-Durant-Shocked-Nets-Parted-Ways-With-Steve-Nash",
               "description": "<p>Kevin Durant reportedly had no input in the decision from the Brooklyn Nets to fire Steve Nash as head coach.</p>\n<p>\"You're always shocked when a move like this happens,\" Durant said after a 108-99 loss to the Chicago Bulls on Tuesday night. \"But it's normal in the NBA. It's about getting ready for the game tonight. It's a quick turn always in the league, especially during the season. You've got practice, games coming up, so you can't think too much about it. It was on my mind for a little bit today.\"</p>\n<p>Durant said he found out about the news regarding Nash around 1:15 p.m. ET after he woke up from a pregame nap and watched ESPN.</p>\n<p>Durant reportedly asked for Nash and Sean Marks to be fired over the offseason before rescinding his trade request. </p>\n<p>Durant was asked why he thought it didn't work out for Nash in Brooklyn.</p>\n<p>\"A lot of stuff,\" Durant said. \"We didn't have a healthy team. We just didn't play well. And that's what happens in the league. S--- happens. That doesn't take away from Steve's basketball IQ, how he teaches the game. I don't think that takes away from anything. It just didn't work out.\"</p>\n<p>Marks was asked on Tuesday if any players were consulted in the decision.</p>\n<p>\"Zero,\" said Marks. \"There was zero input from any of the players on this. I think this was a decision that we didn't need that. Steve and I didn't need that. Obviously I've talked to [owner] Joe [Tsai] about this, but the players were not consulted. They were told ahead of time that this was the direction we were going.\"</p>",
               "pubDate": "Wed, 02 Nov 2022 11:52:35 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269244/Kevin-Durant-Shocked-Nets-Parted-Ways-With-Steve-Nash",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Durant_Kevin_bkn_220703.jpg"
               }
            },
            {
               "title": "Gonzaga In Discussions To Join Big 12",
               "link": "https://basketball.realgm.com/wiretap/269252/Gonzaga-In-Discussions-To-Join-Big-12",
               "description": "<p>Gonzaga athletic director Chris Standiford met with the Big 12 commissioner Brett Yormark last week to discuss a potential move to the conference, sources told Pete Thamel of ESPN.</p>\n<p>Gonzaga has reportedly been exploring its conference options. It has also had discussions with the Big East and the Pac-12, though the extent of those conversations is unknown.</p>\n<p>Yormark has spoken about his desire to add a fourth time zone to the conference.</p>\n<p>The Big 12 is also nearing a six-year contract extension with its television partners ESPN and Fox. </p>\n<p>The potential of Gonzaga joining the conference was brought up in a \"cursory\" manner in contract discussions, though had no impact on the final television deal. </p>",
               "pubDate": "Thu, 03 Nov 2022 01:07:52 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269252/Gonzaga-In-Discussions-To-Join-Big-12",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Logo_Gonzaga.jpg"
               }
            },
            {
               "title": "Kentucky Commit Rob Dillingham Signs With Overtime Elite",
               "link": "https://basketball.realgm.com/wiretap/269255/Kentucky-Commit-Rob-Dillingham-Signs-With-Overtime-Elite",
               "description": "<p>Rob Dillingham, one of the top basketball recruits in the country, was caught in a tough spot with the closing of Donda Academy. In need of a new school and program, Dillingham will join Overtime Elite.</p>\n<p>The 6-foot-3 guard will retain his college eligibility. That will allow Dillingham to fulfill his commitment to attend the University of Kentucky.</p>\n<p>In 2021, Dillingham helped lead Team USA to the gold medal in the U16 Americans Championships. Dillingham averaged 15.7 points, 6.2 assists and 3.2 steals over six games during Team USA's run to the gold.</p>",
               "pubDate": "Thu, 03 Nov 2022 09:07:56 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269255/Kentucky-Commit-Rob-Dillingham-Signs-With-Overtime-Elite",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/OvertimeLeague21.jpg"
               }
            },
            {
               "title": "Jordan Hall, Spurs Agree To Non-Guaranteed Deal",
               "link": "https://basketball.realgm.com/wiretap/269243/Jordan-Hall-Spurs-Agree-To-Non-Guaranteed-Deal",
               "description": "<p>The San Antonio Spurs have agreed to sign Jordan Hall to a one-year, non-guaranteed deal.</p>\n<p>Hall played for the Spurs in Summer League and in the preseason.</p>\n<p>Hall was recently waived from his Two-Way deal. The Spurs had a roster spot open up after they waived Joshua Primo.</p>",
               "pubDate": "Wed, 02 Nov 2022 11:02:29 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269243/Jordan-Hall-Spurs-Agree-To-Non-Guaranteed-Deal",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/nba_sanantoniospurs.jpg"
               }
            },
            {
               "title": "Nets Made 'No Substantial Contact' With Quin Snyder During Coaching Search",
               "link": "https://basketball.realgm.com/wiretap/269256/Nets-Made-No-Substantial-Contact-With-Quin-Snyder-During-Coaching-Search",
               "description": "<p>The Brooklyn Nets made \"no substantial contact\" with Quin Snyder on his potential interest in becoming their next head coach, sources tell Jake Fischer of Yahoo! Sports.</p>\n<p>Following the dismissal of Steve Nash as head coach, Adrian Wojnarowski of ESPN immediately reported that the Nets were interested in Snyder and Ime Udoka. Within an hour, reports surfaced that the Nets were set to hire Udoka once they worked through contractual issues.</p>\n<p>By all accounts, Sean Marks zeroed in on Udoka exclusively. Udoka and the Nets were engaged in conversations over the weekend before Nash was fired. Marks and Udoka also have the same representation in Steven Heumann of CAA.</p>\n<p>Wojnarowski has also reported that the Nets probably would not turn to Udoka due to his actions leading to a season long suspension by the Boston Celtics if there were another candidate with a similar resume. </p>\n<p>Snyder stepped down as head coach of the Utah Jazz this past offseason.</p>",
               "pubDate": "Thu, 03 Nov 2022 11:07:39 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269256/Nets-Made-No-Substantial-Contact-With-Quin-Snyder-During-Coaching-Search",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Snyder_Quin_uta_220517.jpg"
               }
            },
            {
               "title": "Becky Hammon Joins ESPN As Analyst",
               "link": "https://basketball.realgm.com/wiretap/269253/Becky-Hammon-Joins-ESPN-As-Analyst-",
               "description": "<p>Becky Hammon will join ESPN as an NBA analyst for this season, the league announced on Wednesday.</p>\n<p>Hammon will appear on shows ranging from \"Get Up,\" \"First Take,\" and \"SportsCenter.\"</p>\n<p>Hammon, who won the 2022 WNBA title with the Las Vegas Aces, was named the WNBA Coach of the Year. </p>",
               "pubDate": "Thu, 03 Nov 2022 01:29:29 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269253/Becky-Hammon-Joins-ESPN-As-Analyst-",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/nba_realgm.jpg"
               }
            },
            {
               "title": "Joel Embiid Misses Second Straight Game With Flu",
               "link": "https://basketball.realgm.com/wiretap/269251/Joel-Embiid-Misses-Second-Straight-Game-With-Flu",
               "description": "<p>Joel Embiid missed the Philadelphia 76ers' 121-111 loss to the Washington Wizards on Wednesday with the flu.</p>\n<p>Embiid also missed Monday's game for the same reason.</p>\n<p>Doc Rivers added that Embiid has not been with the team to prevent spreading it around the locker room. </p>\n<p>Embiid is averaging 27.2 points and 9.5 rebounds on the season. </p>\n<p> </p>",
               "pubDate": "Thu, 03 Nov 2022 00:55:16 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269251/Joel-Embiid-Misses-Second-Straight-Game-With-Flu",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Embiid_Joel_phi_220514.jpg"
               }
            },
            {
               "title": "NBA To Stream Select G League Ignite Games On NBA App",
               "link": "https://basketball.realgm.com/wiretap/269242/NBA-To-Stream-Select-G-League-Ignite-Games-On-NBA-App",
               "description": "<p>The NBA announced that select G League Ignite games will be streamed live via the NBA App this season. This includes the Ignite's season-opener this Friday, November 4.</p>\n<p>The league also announced that several Ignite games will air on ESPN channels this season. The NBA previously announced that all games of French club Metropolitans 92 will air via the NBA App this season.</p>\n<p>Metropolitans 92 and the Ignite feature Victor Wembanyama and Scoot Henderson, respectively. Wembanyama and Henderson are widely expected to be the first two players selected at the 2023 NBA Draft.</p>",
               "pubDate": "Wed, 02 Nov 2022 09:38:45 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269242/NBA-To-Stream-Select-G-League-Ignite-Games-On-NBA-App",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Henderson_Scoot_gl_221005.jpg"
               }
            },
            {
               "title": "Overtime Elite Signs Media Deal With Amazon",
               "link": "https://basketball.realgm.com/wiretap/269241/Overtime-Elite-Signs-Media-Deal-With-Amazon",
               "description": "<p>Overtime Elite, which formed as an alternative option to high school and college for basketball players, has signed their first media rights deal. Overtime Elite, or OTE, will air 20 games on Amazon Prime over each of the next three years.</p>\n<p>In addition to covering games, Amazon will also invest in OTE. This also continues Amazon's investment in live sports. The company is broadcasting NFL games this season, as part of an exclusive Thursday night package, MLB games and WNBA games. Amazon is rumored to be interested in bidding on covering NBA games during upcoming media rights negotiations for the NBA.</p>\n<p>Amazon will also produce an unscripted series on OTE. This is expected to take the format of previous unscripted series Amazon has run on English Premier League teams, as well as NFL teams.</p>\n<p>This season, OTE features Amen and Ausur Thompson on their roster. The twins are both routinely seen as top-10 picks in the 2023 NBA Draft. Now, fans will have a consistent way to see the Thompson twins, as well as other talented players on a streaming service that isn't social media based.</p>",
               "pubDate": "Wed, 02 Nov 2022 09:26:19 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269241/Overtime-Elite-Signs-Media-Deal-With-Amazon",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/OvertimeLeague21.jpg"
               }
            },
            {
               "title": "Reggie Miller Calls Out NBA Players For Being Silent On Kyrie Irving",
               "link": "https://basketball.realgm.com/wiretap/269240/Reggie-Miller-Calls-Out-NBA-Players-For-Being-Silent-On-Kyrie-Irving",
               "description": "<p>With the Brooklyn Nets facing the Chicago Bulls on TNT on Tuesday night, the broadcast opened with discussion of the most recent Nets drama. The bulk of that conversation centered on Kyrie Irving sharing a link to a film with anti-Semitic sentiments.</p>\n<p>TNT's Reggie Miller was disappointed in Irving. But, even more so, Miller was disappointed in the reactions, or lack thereof, of fellow NBA players.</p>\n<p>\"In years past, this league has been great because the players have led the way and they have strong voices,\" Miller said. \"When Donald Sterling stepped in it, when Robert Sarver just recently stepped in it, our voices in the basketball community and our players were vocally strong in some type of discipline being handed down... or be gone.\"</p>\n<p>\"The players have dropped the ball in this case when it's been one of their own. It's been crickets,\" Miller continued. \"And it's disappointing, because this league has been built on the shoulders of the players being advocates. Right is right and wrong is wrong. And if you're gonna call out owners, and rightfully so, then you've got to call out players as well. You can't go silent in terms of this for Kyrie Irving. I want to hear the players, and their strong opinions as well, just as we heard about Robert Sarver and Donald Sterling.\"</p>",
               "pubDate": "Wed, 02 Nov 2022 09:11:20 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269240/Reggie-Miller-Calls-Out-NBA-Players-For-Being-Silent-On-Kyrie-Irving",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Miller_Reggie_nba_060401.jpg"
               }
            },
            {
               "title": "Charles Barkley: NBA Should Have Suspended Kyrie Irving",
               "link": "https://basketball.realgm.com/wiretap/269239/Charles-Barkley-NBA-Should-Have-Suspended-Kyrie-Irving",
               "description": "<p>On Tuesday night's pregame Inside the NBA segment, Charles Barkley had strong thoughts on Kyrie Irving sharing a link to an anti-Semitic film. Barkley said the NBA should have suspended Irving.</p>\n<p>\"I think he should have been suspended,\" Barkley said about Irving. \"I think Adam (Silver) should have suspended him.\"</p>\n<p>Barkley went on to say that NBA commissioner Adam Silver being Jewish should have played in to suspending Irving. He also supported the NBA disciplining those who have made homophobic comments or insulted the Black community.</p>\n<p>\"First of all, Adam is Jewish - you can't take my $40 million and insult my religion. You gonna insult me, you have the right, but I have the right to say, 'You can't take my $40 million and insult my religion.' I think the NBA, they made a mistake,\" Barkley said. \"We've suspended people and fined people who have made homophobic slurs. And that was the right thing to do. If you insult the black community, you should be suspended or fined heavily.\"</p>",
               "pubDate": "Wed, 02 Nov 2022 09:03:09 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269239/Charles-Barkley-NBA-Should-Have-Suspended-Kyrie-Irving",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Irving_Kyrie_bkn_200617.jpg"
               }
            },
            {
               "title": "Darius Garland Goes Through First Practice Since Eye Injury, Could Return Wednesday",
               "link": "https://basketball.realgm.com/wiretap/269238/Darius-Garland-Goes-Through-First-Practice-Since-Eye-Injury-Could-Return-Wednesday",
               "description": "<p>Darius Garland completed his first full-contact practice since suffering an eye injury against the Toronto Raptors on opening night.</p>\n<p>Garland could potentially return on Wednesday against the Celtics. </p>\n<p>\"We'll see tomorrow. He went through everything. It's how he's feeling tomorrow and what the swelling looks like. But he was good today. He's done enough to go ahead and play if he's gonna play,\" said J.B. Bickerstaff.</p>\n<p>The Cavs have gone 5-0 without Garland in the lineup. </p>",
               "pubDate": "Wed, 02 Nov 2022 01:06:15 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269238/Darius-Garland-Goes-Through-First-Practice-Since-Eye-Injury-Could-Return-Wednesday",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Garland_Darius_cle_221025.jpg"
               }
            },
            {
               "title": "Gary Payton II Out Until At Least November 15",
               "link": "https://basketball.realgm.com/wiretap/269237/Gary-Payton-II-Out-Until-At-Least-November-15",
               "description": "<p>Gary Payton II will not make his season debut for the Portland Trail Blazers until at least November 15, sources told Chris Haynes of TNT.</p>\n<p>Payton, who signed a <a href=\"https://basketball.realgm.com/wiretap/267721/Blazers-Finalizing-Three-Year-$28M-Deal-With-Gary-Payton-II\">three-year, $28 million deal</a> with the Blazers this offseason, is recovering from abdominal surgery. </p>\n<p> </p>",
               "pubDate": "Wed, 02 Nov 2022 01:00:54 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269237/Gary-Payton-II-Out-Until-At-Least-November-15",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Payton_Gary_gsw_220425.jpg"
               }
            },
            {
               "title": "De'Aaron Fox Diagnosed With Bone Bruise In Knee, No Structural Damage",
               "link": "https://basketball.realgm.com/wiretap/269236/DeAaron-Fox-Diagnosed-With-Bone-Bruise-In-Knee-No-Structural-Damage",
               "description": "<p>De'Aaron Fox was diagnosed with a bone bruise in his knee, sources told Shams Charania of The Athletic.</p>\n<p>There is no structural damage in Fox's knee.</p>\n<p>Fox will miss Wednesday's game against the Heat and is day-to-day. </p>",
               "pubDate": "Wed, 02 Nov 2022 00:56:10 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269236/DeAaron-Fox-Diagnosed-With-Bone-Bruise-In-Knee-No-Structural-Damage",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Fox_Deaaron_sac_210810.jpg"
               }
            },
            {
               "title": "Kyrie Irving Won't Speak To Media Until He 'Simmers Down'",
               "link": "https://basketball.realgm.com/wiretap/269235/Kyrie-Irving-Wont-Speak-To-Media-Until-He-Simmers-Down",
               "description": "<p>Kyrie Irving did not speak to the media after the second consecutive game after fallout from his decision to link to an antisemitic film on social media and comments he made to media when asked about it following Saturday's game.</p>\n<p>\"I think everybody knows he's going to have to answer these questions at some point and he hasn't sort of shied away in the past,\" Sean Marks said. \"But I think the last postgame meeting didn't go well and we're not trying to cover it up, I think this is something that needs to be addressed, but let's address it in the right form and fashion.\"</p>\n<p>Irving will continue playing in the meantime.</p>\n<p>\"At some point he will come up here and do media again, but I think at this point we don't want to cause more fuss right now, more interaction with people,\" Marks said. \"Let's let him simmer down and let's ... I guess let's let cooler minds prevail. We need to go out and educate ourselves, educate the whole group and get some direction, seek from the experts, and one of them is certainly the ADL.\"</p>",
               "pubDate": "Tue, 01 Nov 2022 22:59:09 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269235/Kyrie-Irving-Wont-Speak-To-Media-Until-He-Simmers-Down",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Irving_Kyrie_bkn_211020.jpg"
               }
            },
            {
               "title": "Celtics Were Unlikely To Reinstate Ime Udoka As Head Coach In 2023",
               "link": "https://basketball.realgm.com/wiretap/269234/Celtics-Were-Unlikely-To-Reinstate-Ime-Udoka-As-Head-Coach-In-2023",
               "description": "<p>The Boston Celtics were unlikely to reinstate Ime Udoka in 2023, sources tell Adrian Wojnarowski.</p>\n<p>Udoka was found to have used crude language in his language with his dialogue with a female subordinate before the start of an improper workplace relationship.</p>\n<p>The power dynamic associated with Judoka's relationship was the primary finding and policy violation cited in the law firm's report and was completed early last week.</p>\n<p>The Celtics are said to be \"<a href=\"https://basketball.realgm.com/wiretap/269233/Celtics-Fully-Invested-In-Joe-Mazzulla\">fully invested</a>\" in Joe Mazzulla. </p>\n<p>Udoka is set to be hired by the Brooklyn Nets as head coach. There have also been other teams interested in hiring Udoka. </p>",
               "pubDate": "Tue, 01 Nov 2022 15:06:10 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269234/Celtics-Were-Unlikely-To-Reinstate-Ime-Udoka-As-Head-Coach-In-2023",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Udoka_Ime_bos_211227.jpg"
               }
            },
            {
               "title": "Celtics 'Fully Invested' In Joe Mazzulla",
               "link": "https://basketball.realgm.com/wiretap/269233/Celtics-Fully-Invested-In-Joe-Mazzulla",
               "description": "<p>The Boston Celtics are \"fully invested in Joe Mazzulla and pleased with how he's leading the franchise,\" according to Gary Washburn of the Boston Globe.</p>\n<p>Mazzulla was elevated to interim head coach following the suspension of Ime Udoka. The Brooklyn Nets plan to hire Udoka as head coach.</p>\n<p>Mazzulla had been with the Celtics for multiple years before they hired Udoka. </p>",
               "pubDate": "Tue, 01 Nov 2022 14:53:37 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269233/Celtics-Fully-Invested-In-Joe-Mazzulla",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Mazzulla_Joe_bos_221013.jpg"
               }
            },
            {
               "title": "Nets To Hire Ime Udoka As Head Coach",
               "link": "https://basketball.realgm.com/wiretap/269231/Nets-To-Hire-Ime-Udoka-As-Head-Coach",
               "description": "<p>The Brooklyn Nets will hire Ime Udoka as their next head coach.</p>\n<p>Udoka is currently suspended for the entire 22-23 season by the Boston Celtics due to an inappropriate relationship with a staffer.</p>\n<p>The Celtics granted Brooklyn permission to speak with Udoka and will allow him to leave freely without seeking any compensation.</p>\n<p>Boston hired Udoka before the 21-22 season after he served as an assistant coach with the Nets. Udoka helped lead the Celtics to The Finals.</p>\n<p>Udoka previously worked with Sean Marks with the San Antion Spurs. </p>",
               "pubDate": "Tue, 01 Nov 2022 14:16:31 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269231/Nets-To-Hire-Ime-Udoka-As-Head-Coach",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Udoka_Ime_bos_220911.jpg"
               }
            },
            {
               "title": "Nets Interested In Ime Udoka, Quin Snyder For Head Coaching Job",
               "link": "https://basketball.realgm.com/wiretap/269230/Nets-Interested-In-Ime-Udoka-Quin-Snyder-For-Head-Coaching-Job",
               "description": "<p>The Brooklyn Nets have identified Ime Udoka and Quin Snyder among possible candidates for their head coaching vacancy. </p>\n<p>The Nets <a href=\"https://basketball.realgm.com/wiretap/269229/Steve-Nash-Nets-Agree-To-Part-Ways\">parted ways</a> with Steve Nash on Tuesday.</p>\n<p>The Boston Celtics are expected to allow Udoka leave the franchise for another job. Udoka was an assistant coach with the Nets before he was hired by the Celtics before the 21-22 season.</p>\n<p>Snyder stepped down as head coach of the Utah Jazz after the conclusion of their 21-22 season. </p>",
               "pubDate": "Tue, 01 Nov 2022 13:06:28 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269230/Nets-Interested-In-Ime-Udoka-Quin-Snyder-For-Head-Coaching-Job",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Udoka_Ime_bos_220920.jpg"
               }
            },
            {
               "title": "Steve Nash, Nets Agree To Part Ways",
               "link": "https://basketball.realgm.com/wiretap/269229/Steve-Nash-Nets-Agree-To-Part-Ways",
               "description": "<p>The Brooklyn Nets have fired Steve Nash as head coach.</p>\n<p>Jacque Vaughn will serve as acting head coach for Brooklyn's game on Tuesday against the Chicago Bulls.</p>\n<p><a href=\"https://twitter.com/wojespn/status/1587488162926010369\">A source told</a> Adrian Wojnarowski of ESPN that the decision was mutual.</p>\n<p style=\"font-weight: 400;\">\"We want to thank Steve for everything he brought to our franchise over the past two-plus seasons,\" said General Manager Sean Marks. \"Since becoming head coach, Steve was faced with a number of unprecedented challenges, and we are sincerely grateful for his leadership, patience and humility throughout his tenure. Personally, this was an immensely difficult decision; however, after much deliberation and evaluation of how the season has begun, we agreed that a change is necessary at this time. We wish Steve, Lilla and their family all the best in the future.\"</p>\n<p style=\"font-weight: 400;\">Brooklyn Nets Governor Joe Tsai said, \"I've gotten to know Steve during his time in Brooklyn, and he is not one to shy away from challenges. My admiration and respect for him grew over time as he brought hard work and positive attitude to our organization every day, even in periods of exceptional storm surrounding the team. Clara and I want to thank Steve, Lilla and their family for making this extraordinary commitment. We began this journey as colleagues, we part as friends.\"</p>\n<p style=\"font-weight: 400;\">Nash put out his own statement independently. </p>\n<p style=\"font-weight: 400;\">\"A very heartfelt thanks to Joe and Clara Tsai along with Sean Marks for giving me the opportunity to coach the Brooklyn Nets. It was an amazing experience with many challenges I'm incredibly grateful for.</p>\n<p style=\"font-weight: 400;\">\"It was a pleasure to work with the players, performance team and front office everyday. I'm especially grateful to my coaching staff and video room who are a talented group with so much character and professionalism.</p>\n<p style=\"font-weight: 400;\">\"Lastly, thanks to Brooklyn and the passionate fans who support this team. Family first and my family has found a home here and LOVES being a part of this beautiful community. I wish the Nets all the success in the world and the Nash's will be rooting for our team as they turn this season around.\"</p>\n<p style=\"font-weight: 400;\">The Nets hired Nash in 2020 despite him not having any previous coaching experience. </p>\n<p style=\"font-weight: 400;\">Kevin Durant sought the dismissal of Nash and Mark during the offseason as part of his trade request, but was unsuccessful. </p>",
               "pubDate": "Tue, 01 Nov 2022 12:53:36 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269229/Steve-Nash-Nets-Agree-To-Part-Ways",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Nash_Steve_bkn_210527.jpg"
               }
            },
            {
               "title": "Jakob Poeltl Expects To Make More In Free Agency Than What Spurs Can Offer On Extension",
               "link": "https://basketball.realgm.com/wiretap/269228/Jakob-Poeltl-Expects-To-Make-More-In-Free-Agency-Than-What-Spurs-Can-Offer-On-Extension",
               "description": "<p>Jakob Poeltl can sign a contract extension with the San Antonio Spurs, but the two sides are limited on the number that can be agreed upon at this point due to his current contract that pays $9.4 million. The two sides have reportedly discussed an extension, but Poeltl believes he can do better on the open market this offseason when his contract expires.</p>\n<p>\"Jakob Poeltl is in the final year of his contract,\" said Brian Windhorst. \"From what I'm told, the Spurs discussed a contract extension with him, but he's limited by how much he can sign for. It's the same reason they traded Dejounte Murray. They did such a good job on the contract that it almost works against you because when you want to sign a player, the player wants more than you can give him because you're limited on how much of a raise you can give in an extension.</p>\n<p>\"I believe Poeltl can sign an extension that can average $14 million per year. That's pretty good money for him, but he thinks he can do better and I don't blame him the way he's playing he probably can.</p>\n<p>\"Maybe the Spurs get to the offseason and re-sign him. He's headed for free agency. He can reverse course and take the extension offer. I don't know that's what they offered. I know the max they can offer him $14.5 million, $15 million on average. </p>\n<p>\"He is a trade candidate.\"</p>",
               "pubDate": "Tue, 01 Nov 2022 12:14:45 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269228/Jakob-Poeltl-Expects-To-Make-More-In-Free-Agency-Than-What-Spurs-Can-Offer-On-Extension",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Poeltl_Jakob_sas_201120.jpg"
               }
            },
            {
               "title": "NBA Preparing To Sell Rights To Streaming Games With Bidding Starting At $1 Billion",
               "link": "https://basketball.realgm.com/wiretap/269227/NBA-Preparing-To-Sell-Rights-To-Streaming-Games-With-Bidding-Starting-At-$1-Billion",
               "description": "<p>The NBA is preparing to sell a package of streaming-only games under its next media rights package with the bidding to likely start at $1 billion per year.</p>\n<p>The package is expected to attract the major streaming companies including Amazon and Apple. </p>\n<p>Under the current deal signed in 2014, streaming comes under the league's own media platforms, ESPN, TNT, and the various regional sports networks (RSNs) showing local games.</p>\n<p>One source says Amazon would like an NBA package along with the NFL.</p>\n<p>\"Amazon is locked and loaded for a shot at the NBA,\" said a source.</p>\n<p>The NBA could sell a streaming package of 20-40 games during its 19-week regular season.</p>\n<p>The NBA is set to come off its nine-year, $24 billion deal with Disney and Turner that pays $2.6 billion per year. With an additional $1 billion in streaming, the league could get close to $7 billion per year in annual rights fees. </p>",
               "pubDate": "Tue, 01 Nov 2022 11:23:09 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269227/NBA-Preparing-To-Sell-Rights-To-Streaming-Games-With-Bidding-Starting-At-$1-Billion",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Silver_Adam_nba_220225.jpg"
               }
            },
            {
               "title": "Udoka Azubuike, Leandro Bolmaro, RJ Hampton Had 23-24 Rookie Scale Team Options Declined",
               "link": "https://basketball.realgm.com/wiretap/269226/Udoka-Azubuike-Leandro-Bolmaro-RJ-Hampton-Had-23-24-Rookie-Scale-Team-Options-Declined",
               "description": "<p>Three players from the 2020 NBA Draft class had their 2023-24 rookie scale team options declined. The deadline for teams to exercise these options for next season was Monday, October 31.</p>\n<p>Udoka Azubuike of the Utah Jazz had his fourth-year option declined. Jazz teammate Leandro Bolmaro had his third-year option declined by the Jazz. (Bolmaro was also drafted in 2020 but did not sign until 2021.) Bolmaro was traded from the Minnesota Timberwolves to Utah this past offseason.</p>\n<p>RJ Hampton of the Orlando Magic also had his fourth-year option declined. Hampton was originally drafted by the Denver Nuggets before being traded to Orlando at the 2021 trade deadline.</p>\n<p>Fellow 2020 draftee Jalen Smith had his third-year option declined by the Phoenix Suns last year. Smith was then traded to the Indiana Pacers at the 2022 trade deadline.</p>\n<p>Azubuike, Bolmaro and Hampton's teams, or an acquiring team (as was the case with Smith), are now capped at paying them a first-year salary equal to the declined amount of their option. Smith re-signed with the Pacers on this type of deal this past summer.</p>",
               "pubDate": "Tue, 01 Nov 2022 09:38:31 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269226/Udoka-Azubuike-Leandro-Bolmaro-RJ-Hampton-Had-23-24-Rookie-Scale-Team-Options-Declined",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Hampton_RJ_orl_220120.jpg"
               }
            },
            {
               "title": "Get Your Latest NBA News From RealGM's Basketball Wiretap",
               "link": "https://basketball.realgm.com/news",
               "description": "Get all the latest news and happenings from around the NBA with RealGM's Basketball Wiretap.",
               "pubDate": "Thu, 03 Nov 2022 11:17:01 EDT",
               "guid": "https://basketball.realgm.com/news"
            }
         ]
      },
      "_xmlns:media": "http://search.yahoo.com/mrss/",
      "_version": "2.0"
   }
}