{
   "rss": {
      "channel": {
         "title": "RealGM Basketball Wiretap",
         "link": "https://basketball.realgm.com/news",
         "description": "Basketball News, Rumors, Scores, Stats, Analysis, Depth Charts, Forums",
         "language": "en-us",
         "pubDate": "Wed, 19 Oct 2022 18:17:01 EDT",
         "lastBuildDate": "Wed, 19 Oct 2022 18:17:01 EDT",
         "item": [
            {
               "title": "Giannis Antetokounmpo On Kobe Bryant: I Think We're Very Similar In Some Areas Of Mindset",
               "link": "https://basketball.realgm.com/wiretap/269088/Giannis-Antetokounmpo-On-Kobe-Bryant-I-Think-Were-Very-Similar-In-Some-Areas-Of-Mindset",
               "description": "<p>Giannis Antetokounmpo admits he was never close with Kobe Bryant, but he believes his mindset is similar. </p>\n<p>\"I will never say this, I will never disrespect the name of the great Kobe. I don't like mentioning him,\" Antetokounmpo told The Athletic when asked to compare their mentalities. \"I feel like he should be mentioned, should never be forgotten. But I don't like mentioning his name to bring attention to the conversation that we are about to have. I wasn't close to him. I wasn't this with him or that with him. But I would say this, in some areas of his mindset, I think we're very similar.\"</p>\n<p>In 2018 at the All-Star Game, Antetokounmpo sought out a conversation with Bryant and subsequently worked out with him that next offseason.</p>\n<p>\"I might not be as talented as him, but when we're talking about a guy that worked extremely hard from his first day until he retired. A guy that plays to win, a guy that pushes himself to the limit, a guy that has a killer mentality when he steps on the court,\" Antetokounmpo said, as he started to recount that workout. \"It's almost like having - I think he had two personalities.</p>\n<p>\"Like when we were on the sideline and we were talking and I was taking notes, laughing smiling, joking around, talking. But when we stepped on the court, It was like motherf-er didn't even know me. 'I thought you were like my friend.' Again. Again. Again. Again. 'My bad, Kobe. How many more times are we gonna do it?' Twenty-five. 'OK, 25.' No, 25 makes. Twenty-five makes on the same move?' And it's not like you're just shooting. You're going hard. I was like, damn, this guy is different.\"</p>",
               "pubDate": "Wed, 19 Oct 2022 10:05:11 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269088/Giannis-Antetokounmpo-On-Kobe-Bryant-I-Think-Were-Very-Similar-In-Some-Areas-Of-Mindset",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Antetokounmpo_Giannis_mil_220513.jpg"
               }
            },
            {
               "title": "Wolves Waive Eric Paschall From Two-Way",
               "link": "https://basketball.realgm.com/wiretap/269099/Wolves-Waive-Eric-Paschall-From-Two-Way",
               "description": "<p>The Minnesota Timberwolves have waived Eric Paschall from his Two-Way contract.</p>\n<p>Paschall appeared in one preseason game with the Wolves.</p>\n<p>Last season, Paschall averaged 5.8 points and 1.8 rebounds in 12.7 minutes with the Utah Jazz.</p>",
               "pubDate": "Wed, 19 Oct 2022 17:29:22 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269099/Wolves-Waive-Eric-Paschall-From-Two-Way",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/nba_minnesotatimberwolves.jpg"
               }
            },
            {
               "title": "LeBron James: Lakers 'Not A Team Constructed Of Great Shooting'",
               "link": "https://basketball.realgm.com/wiretap/269086/LeBron-James-Lakers-Not-A-Team-Constructed-Of-Great-Shooting",
               "description": "<p>The Los Angeles Lakers shot just 10-of-40 on three-pointers in their season-opening loss at the Golden State Warriors. Following the game, LeBron James was frank in his assessment of that part of the Lakers game.</p>\n<p>\"We're getting great looks, but it could also be teams giving us great looks. To be completely honest, we're not a team constructed of great shooting,\" James said. \"It's not like we're sitting here with a lot of lasers on our team.\"</p>\n<p>Los Angeles' starting five of James, Anthony Davis, Russell Westbrook, Patrick Beverley and Lonnie Walker IV combined to go 5-of-24 from behind the arc. Those failures from distance led Lakers coach Darvin Ham to give Matt Ryan 18 minutes, after Ryan made the team off of a training camp contract. Ham said postgame he was looking for a way to get some shooting on the floor, which Ryan can provide.</p>",
               "pubDate": "Wed, 19 Oct 2022 09:36:11 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269086/LeBron-James-Lakers-Not-A-Team-Constructed-Of-Great-Shooting",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/James_LeBron_lal_220208.jpg"
               }
            },
            {
               "title": "James Bouknight Was Unconscious, Holding Gun When Found By Police",
               "link": "https://basketball.realgm.com/wiretap/269096/James-Bouknight-Was-Unconscious-Holding-Gun-When-Found-By-Police",
               "description": "<p>James Bouknight was found intoxicated and unconscious and holding a gun with his vehicle in drive before he was arrested Sunday morning on DWI charges.</p>\n<p>Police said they responded to reports that a person was passed out in his vehicle in a Charlotte parking lot Sunday morning, blocking traffic.</p>\n<p>According to the police report, officers saw Bouknight, 22, unconscious inside the vehicle with the vehicle running and in drive. He had the handgun in his hands. Officers set up a perimeter and attempted to awaken Bouknight for approximately an hour using a public address system, blasting airhorns and using lights.</p>\n<p>Once Bouknight was awake, police say he refused to comply with commands and appeared confused for several minutes. They said he ate food inside his vehicle and then crashed into two police cars -- one of front of him and another behind him.</p>\n<p>Bouknight eventually exited the vehicle and was detained.</p>\n<p>\"I just want to apologize for being a distraction before the start of the season for my teammates and what we've got going on,\" Bouknight said Tuesday. \"It's disappointing, but I'm just trying to learn from it, stay strong, move on and continue to grow.\"</p>",
               "pubDate": "Wed, 19 Oct 2022 14:41:31 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269096/James-Bouknight-Was-Unconscious-Holding-Gun-When-Found-By-Police",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Bouknight_James_cha_211108.jpg"
               }
            },
            {
               "title": "Hollinger & Duncan: Extension SZN; Notable Season Predictions",
               "link": "https://basketball.realgm.com/wiretap/269098/Hollinger-Duncan-Extension-SZN;-Notable-Season-Predictions",
               "description": "<p><iframe src=\"https://player.simplecast.com/fe7a70cf-d5b8-426a-b0fd-631a9bae9f46?dark=false\" width=\"100%\" height=\"200px\" frameborder=\"no\" scrolling=\"no\" seamless=\"\"></iframe></p>\n<p>John Hollinger and Nate Duncan discuss some absolutely fascinating extensions completed over the last week, including Kevin Porter, Jr., DeAndre Hunter, Nassir Little, Jordan Poole, and Andrew Wiggins.</p>\n<p>Then John explains his pick of the 76ers to win the championship, and they discuss other season prediction agreements and disagreements.</p>\n<p><a href=\"DuncdOn.SupportingCast.FM\">Sign up here for Dunc'd On Prime</a>, the only place to get all Hollinger & Duncan episodes. If you want to know more about Dunc'd On Prime and why we're making this move, <a href=\"https://medium.com/@NateDuncanNBA/hollinger-duncan-joins-duncd-on-prime-1191460c295f\">please read this letter from Nate to our listeners</a>.</p>",
               "pubDate": "Wed, 19 Oct 2022 16:31:08 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269098/Hollinger-Duncan-Extension-SZN;-Notable-Season-Predictions",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Porter_Kevin_hou_210329.jpg"
               }
            },
            {
               "title": "Russell Westbrook 'Absolutely' Believes Coming Off Bench Contributed To Hamstring Injury",
               "link": "https://basketball.realgm.com/wiretap/269085/Russell-Westbrook-Absolutely-Believes-Coming-Off-Bench-Contributed-To-Hamstring-Injury",
               "description": "<p>Los Angeles Lakers guard Russell Westbrook played opening night, despite having dealt with hamstring soreness to end the preseason. Westbrook started and logged 31 minutes in the Lakers loss to the Golden State Warriors.</p>\n<p>After the game, Westbrook was asked about Lakers coach Darvin Ham experimenting with him coming off the bench to end the preseason. The veteran point guard played fewer than five minutes before exiting with a sore hamstring. Westbrook believes that was caused, in part, by coming off the bench.</p>\n<p>\"I've been doing the same thing for 14 years straight,\" Westbrook said. \"Honestly I didn't even know what to do pregame.\"</p>\n<p>Postgame, Ham praised Westbrook's contributions and willingness to sacrifice for the team. He did not address if he planned to bring the former All-Star off the bench at during the regular season.</p>",
               "pubDate": "Wed, 19 Oct 2022 08:55:47 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269085/Russell-Westbrook-Absolutely-Believes-Coming-Off-Bench-Contributed-To-Hamstring-Injury",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Westbrook_Russell_lal_211022.jpg"
               }
            },
            {
               "title": "Jaren Jackson Jr. To 'Hopefully' Return To 5-On-5 Work In Couple Weeks",
               "link": "https://basketball.realgm.com/wiretap/269082/Jaren-Jackson-Jr-To-Hopefully-Return-To-5-On-5-Work-In-Couple-Weeks",
               "description": "<p>Jaren Jackson Jr. will \"hopefully\" start 5-on-5 work in the next couple of weeks, according to Taylor Jenkins.</p>\n<p>Jackson underwent <a href=\"https://basketball.realgm.com/wiretap/267667/Jaren-Jackson-Jr-Out-4-6-Months-After-Surgery-To-Repair-Broken-Foot\">surgery on his right foot</a> in late June. </p>\n<p>Jackson averaged 16.3 points and 5.8 rebounds in 78 games last season. </p>",
               "pubDate": "Wed, 19 Oct 2022 01:19:49 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269082/Jaren-Jackson-Jr-To-Hopefully-Return-To-5-On-5-Work-In-Couple-Weeks",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Jackson_Jaren_mem_181107.jpg"
               }
            },
            {
               "title": "Warriors Won't Consider Trading Draymond Green This Season",
               "link": "https://basketball.realgm.com/wiretap/269094/Warriors-Wont-Consider-Trading-Draymond-Green-This-Season",
               "description": "<p>The Golden State Warriors are unlikely to trade Draymond Green this season even though they appear to be more upset about his punch of Jordan Poole than their comments and lack of real punishment indicate. </p>\n<p>\"From what I've heard talking to people, this iciness that you see in the media comments from Poole, saying, 'You know, we're professionals. I'll leave it at that.'</p>\n<p>\"From Steve Kerr calling it the biggest crisis they've faced.</p>\n<p>\"From Kevon Looney saying, 'Draymond is going to have to earn our trust.'</p>\n<p>\"If anything, I think that may be underplaying the level of iciness and tension that they're navigating right now. And that's not to say 'Are they going to trade Draymond?' Everything I've heard is they are not trading Draymond. They're just not going to happen. They're trying to win the championship and will try to ride it out unless something drastic happens. Draymond is going to be on the team all season.\"</p>",
               "pubDate": "Wed, 19 Oct 2022 12:24:05 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269094/Warriors-Wont-Consider-Trading-Draymond-Green-This-Season",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Green_Draymond_gsw_220607.jpg"
               }
            },
            {
               "title": "Tyrese Haliburton: Being The Full-Time Point Guard Is Everything I Ever Wanted",
               "link": "https://basketball.realgm.com/wiretap/269090/Tyrese-Haliburton-Being-The-Full-Time-Point-Guard-Is-Everything-I-Ever-Wanted",
               "description": "<p>Tyrese Haliburton was initially surprised by his trade from the Sacramento Kings to the Indiana Pacers, but he seems to be embracing his status as the franchise's foundational piece.</p>\n<p>\"Sacramento was great,\" Haliburton told Zach Lowe of ESPN. \"I wasn't ready to be a full-time point guard when I got there. Playing with [De'Aaron] Fox helped. But now, this is everything I ever wanted. I get to be the full-time guy. I love this.\"</p>\n<p>\"In the modern game, where guys love to hold the ball, he's an outlier,\" says Rick Carlisle, Indiana's coach.</p>\n<p>But the Pacers also need Haliburton to score.</p>\n<p>\"This whole summer has been about challenging my mind and become more of an a--hole in a sense, offensively,\" Haliburton said.</p>",
               "pubDate": "Wed, 19 Oct 2022 11:12:49 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269090/Tyrese-Haliburton-Being-The-Full-Time-Point-Guard-Is-Everything-I-Ever-Wanted",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Haliburton_Tyrese_ind_220215.jpg"
               }
            },
            {
               "title": "Kyrie Irving Admits He Shouldn't Have Asked For Trade From Cavs In 2017",
               "link": "https://basketball.realgm.com/wiretap/269089/Kyrie-Irving-Admits-He-Shouldnt-Have-Asked-For-Trade-From-Cavs-In-2017",
               "description": "<p>During an exclusive sit down interview with Shams Charania before the start of the season, Kyrie Irving reflected on his trade request from the Cleveland Cavaliers in 2017. Irving requested a trade and ultimately was dealt to the Boston Celtics.</p>\n<p>\"When I asked for a trade from Cleveland, the one thing that I look back on is: Did I exhaust as many opportunities to get closer to guys when I felt some type of difference? There was a lot of things that happened in the business that I didn't understand,\" he said. \"Asking for a trade - I don't think it was my time to ask for a trade. And especially to go to Boston, who was No. 2 or No. 1 in our conference, it's just right down the street. I'm grateful that I had my time there because it was one of the most historical franchises that again, I did not know the power of our industry.</p>\n<p>\"When I reflect on it, at 30 years old I can say I understand the business better, I understand the way that roles work, and if anybody can sit here honestly and say they messed up, it was me. Because if I'm saying that it is family-run and relationship-run, then while I was in these situations I didn't handle all of those relationships as I would have wanted.\"</p>",
               "pubDate": "Wed, 19 Oct 2022 10:11:58 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269089/Kyrie-Irving-Admits-He-Shouldnt-Have-Asked-For-Trade-From-Cavs-In-2017",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Irving_Kyrie_bkn_220630.jpg"
               }
            },
            {
               "title": "Kyrie Irving: Nets Got Better After Trade Request By Kevin Durant",
               "link": "https://basketball.realgm.com/wiretap/269095/Kyrie-Irving-Nets-Got-Better-After-Trade-Request-By-Kevin-Durant",
               "description": "<p>Kyrie Irving believes the trade request from Kevin Durant made the Brooklyn Nets better in the end.</p>\n<p>\"When Kev made that request, I feel like we got better,\" Irving told Shams Charania during a sit-down interview. \"Afterwards. Not initially, but now where we are now, I feel like we can honestly say we got better, with the principles that are needed for success. Without going through some test in the summertime or during the season, we wouldn't be able to be as close and bonded as we are now.\"</p>\n<p>The Nets were on the precipice of losing both Irving and Durant this past offseason, but both remain on their roster. Irving could have opted out while Durant perhaps could have continued his machinations to seek a trade.</p>",
               "pubDate": "Wed, 19 Oct 2022 12:51:33 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269095/Kyrie-Irving-Nets-Got-Better-After-Trade-Request-By-Kevin-Durant",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Irving_Kyrie_bkn_220603.jpg"
               }
            },
            {
               "title": "Lakers Passed On Utah's Offer Of Bogdanovic, Conley, Gay, 2023 FRP For Westbrook, FRPs In 2027, 2029",
               "link": "https://basketball.realgm.com/wiretap/269097/Lakers-Passed-On-Utahs-Offer-Of-Bogdanovic-Conley-Gay-2023-FRP-For-Westbrook-FRPs-In-2027-2029",
               "description": "<p>The Los Angeles Lakers had the opportunity this offseason to acquire Bojan Bogdanovic, Mike Conley, Rudy Gay and a 2023 first round pick from the Utah Jazz in exchange for Russell Westbrook and their first round picks in 2027 and 2029, according to Tony Jones of The Athletic.</p>\n<p>Jones doesn't specify which 2023 first round pick the Jazz would have traded to the Lakers, but it presumably would have <a href=\"https://basketball.realgm.com/nba/draft/future_drafts/team\">presumably been</a> either the one from the Minnesota Timberwolves, or the least favorable selection from the Brooklyn Nets, Houston Rockets and Philadelphia 76ers.</p>\n<p>The Jazz eventually traded Bogdanovic to the Detroit Pistons. </p>\n<p>The Lakers also have had the opportunity to acquire Myles Turner and Buddy Hield for the pair of future first round picks attached to Westbrook. </p>",
               "pubDate": "Wed, 19 Oct 2022 14:52:26 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269097/Lakers-Passed-On-Utahs-Offer-Of-Bogdanovic-Conley-Gay-2023-FRP-For-Westbrook-FRPs-In-2027-2029",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Conley_Mike_uta_191018.jpg"
               }
            },
            {
               "title": "Blazers Hire BJ Domingo As Director Of Player Personnel",
               "link": "https://basketball.realgm.com/wiretap/269092/Blazers-Hire-BJ-Domingo-As-Director-Of-Player-Personnel",
               "description": "<p>The Portland Trail Blazers have hired BJ Domingo as Director of Player Personnel. </p>\n<p>Domingo hand been assistant director of the men's national team at USA Basketball.</p>\n<p>Domingo began his career as a scout with the Milwaukee Bucks.</p>",
               "pubDate": "Wed, 19 Oct 2022 11:50:45 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269092/Blazers-Hire-BJ-Domingo-As-Director-Of-Player-Personnel",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/nba_portlandtrailblazers.jpg"
               }
            },
            {
               "title": "DraftKings Ohio Promo Code PreReg Offer Earns $200 In Free Bets For Buckeyes",
               "link": "https://basketball.realgm.com/wiretap/269087/DraftKings-Ohio-Promo-Code-PreReg-Offer-Earns-$200-In-Free-Bets-For-Buckeyes",
               "description": "<p>Bettors in Ohio will need to wait a few more weeks until online sports betting launches in the state, but the <strong>DraftKings Ohio promo code</strong> offer is letting them earn $200 in free bets and gain an entry into a $100,000 free-bet sweepstakes right now.</p>\n<div class=\"gdcg-oplist\" data-gdcg_rankid=\"1178\" data-gdcg_country=\"us\" data-gdcg_region=\"oh\"> </div>\n<p>All RealGM readers in Ohio can pre-register using the <strong>DraftKings Ohio promo code</strong> offer and earn the easiest $200 in free bets they'll find at any of the online sportsbooks in the state.</p>\n<p>The Jan. 1 launch date will be here before bettors know it, and the <a href=\"https://basketball.realgm.com/betting/sportsbooks/ohio/promo-codes\" target=\"_blank\" rel=\"noopener\">Ohio promo codes</a> will be coming in hot as operators look to earn business. But there's no wait with the <strong>DraftKings Ohio promo code</strong> offer, and we're letting you in on everything you need to know to earn it today.</p>\n<h2>Pre-register With DraftKings Ohio Promo Code Offer</h2>\n<table>\n<tbody>\n<tr>\n<td>DraftKings Ohio Promo Code</td>\n<td>Automatically applied</td>\n</tr>\n<tr>\n<td>DraftKings Ohio Pre-registeration Promotion</td>\n<td>Get $200 In Free Bets, Be Entered For $100K Bet Sweepstakes</td>\n</tr>\n<tr>\n<td>Terms & Conditions</td>\n<td>New customers, 21 and over, in Ohio. Free wagers will come in the form of eight $25 bets</td>\n</tr>\n</tbody>\n</table>\n<p> </p>\n<div class=\"gdcg-oplist\" data-gdcg_rankid=\"1178\" data-gdcg_country=\"us\" data-gdcg_region=\"oh\"> </div>\n<p>It's not easy winning on <a href=\"https://basketball.realgm.com/wiretap/266131/Best-Sports-Betting-Apps-2022-Legal-Online-Sportsbook-Apps\" target=\"_blank\" rel=\"noopener\">sports betting apps</a> and websites. It's why bettors should always be on the lookout for the best and brightest welcome bonus offers to new players that enhance potential payouts or deliver free bets directly into your pocket. The latter is what the DraftKings Ohio promo code offer entails-in addition to entering players into a $100,000 Free Bet Sweepstakes that will have five winners.</p>\n<p>Like all pre-registration sportsbook promo codes, sports bettors will need an account to earn the offer. Luckily, that takes two short steps with the DraftKings Ohio. Follow these directions and the free bets and free entry are yours:</p>\n<ul>\n<li>Use the links provided in this article to begin your registration for a new account; there's no physical code to type in, so simply clicking will unlock the full benefits of the DraftKings Ohio promo code offer</li>\n<li>Make your new account by providing DraftKings Ohio with all the relevant personal information they'll need to verify your identity; you'll also need to prove you are 21+ years old and physically located in Ohio to earn this bonus</li>\n</ul>\n<p>Two steps and you're done. You'll need to wait until Jan. 1 when DraftKings Ohio, is scheduled to launch, to actually use the free bets, but rest assured they will be waiting in your account when the time comes. You'll also receive a single free entry into the DraftKings Ohio $100,000 Free Bet Sweepstakes. Five lucky pre-registrants will earn a life-changing $100,000 free bet to be used at DraftKings Ohio - all because they signed up for a new account.</p>\n<p>There's also a chance that players will be able to take advantage of DraftKings' flagship offer once Jan. 1 rolls around. That regular welcome bonus changes periodically, so check back closer to the launch date to see what's available to those who pre-registered.</p>\n<div class=\"gdcg-oplist\" data-gdcg_rankid=\"1178\" data-gdcg_country=\"us\" data-gdcg_region=\"oh\"> </div>\n<h2>Redeem Free Bets With DraftKings Ohio Promo Code</h2>\n<p>Once New Year's Day rolls around, you'll have access to your eight $25 free bets with <strong>DraftKings Ohio promo code</strong> offer. It's nice that they spread your freebies out instead of requiring one lump sum of a $200 free bet on a single game. Bettors can test out different bet types and different sports this way.</p>\n<p>RealGM readers will have seven days to use their eight free bets, but that shouldn't be a problem with college football, NFL, NBA, NHL, and more all in full swing. There are thousands of different odds to choose from at DraftKings Ohio each day.</p>\n<p>Bettors also love that the free bets from the <strong>DraftKings Ohio promo code</strong> offer carry a one-time playthrough requirement with them. That means any winnings from those bets become instant cash in your bankroll that can be bet again or withdrawn.</p>\n<div class=\"gdcg-oplist\" data-gdcg_rankid=\"1178\" data-gdcg_country=\"us\" data-gdcg_region=\"oh\"> </div>\n<h2>Other Great Features At DraftKings Ohio</h2>\n<p>Your pre-registration bonus of $200 in free bets and entry into the massive sweepstakes is good, but DraftKings Ohio wants to be great. It's why they offer daily promotions, offers, perks, and bonuses to all players.</p>\n<p>Once Jan. 1 rolls around, you'll have unlimited access to everything that the sports betting app and website have to offer. Whether it's boosted odds on nationally televised events or free-to-play contests that pay out real cash to bettors, there's always something to grab when they log in and start betting.</p>\n<p>This offer won't be here forever, so take advantage of this offer. Use the <strong>DraftKings Ohio promo code</strong> offer and start earning today while you patiently wait for things to get going when the calendar flips to 2023.</p>\n<div class=\"gdcg-oplist\" data-gdcg_rankid=\"5\" data-gdcg_country=\"us\" data-gdcg_region=\"oh\"> </div>",
               "pubDate": "Wed, 19 Oct 2022 09:36:51 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269087/DraftKings-Ohio-Promo-Code-PreReg-Offer-Earns-$200-In-Free-Bets-For-Buckeyes",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/gdc-draftkings-new-hero.jpg"
               }
            },
            {
               "title": "Victor Oladipo Out Against Bulls With Left Knee Tendonosis",
               "link": "https://basketball.realgm.com/wiretap/269084/Victor-Oladipo-Out-Against-Bulls-With-Left-Knee-Tendonosis",
               "description": "<p>Victor Oladipo will miss the Miami Heat's regular-season opener against the Chicago Bulls on Wednesday due to left knee tendonosis.</p>\n<p>Erik Spoelstra said that Oladipo would be day-to-day.</p>\n<p class=\"default__StyledText-sc-1wxyvyl-0 japGnm body-paragraph\">\"This is part of the process, when a player like Vic ramps it up, and then you add the workload and everything,\" Erik Spoelstra said. \"I think this is normal. And we want to proceed with care. And that's all this is right now.</p>\n<p class=\"default__StyledText-sc-1wxyvyl-0 japGnm body-paragraph\">\"He's day-to-day, and we want to make sure we take care of this, so it doesn't linger.\"</p>\n<p class=\"default__StyledText-sc-1wxyvyl-0 japGnm body-paragraph\">Oladipo has appeared in just 12 regular-season games for the Heat over the past two seasons. </p>",
               "pubDate": "Wed, 19 Oct 2022 01:35:38 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269084/Victor-Oladipo-Out-Against-Bulls-With-Left-Knee-Tendonosis",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Oladipo_Victor_mia_210505.jpg"
               }
            },
            {
               "title": "Vanderbilt Extends Jerry Stackhouse Contract",
               "link": "https://basketball.realgm.com/wiretap/269083/Vanderbilt-Extends-Jerry-Stackhouse-Contract",
               "description": "<p>Vanderbilt extended men's basketball coach Jerry Stackhouse's contract on Tuesday.</p>\n<p>Stackhouse is entering his fourth season as head coach. Terms of the extension were not announced.</p>\n<p>\"Committing to and investing in him as the leader is an important part of building the championship caliber program that we all want and expect here at Vanderbilt. I value the contributions Jerry and his program have made to our community and campus, and I am excited about our future,\" said athletic director Candice Lee.</p>\n<p>Stackhouse has coached three Vanderbilt players to the NBA, including Aaron Nesmith, Saben Lee, and Scotty Pippen Jr.</p>",
               "pubDate": "Wed, 19 Oct 2022 01:23:47 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269083/Vanderbilt-Extends-Jerry-Stackhouse-Contract",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Stackhouse_Jerry_nba_180611.jpg"
               }
            },
            {
               "title": "Zach LaVine Questionable For Season Opener Due To Left Knee Injury Management",
               "link": "https://basketball.realgm.com/wiretap/269081/Zach-LaVine-Questionable-For-Season-Opener-Due-To-Left-Knee-Injury-Management",
               "description": "<p>Zach LaVine is listed as questionable for the Chicago Bulls' regular-season opener against the Miami Heat due to left knee injury management.</p>\n<p>LaVine, who signed a <a href=\"https://basketball.realgm.com/wiretap/267740/Zach-LaVine-Bulls-Agree-To-Five-Year-$215M-Extension\">five-year, $215 million extension this offseason</a>, underwent knee surgery in May. </p>\n<p>Alex Caruso is also listed as probable due to a left calf contusion. </p>",
               "pubDate": "Wed, 19 Oct 2022 01:13:56 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269081/Zach-LaVine-Questionable-For-Season-Opener-Due-To-Left-Knee-Injury-Management",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/LaVine_Zach_chi_220513.jpg"
               }
            },
            {
               "title": "Shai Gilgeous-Alexander To Play Opening Night",
               "link": "https://basketball.realgm.com/wiretap/269080/Shai-Gilgeous-Alexander-To-Play-Opening-Night",
               "description": "<p>Shai Gilgeous-Alexander is set to play opening night, confirmed Mark Daigneault.</p>\n<p>Gilgeous-Alexander <a href=\"https://basketball.realgm.com/wiretap/269040/Shai-GilgeousAlexander-On-Track-To-Play-Opening-Night\">suffered an MCL sprain in late September</a>.</p>\n<p>The Thunder start the season against the Timberwolves.  </p>",
               "pubDate": "Wed, 19 Oct 2022 01:03:08 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269080/Shai-Gilgeous-Alexander-To-Play-Opening-Night",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Gilgeousalexander_Shai_okc_191019.jpg"
               }
            },
            {
               "title": "Keegan Murray Ruled Out Of Season Opener Due To COVID-19 Protocols",
               "link": "https://basketball.realgm.com/wiretap/269079/Keegan-Murray-Ruled-Out-Of-Season-Opener-Due-To-COVID-19-Protocols",
               "description": "<p>Keegan Murray will miss the Sacramento Kings' regular season opener against the Portland Trail Blazers as he remains in COVID-19 protocols. </p>\n<p>Murray <a href=\"https://basketball.realgm.com/wiretap/269045/Keegan-Murray-Status-Uncertain-For-Opener-After-Entering-COVID19-Protocols\">entered health and safety protocols</a> last Friday night. </p>\n<p>Kevin Huerter is questionable for the game due to ankle soreness, though he did practice on Tuesday. </p>",
               "pubDate": "Wed, 19 Oct 2022 00:57:39 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269079/Keegan-Murray-Ruled-Out-Of-Season-Opener-Due-To-COVID-19-Protocols",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Murray_Keegan_ia_220331.jpg"
               }
            },
            {
               "title": "Stephen Curry: End Of Our Run Should Only Come When We're No Longer Title Contenders",
               "link": "https://basketball.realgm.com/wiretap/269078/Stephen-Curry-End-Of-Our-Run-Should-Only-Come-When-Were-No-Longer-Title-Contenders",
               "description": "<p>Some in the media have suggested this could be a 'Last Dance' season for the Golden State Warriors due to the uncertain future of Draymond Green both in response to his fight with Jordan Poole but also his contract status. The Warriors already have an exorbitant salary plus luxury tax bill that will climb even further next season if Green remains.</p>\n<p>Stephen Curry was asked in an exclusive interview with Shayna Rubin to comment on the possibility of this season being the last season with a core of himself, Green and Klay Thompson.</p>\n<p>\"Whenever someone has success, the imagination wanders to when the end is and what is going to be the reason that it unfolds,\" said Curry.</p>\n<p>\"I heard it back in 2019. I heard during the pandemic. We hear it a little louder now because we won again. We would have heard it louder had we not won. Nobody has any idea what's going to happen.</p>\n<p>\"Nobody last year could have guessed that JP (Jordan Poole) and Wiggs (Andrew Wiggins) would be in the situation they are in now. Potentially being coveted free agents that we locked into extensions. Not a lot of people put money on that.</p>\n<p>\"The conversations are part of what we do. For Draymond, Klay, me, we've been through it and we're used to it. We hope that the end is when we don't win. That should be the end, when there's a sense that we're not a championship contending team. We know it's not guaranteed to win a championship. When we know we're a team that can legitimately win championships then you make certain decisions. We haven't been in that situation.\"</p>",
               "pubDate": "Tue, 18 Oct 2022 23:01:47 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269078/Stephen-Curry-End-Of-Our-Run-Should-Only-Come-When-Were-No-Longer-Title-Contenders",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Curry_Stephen_gsw_220523.jpg"
               }
            },
            {
               "title": "Thomas Bryant Undergoes Surgery On Left Thumb",
               "link": "https://basketball.realgm.com/wiretap/269077/Thomas-Bryant-Undergoes-Surgery-On-Left-Thumb",
               "description": "<p style=\"font-weight: 400;\">Thomas Bryant underwent successful surgery on Tuesday to repair the ulnar collateral ligament on his left thumb.</p>\n<p style=\"font-weight: 400;\">Bryant will be reevaluated by team doctors in approximately three weeks, and further updates will be provided at that time.</p>\n<p style=\"font-weight: 400;\">Bryant signed with the Los Angeles Lakers this past offseason.</p>",
               "pubDate": "Tue, 18 Oct 2022 22:02:40 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269077/Thomas-Bryant-Undergoes-Surgery-On-Left-Thumb",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/nba_losangeleslakers.jpg"
               }
            },
            {
               "title": "Robert Williams III Underwent PRP Procedure On Monday",
               "link": "https://basketball.realgm.com/wiretap/269076/Robert-Williams-III-Underwent-PRP-Procedure-On-Monday",
               "description": "<p>Robert Williams III underwent a PRP procedure in his knee on Monday to help with the healing process.</p>\n<p>Williams hopes to return in December or January, but he could return well into the second half of the season.</p>\n<p>Williams also underwent surgery in September.</p>",
               "pubDate": "Tue, 18 Oct 2022 10:25:55 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269076/Robert-Williams-III-Underwent-PRP-Procedure-On-Monday",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Williams_Robert_bos_190208.jpg"
               }
            },
            {
               "title": "Justin Zanik Signs Multi-Year Extension With Jazz",
               "link": "https://basketball.realgm.com/wiretap/269075/Justin-Zanik-Signs-Multi-Year-Extension-With-Jazz",
               "description": "<p>The Utah Jazz have signed General Manager Justin Zanik to a multi-year contract extension.</p>\n<p>\"My family and I have fallen in love with this great city and the state of Utah, and I am extremely grateful for the opportunity to continue this journey with the Utah Jazz,\" said Zanik. \"I have a deep appreciation for my partnership with Ryan and Danny and am excited about our path forward with Coach Hardy. We look forward to building towards winning the championship our fans deserve.\"</p>\n<p>\"Justin's basketball acumen, ability to create meaningful relationships throughout the league, and management of our front office are invaluable assets,\" said Jazz CEO of Basketball Danny Ainge. \"We're thrilled that he'll continue to lead the team.\"</p>\n<p>Zanik is entering his fourth season as general manager of the Utah Jazz, overseeing the day-to-day management of basketball operations. Zanik originally joined the Jazz as assistant general manager in September 2013 and held the role for three seasons, before moving to take on the role of assistant general manager for the Milwaukee Bucks in 2016-17. He returned to Utah in the same role from 2017-19.</p>",
               "pubDate": "Tue, 18 Oct 2022 10:16:26 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269075/Justin-Zanik-Signs-Multi-Year-Extension-With-Jazz",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Zanik_Justin_uta_221018.jpg"
               }
            },
            {
               "title": "Klay Thompson, Warriors Didn't Talk Extension Before Deadline",
               "link": "https://basketball.realgm.com/wiretap/269074/Klay-Thompson-Warriors-Didnt-Talk-Extension-Before-Deadline",
               "description": "<p>Klay Thompson and the Golden State Warriors had a Monday deadline to reach agreement on a contract extension. According to Thompson, he and the team never even broached the topic of an extension.</p>\n<p>When asked about a potential extension, Thompson said, \"I have not talked to the front office about it.\"</p>\n<p>Asked about how he expects things to play out with the Warriors, Thompson said he's focused on his game and playing to the best of his ability.</p>\n<p>\"I'm just going to do what I got to do to be the best I can be every day. I'm going to be a great player. I know what I'm capable of. I fully expect to earn another NBA contract, whether it's this summer or next summer.,\" Thompson said. \"I'm fully confident in my abilities. I'm not worried about an extension in the meantime because I know it'll happen if I just do my job and I just be myself.\"</p>\n<p>Because Thompson has two seasons left on his deal, he and Golden State had to reach an agreement on an extension by the end of the day on Monday. Extension-eligible players who are on expiring contracts can sign veteran extensions through the last day of the league year on June 30.</p>",
               "pubDate": "Tue, 18 Oct 2022 09:28:52 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269074/Klay-Thompson-Warriors-Didnt-Talk-Extension-Before-Deadline",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Thompson_Klay_gsw_220529.jpg"
               }
            },
            {
               "title": "Nets Exercise 23-24 Options For Day'Ron Sharpe, Cam Thomas",
               "link": "https://basketball.realgm.com/wiretap/269073/Nets-Exercise-23-24-Options-For-DayRon-Sharpe-Cam-Thomas",
               "description": "<p>The Brooklyn Nets exercised 2023-24 rookie scale team options for Day'Ron Sharpe and Cam Thomas. These were third-year options for both players.</p>\n<p>Sharpe appeared in 32 games (eight starts) as a rookie last season. He averaged 6.2 points and 5.0 rebounds in 12.2 minutes per game. This season, Sharpe may see a bigger role, as Brooklyn is in need of center depth behind Nicolas Claxton.</p>\n<p>Thomas saw action in 67 games (two starts) as a rookie. He averaged 8.5 points on 43% shooting from the field. Thomas is expected to see increased minutes early in the season as both Seth Curry and Joe Harris continue to recover from ankle surgeries.</p>",
               "pubDate": "Tue, 18 Oct 2022 09:22:44 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269073/Nets-Exercise-23-24-Options-For-DayRon-Sharpe-Cam-Thomas",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Thomas_Cam_bkn_211108.jpg"
               }
            },
            {
               "title": "Caesars Sportsbook Promo Code REALGMFULL Earns You $1250 First-Bet Insurance",
               "link": "https://basketball.realgm.com/wiretap/269072/Caesars-Sportsbook-Promo-Code-REALGMFULL-Earns-You-$1250-First-Bet-Insurance",
               "description": "<p>The MLB playoffs have shown that anything can happen once you make it into the big dance. Two wild-card teams, the Padres and Phillies, are meeting in the NLCS, which shows how valuable a solid underdog pick can be. Meanwhile in the NFL, the Bills exacted some revenge on the Chiefs in a battle of Super Bowl contenders. Whether you like going with underdogs or favorites, you can get in on the action, and if you sign up with the <strong><a href=\"https://basketball.realgm.com/betting/sportsbooks/caesars\" target=\"_blank\" rel=\"noopener\">Caesars Sportsbook promo code</a></strong><strong> REALGMFULL</strong> you can redeem the first-bet insurance up to $1,250.</p>\n<div class=\"gdcg-oplist\" data-gdcg_rankid=\"1177\"> </div>\n<p>The signup offer provides an all-important safety net on opening wagers for new customers. Should your qualifying wager lose, the online sportsbook refunds the stake up to $1,250. In addition, you're guaranteed 1,000 Reward Credits and 1,000 Tier Credits once your account is confirmed. The multi-layered incentives provide a competitive advantage over other <a href=\"https://basketball.realgm.com/wiretap/266131/Best-Sports-Betting-Apps-2022-Legal-Online-Sportsbook-Apps\" target=\"_blank\" rel=\"noopener\">top sportsbook apps</a>. </p>\n<p>Redeeming the offer couldn't be easier. Sign up for Caesars Sportsbook, enter <strong>Caesars Sportsbook promo code REALGMFULL</strong>, deposit at least $10 and commit to your qualifying wager. If your initial bet loses, you'll earn the redemption within 72 hours as a single free-bet token. </p>\n<h2>Caesars Sportsbook Promo Code: One Of The Best </h2>\n<table>\n<tbody>\n<tr>\n<td>Caesars Sportsbook Promo Code</td>\n<td>REALGMFULL</td>\n</tr>\n<tr>\n<td>Caesars Sportsbook Promotion</td>\n<td>First-bet insurance up to $1250, plus 1,000 Tier Credits and 1,000 Reward Credits</td>\n</tr>\n<tr>\n<td>Terms & Conditions</td>\n<td>New customers 21 and over in AZ, CO, IL, IA, KS, LA, MI, NV, NJ, NY, PA, TN, VA, WV</td>\n</tr>\n</tbody>\n</table>\n<p> </p>\n<div class=\"gdcg-oplist\" data-gdcg_rankid=\"1177\"> </div>\n<p>Deciding which online sportsbook to join is an important decision, one heavily shaped by what the welcome offer provides. When you submit <strong>Caesars Sportsbook promo code REALGMFULL</strong>, you open the door to an array of appealing benefits, several of which accompany the first-bet insurance, up to $1,250 welcome offer.  </p>\n<p>If you want to redeem the $1,250 maximum, stake that same amount on the initial wager. If that qualifying bet is unsuccessful, you'll receive the $1,250 as a single free-bet token within 72 hours. No matter the amount you stake, the site credit must be invested on a follow-up bet within two weeks. But you'll also receive 1,000 Reward Credits and 1,000 Tier Credits regardless of whether your opening bet wins or loses. You can redeem the credits countless ways, including cashing them in toward free bets. </p>\n<p>Few online sportsbooks dole out loyalty program credits as part of the welcome offer, setting Caesars Sportsbook apart from most competitors. To make the most of the signup offer, you might choose a solid underdog pick as your qualifying wager. You'll earn a markedly higher profit if the underdog pick wins. And the online sportsbook covers the stake up to $1,250 if it loses, making it a win-win situation. </p>\n<div class=\"gdcg-oplist\" data-gdcg_rankid=\"1177\"> </div>\n<h2>Caesars Sportsbook Promo Code: Make Most Of Bonuses </h2>\n<p>The incentives don't stop after redeeming the welcome offer. In fact, akin to other elite betting sites, Caesars Sportsbook consistently offers weekly features and additional ongoing bonuses. To redeem, you must have a Caesars Sportsbook account. Click the link on this page, join the online sportsbook and apply <strong>Caesars Sportsbook promo code REALGMFULL</strong> and take advantage of the weekly offers, which include profit boosts, odds boosts, parlay, prop and other bonuses. </p>\n<p>With the NBA season tipping off, Caesars Sportsbook focuses on different basketball bonuses. You can also take advantage of profit boosts and odds boosts. Profit boosts are provided for all the most popular sports, including MLB, NBA, NHL and the NFL. Profit boosts are added to winning bets as a percentage of the overall payout, while odds boosts increase the profits on winning bets by lengthening odds on pre-selected games. </p>\n<p>Sign in to your account and head to the Promotions tab to see the available offers. The ongoing offers don't require <strong>Caesars Sportsbook promo code REALGMFULL</strong>, but you must opt-in. </p>\n<div class=\"gdcg-oplist\" data-gdcg_rankid=\"5\"> </div>",
               "pubDate": "Tue, 18 Oct 2022 09:13:06 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269072/Caesars-Sportsbook-Promo-Code-REALGMFULL-Earns-You-$1250-First-Bet-Insurance",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/gdc-caesars-new-hero.jpg"
               }
            },
            {
               "title": "Andre Iguodala Inactive To Start Season, Patrick Baldwin Jr. Questionable With Thumb Sprain",
               "link": "https://basketball.realgm.com/wiretap/269071/Andre-Iguodala-Inactive-To-Start-Season-Patrick-Baldwin-Jr-Questionable-With-Thumb-Sprain",
               "description": "<p>Andre Iguodala will be inactive to the start the Golden State Warriors' season.</p>\n<p>Iguodala, who signed a one-year deal to return to the Warriors, will retire after this year.</p>\n<p>The Warriors open the regular season against the Lakers on Tuesday. </p>\n<p>Patrick Baldwin Jr. is also listed as questionable with a sprained right thumb for the opener. </p>",
               "pubDate": "Tue, 18 Oct 2022 01:56:17 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269071/Andre-Iguodala-Inactive-To-Start-Season-Patrick-Baldwin-Jr-Questionable-With-Thumb-Sprain",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Iguodala_Andre_gsw_190522.jpg"
               }
            },
            {
               "title": "Paolo Banchero Signs Endorsement Deal With Jordan Brand",
               "link": "https://basketball.realgm.com/wiretap/269070/Paolo-Banchero-Signs-Endorsement-Deal-With-Jordan-Brand",
               "description": "<p>Paolo Banchero signed a multi-year endorsement deal with Jordan Brand. </p>\n<p>\"The marketing and the product, and just how exclusive they are. Jordan, to me, is real sharp and stylish at the same time. I feel like that fit me real well,\" said Banchero on what lead him to choose Jordan Brand.</p>\n<p>Banchero also drew interest from Adidas and Puma.</p>\n<p>The deal was negotiated by Mike Miller's LIFT Sports Management.</p>\n<p>Banchero will wear several Jordan models this season, including the Luka 1, Zion 2, and the mid and low-top cuts of the Air Jordan 37.</p>",
               "pubDate": "Tue, 18 Oct 2022 01:52:00 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269070/Paolo-Banchero-Signs-Endorsement-Deal-With-Jordan-Brand",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Banchero_Paolo_orl_221013.jpg"
               }
            },
            {
               "title": "James Bouknight Charged With DWI",
               "link": "https://basketball.realgm.com/wiretap/269069/James-Bouknight-Charged-With-DWI",
               "description": "<p>James Bouknight was arrested on Sunday morning and charged with driving while impaired in Charlotte.</p>\n<p>Bouknight's bond was set at $2500.</p>\n<p>The 22-year-old practiced on Monday but did not speak to reporters.</p>\n<p>\"We are just gathering information right now. Until we know more definitely on what happened I can't comment on that,\" said Steve Clifford after Monday's practice.</p>\n<p>Bouknight averaged 4.6 points in 31 games last season as a rookie. </p>",
               "pubDate": "Tue, 18 Oct 2022 01:42:23 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269069/James-Bouknight-Charged-With-DWI",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Bouknight_James_cha_211108.jpg"
               }
            },
            {
               "title": "Spurs Waive Joe Wieskamp",
               "link": "https://basketball.realgm.com/wiretap/269068/Spurs-Waive-Joe-Wieskamp",
               "description": "<p>The San Antonio Spurs waived Joe Wieskamp on Monday, cutting their roster down to 15 players ahead of the regular season.</p>\n<p>Wieskamp appeared in 29 games for the Spurs last season. </p>",
               "pubDate": "Tue, 18 Oct 2022 01:38:53 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269068/Spurs-Waive-Joe-Wieskamp",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/nba_sanantoniospurs.jpg"
               }
            },
            {
               "title": "Get Your Latest NBA News From RealGM's Basketball Wiretap",
               "link": "https://basketball.realgm.com/news",
               "description": "Get all the latest news and happenings from around the NBA with RealGM's Basketball Wiretap.",
               "pubDate": "Wed, 19 Oct 2022 18:17:01 EDT",
               "guid": "https://basketball.realgm.com/news"
            }
         ]
      },
      "_xmlns:media": "http://search.yahoo.com/mrss/",
      "_version": "2.0"
   }
}