{
   "rss": {
      "channel": {
         "title": "RealGM Basketball Wiretap",
         "link": "https://basketball.realgm.com/news",
         "description": "Basketball News, Rumors, Scores, Stats, Analysis, Depth Charts, Forums",
         "language": "en-us",
         "pubDate": "Tue, 01 Nov 2022 11:17:01 EDT",
         "lastBuildDate": "Tue, 01 Nov 2022 11:17:01 EDT",
         "item": [
            {
               "title": "Jimmy Butler: We're Still Going To Win The Championship",
               "link": "https://basketball.realgm.com/wiretap/269225/Jimmy-Butler-Were-Still-Going-To-Win-The-Championship",
               "description": "<p>The Miami Heat are off to a disappointing 2-5 start. But Miami star Jimmy Butler hasn't had his confidence shaken at all by the poor start.</p>\n<p>\"We're still going to win the championship, and I don't care what nobody says,\" Butler said. \"Count us out. We're going to win the f***ing championship. I'm telling you. I don't give a damn that we started 2-5.\"</p>\n<p>Butler was just one member of the Heat to remind the media that it's still early in the season. Miami coach Erik Spoelstra said his team is \"not in a panic about\" but did criticize his players for trying to do too much as individuals. Spoelstra stressed that the Heat have to stay together as a team, which was something Butler, Kyle Lowry, Bam Adebayo and Tyler Herro all echoed, as well.</p>",
               "pubDate": "Tue, 01 Nov 2022 09:02:24 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269225/Jimmy-Butler-Were-Still-Going-To-Win-The-Championship",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Butler_Jimmy_mia_220517.jpg"
               }
            },
            {
               "title": "Joshua Primo Goes Unclaimed On Waivers",
               "link": "https://basketball.realgm.com/wiretap/269218/Joshua-Primo-Goes-Unclaimed-On-Waivers",
               "description": "<p>Josh Primo has gone unclaimed on waivers and will become a free agent.</p>\n<p>The San Antonio Spurs waived Primo after a former employee of the team alleged he indecently exposed himself to her.</p>\n<p>The Spurs recently had picked up their 23-24 option on Primo and he is owed $8.4 million over this season and next.</p>",
               "pubDate": "Mon, 31 Oct 2022 17:04:23 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269218/Joshua-Primo-Goes-Unclaimed-On-Waivers",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Primo_Josh_sas_210120.jpg"
               }
            },
            {
               "title": "Blake Wesley To Miss 6-8 Weeks With Torn MCL",
               "link": "https://basketball.realgm.com/wiretap/269223/Blake-Wesley-To-Miss-6-8-Weeks-With-Torn-MCL",
               "description": "<p>Blake Wesley was just starting to get playing time in his rookie season for the San Antonio Spurs. Now, Wesley's season will be paused for 6-8 weeks due to a torn left MCL he suffered on Sunday.</p>\n<p>Wesley bumped knees with Jaden McDaniels of the Minnesota Timberwolves while cutting through the paint. He stayed in and shot two free throws before exiting the game.</p>\n<p>The 6-foot-5 guard was drafted out of Notre Dame by the Spurs with the 25th pick of the 2022 NBA Draft. Wesley has seen action in two games thus far in his rookie season. After the shocking waiver of Joshua Primo, Wesley seemed poised to see regular minutes for San Antonio moving forward.</p>",
               "pubDate": "Tue, 01 Nov 2022 08:30:11 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269223/Blake-Wesley-To-Miss-6-8-Weeks-With-Torn-MCL",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/nba_sanantoniospurs.jpg"
               }
            },
            {
               "title": "Sixers Forfeit 2nd Round Picks In 2023, 2024 Due To Tampering",
               "link": "https://basketball.realgm.com/wiretap/269217/Sixers-Forfeit-2nd-Round-Picks-In-2023-2024-Due-To-Tampering-",
               "description": "<p>The NBA announced that the Philadelphia 76ers violated league rules governing the timing of this season's free agency discussions and that the league has rescinded Philadelphia's second-round pick in each of the 2023 and 2024 Drafts.  </p>\n<p>The rescindment of two Draft picks reflected findings, following an investigation, that the 76ers engaged in free agency discussions involving two players (P.J. Tucker and Danuel House, Jr.) prior to the date when such discussions were permitted.      </p>\n<p>The team fully cooperated with the investigation.</p>",
               "pubDate": "Mon, 31 Oct 2022 17:02:19 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269217/Sixers-Forfeit-2nd-Round-Picks-In-2023-2024-Due-To-Tampering-",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Tucker_PJ_phi_221024.jpg"
               }
            },
            {
               "title": "NBA, NBPA Expected To Revisit Tampering Rules",
               "link": "https://basketball.realgm.com/wiretap/269224/NBA-NBPA-Expected-To-Revisit-Tampering-Rules",
               "description": "<p>The NBA has attempted to crack down on teams tampering with opposing players in recent years. After a wave of punishments, the league and the NBPA are expected to revisit rules around tampering with pending free agents.</p>\n<p>The NBA pushed the start of the free agent negotiating period up to 6:00 PM ET on June 30. This was after years of free agency opening at midnight on July 1, with many deals being agreed to immediately upon free agency opening. That six-hour head start still hasn't proven to be enough for many teams.</p>\n<p>The league voided an agreed-to deal between the Milwaukee Bucks and Sacramento Kings in the 2020 offseason, because the teams got an early jump on the negotiations. The Bucks were forced to forfeit a second-round pick for tampering with Bogdan Bogdanovic, who was set to be a restricted free agent.</p>\n<p>The Chicago Bulls and Miami Heat were also forced to forfeit second-round picks after jumping the gun on free agent negotiations. The Bulls and Heat had agreed to sign-and-trade deals too early with Lonzo Ball and Kyle Lowry, respectively.</p>\n<p>This week, the NBA took away two second-round picks from the Philadelphia 76ers. The Sixers were punished after they were found to have reached early agreements with P.J. Tucker and Danuel House Jr. In addition, the league is still in the midst of an investigation into the New York Knicks signing of Jalen Brunson.</p>",
               "pubDate": "Tue, 01 Nov 2022 08:46:05 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269224/NBA-NBPA-Expected-To-Revisit-Tampering-Rules",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/nba_realgm.jpg"
               }
            },
            {
               "title": "Udoka Azubuike, Leandro Bolmaro, RJ Hampton Had 23-24 Rookie Scale Team Options Declined",
               "link": "https://basketball.realgm.com/wiretap/269226/Udoka-Azubuike-Leandro-Bolmaro-RJ-Hampton-Had-23-24-Rookie-Scale-Team-Options-Declined",
               "description": "<p>Three players from the 2020 NBA Draft class had their 2023-24 rookie scale team options declined. The deadline for teams to exercise these options for next season was Monday, October 31.</p>\n<p>Udoka Azubuike of the Utah Jazz had his fourth-year option declined. Jazz teammate Leandro Bolmaro had his third-year option declined by the Jazz. (Bolmaro was also drafted in 2020 but did not sign until 2021.) Bolmaro was traded from the Minnesota Timberwolves to Utah this past offseason.</p>\n<p>RJ Hampton of the Orlando Magic also had his fourth-year option declined. Hampton was originally drafted by the Denver Nuggets before being traded to Orlando at the 2021 trade deadline.</p>\n<p>Fellow 2020 draftee Jalen Smith had his third-year option declined by the Phoenix Suns last year. Smith was then traded to the Indiana Pacers at the 2022 trade deadline.</p>\n<p>Azubuike, Bolmaro and Hampton's teams, or an acquiring team (as was the case with Smith), are now capped at paying them a first-year salary equal to the declined amount of their option. Smith re-signed with the Pacers on this type of deal this past summer.</p>",
               "pubDate": "Tue, 01 Nov 2022 09:38:31 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269226/Udoka-Azubuike-Leandro-Bolmaro-RJ-Hampton-Had-23-24-Rookie-Scale-Team-Options-Declined",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Hampton_RJ_orl_220120.jpg"
               }
            },
            {
               "title": "Kawhi Leonard Out For Next Two Games Due To Knee Stiffness",
               "link": "https://basketball.realgm.com/wiretap/269220/Kawhi-Leonard-Out-For-Next-Two-Games-Due-To-Knee-Stiffness",
               "description": "<p>Kawhi Leonard will miss the next two games for the Los Angeles Clippers due to right knee soreness.</p>\n<p>Leonard, who will not travel with the team during their Texas road trip, sat out his fourth straight game on Monday.</p>\n<p>\"He's frustrated. He wants to be out on the floor and then not being on the floor, and then now he can't travel,\" said Ty Lue on Monday.</p>\n<p>Leonard played in two out of the Clippers first three games before being out since last Tuesday. </p>",
               "pubDate": "Tue, 01 Nov 2022 00:46:26 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269220/Kawhi-Leonard-Out-For-Next-Two-Games-Due-To-Knee-Stiffness",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Leonard_Kawhi_lac_210717.jpg"
               }
            },
            {
               "title": "Shai Gilgeous-Alexander, Giannis Antetokounmpo Named NBA's Players Of The Week",
               "link": "https://basketball.realgm.com/wiretap/269219/Shai-Gilgeous-Alexander-Giannis-Antetokounmpo-Named-NBAs-Players-Of-The-Week",
               "description": "<p>Shai Gilgeous-Alexander and Giannis Antetokounmpo have been named the NBA's Players of the Week for Week 2.</p>\n<p>Gilgeous-Alexander averaged 31.7 points, 7.7 assists and 5.3 rebounds as the Oklahoma City Thunder went 3-0.</p>\n<p>Antetokounmpo averaged 35.7 points, 15.0 rebound and 6.0 assists as the Milwaukee Bucks went 3-0.</p>",
               "pubDate": "Mon, 31 Oct 2022 17:06:12 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269219/Shai-Gilgeous-Alexander-Giannis-Antetokounmpo-Named-NBAs-Players-Of-The-Week",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Gilgeousalexander_Shai_okc_191019.jpg"
               }
            },
            {
               "title": "Ben Simmons Misses Monday Game Due To Knee Soreness, Hoping To Return Tuesday",
               "link": "https://basketball.realgm.com/wiretap/269221/Ben-Simmons-Misses-Monday-Game-Due-To-Knee-Soreness-Hoping-To-Return-Tuesday",
               "description": "<p>Ben Simmons missed the Brooklyn Nets' 116-109 win over the Indiana Pacers due to knee soreness.</p>\n<p>Simmons, who said he was hopeful to return for Tuesday's game against the Bulls, didn't think there was any structural damage to his knee. </p>\n<p>\"It's sore. It's swollen. I think it's just coming back. I don't think there's anything structurally wrong with it, it's just coming back and playing,\" said Simmons.</p>\n<p>Seth Curry also missed the game due to a left ankle injury. </p>",
               "pubDate": "Tue, 01 Nov 2022 00:52:37 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269221/Ben-Simmons-Misses-Monday-Game-Due-To-Knee-Soreness-Hoping-To-Return-Tuesday",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Simmons_Ben_bkn_221025.jpg"
               }
            },
            {
               "title": "Myles Turner: Lakers Should 'Take A Very Hard Look' At Potential Trade",
               "link": "https://basketball.realgm.com/wiretap/269222/Myles-Turner-Lakers-Should-Take-A-Very-Hard-Look-At-Potential-Trade",
               "description": "<p>Myles Turner said that the Los Angeles Lakers should take a \"very hard look\" at trading for him on a recent episode of <a href=\"https://open.spotify.com/episode/7KsXtZhWV3GwonehuXtCxW\">\"The Woj Pod\" with Adrian Wojnarowski</a>.</p>\n<p>\"If I'm the Lakers, I take a very hard look at this with the position that you're in. I know what I can provide for a team -- my leadership, my shot-blocking, my 3-point ability and just my ability to make plays out there on the floor.</p>\n<p>\"And I take a very long look at it,\" said Turner.</p>\n<p>The Lakers reportedly considered <a href=\"https://basketball.realgm.com/wiretap/268848/Lakers-Pacers-Engaged-In-Serious-Russell-Westbrook-Talks-Right-Before-Start-Of-Camp\">trading Russell Westbrook and two first-round picks</a> for Turner and Buddy Hield at the start of October. </p>\n<p>Turner added that he understood the value of first-round picks. </p>\n<p>\"We all know picks are so valuable in this league, and someone like myself, I'm heading into the last year of my deal and you want to make sure you're getting a return for your assets,\" said Turner.</p>\n<p>Turner is averaging 12.7 points, 6.7 rebounds, and 2.3 blocks per game this season. </p>",
               "pubDate": "Tue, 01 Nov 2022 01:02:38 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269222/Myles-Turner-Lakers-Should-Take-A-Very-Hard-Look-At-Potential-Trade",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Turner_Myles_ind_210128.jpg"
               }
            },
            {
               "title": "Warriors Pick Up Options On James Wiseman, Jonathan Kuminga, Moses Moody",
               "link": "https://basketball.realgm.com/wiretap/269216/Warriors-Pick-Up-Options-On-James-Wiseman-Jonathan-Kuminga-Moses-Moody",
               "description": "<p>The Golden State Warriors have picked up the fourth-year option for center James Wiseman and third-year options for forward Jonathan Kuminga and guard Moses Moody ahead of Monday's deadline, sources confirmed to ESPN.</p>\n<p>Wiseman's option is $12.1 million, while Kuminga's and Moody's are $6 million and $3.9 million, respectively. The trio is now under contract with the Warriors until the end of the 2023-24 season, but Wiseman will be extension-eligible next summer and could be a restricted free agent in 2024.</p>",
               "pubDate": "Mon, 31 Oct 2022 16:26:36 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269216/Warriors-Pick-Up-Options-On-James-Wiseman-Jonathan-Kuminga-Moses-Moody",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Wiseman_James_gsw_210122.jpg"
               }
            },
            {
               "title": "Dunc'd On: 15 in 60 (Western Conference 10.31.22 Part 1)",
               "link": "https://basketball.realgm.com/wiretap/269215/Duncd-On-15-in-60-Western-Conference-103122-Part-1",
               "description": "<p><iframe src=\"https://player.simplecast.com/04c6cddc-43a3-44a2-979b-5f3e2ed9a63a?dark=false\" width=\"100%\" height=\"200px\" frameborder=\"no\" scrolling=\"no\" seamless=\"\" data-mce-fragment=\"1\"><span data-mce-type=\"bookmark\" style=\"display: inline-block; width: 0px; overflow: hidden; line-height: 0;\" class=\"mce_SELRES_start\">&#65279;</span></iframe></p>\n<p>Our first bi-weekly look at the West.</p>\n<ul>\n<li>HOU: Dan Feldman shares his early impressions of Jabari Smith;</li>\n<li>DAL: The Christian Wood dilemma, Luka's historic start and our early impressions of them in the West;</li>\n<li>DEN and LAL: Discussing the Lakers first win of the season against a close to healthy Denver squad;</li>\n<li>GSW: The strategic machinations behind their win against Miami, and our concern level after 2 straight East Coast losses;</li>\n<li>LAC: The Clippers struggles in 3 straight losses to OKC and NOP and where the offense has come up short so far</li>\n<li>MEM and UTA: A wild Saturday night game in Salt Lake, Desmond Bane's breakout, and why the Jazz are so hard to guard</li>\n<li>SAS: The Josh Primo release and allegations, plus the keys to their 5-2 start</li>\n</ul>\n<p>Dunc'd On Prime is the only place to get all six of our episodes, including one with Nate and John Hollinger, ad-free each week! <a href=\"http://duncdon.supportingcast.fm/join\">DuncdOn.SupportingCast.FM/join</a></p>\n<p>Subscribe to <a href=\"http://nateduncannba.com/free/\">our weekly mailing list</a> for free bonus content and all the info you need to keep up with the latest from Nate and Danny!</p>\n<p>With <a href=\"http://twitter.com/dannyleroux\">@DannyLeroux</a> and <a href=\"https://cms.megaphone.fm/organizations/1e91b938-a9d5-11e7-bf4c-b34da90893d7/podcasts/7af881f0-ec38-11e9-a40d-33d4bbe7b567/episodes/2582afc4-ec39-11e9-b6df-e7d09ab570aa/twitter.com/NateDuncanNBA\">@NateDuncanNBA</a></p>",
               "pubDate": "Mon, 31 Oct 2022 16:08:36 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269215/Duncd-On-15-in-60-Western-Conference-103122-Part-1",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Doncic_Luka_dal_220226.jpg"
               }
            },
            {
               "title": "Mavericks Assign Jaden Hardy To G League",
               "link": "https://basketball.realgm.com/wiretap/269213/Mavericks-Assign-Jaden-Hardy-To-G-League",
               "description": "<p>The Dallas Mavericks have assigned guard Jaden Hardy to the Texas Legends of the NBA G League.</p>\n<p>Hardy (6-4, 198) has played 10 minutes in two games with the Mavericks this season, posting two rebounds and one assist. The rookie will be with the Legends through their back-to-back at the Austin Spurs on Friday, Nov. 4, and Saturday, Nov. 5.</p>\n<p>Hardy has appeared in two games so far for the Mavericks. </p>",
               "pubDate": "Mon, 31 Oct 2022 13:31:30 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269213/Mavericks-Assign-Jaden-Hardy-To-G-League",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/nba_dallasmavericks.jpg"
               }
            },
            {
               "title": "Paolo Banchero Confirms Commitment To Italian National Team",
               "link": "https://basketball.realgm.com/wiretap/269212/Paolo-Banchero-Confirms-Commitment-To-Italian-National-Team",
               "description": "<p>Paolo Banchero recently confirmed that his national team commitment lies with Italy, and not with the United States. Banchero initially told Marc Stein that he was planning to play for Italy and confirmed that commitment again in a conversation with Orlando Magic teammate R.J. Hampton.</p>\n<p>While on Hampton's \"Young Person\" show, Banchero explained that him playing for Italy has been in the works for a while.</p>\n<p>\"When I was 16, the Italian national team reached out to my dad,\" Banchero said. \"They were like, 'Does he have Italian roots? Can he get citizenship?' And my dad told them yes. So, the whole process started. I flew to San Francisco multiple times to meet them at the Italian embassy, we had a few meetings, and I ended up getting my Italian passport.\"</p>\n<p>Banchero said he doesn't know when he'll make his debut for Italy, but that he's excited for the opportunity.</p>\n<p>\"I'm planning to play for the Italian national team, but I'm not sure when,\" Banchero said. \"I haven't been out there yet, but man, the amount of love I'm getting from there... it's crazy, man. It's crazy. I can't wait to go to Italy.\"</p>",
               "pubDate": "Mon, 31 Oct 2022 09:56:58 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269212/Paolo-Banchero-Confirms-Commitment-To-Italian-National-Team",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Banchero_Paolo_orl_221012.jpg"
               }
            },
            {
               "title": "Luka Doncic First Player Since Michael Jordan In 1986 To Open With Six Games Of 30 Or More Points",
               "link": "https://basketball.realgm.com/wiretap/269211/Luka-Doncic-First-Player-Since-Michael-Jordan-In-1986-To-Open-With-Six-Games-Of-30-Or-More-Points",
               "description": "<p>Luka Doncic's 2022-23 season is off to quite the start. Six games into the season, Doncic is leading the NBA in scoring at 36.7 points per game.</p>\n<p>Doncic has scored between 32 and 44 points in each of the Dallas Mavericks first six games. That made Doncic the first player since Michael Jordan in 1986 to open a season with 30 or more points in his first six games of a season. Against the Orlando Magic on Sunday, Doncic hit the 30-point marker before halftime.</p>\n<p>For his part, Doncic says he can play even better than he has. That's backed by the fact that the Mavs star is hitting only 22.6% of his three-pointers on the young season. Doncic is also averaging 9.5 rebounds and 8.7 assists, to go along with his gaudy scoring numbers.</p>",
               "pubDate": "Mon, 31 Oct 2022 06:24:37 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269211/Luka-Doncic-First-Player-Since-Michael-Jordan-In-1986-To-Open-With-Six-Games-Of-30-Or-More-Points",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Doncic_Luka_dal_220517.jpg"
               }
            },
            {
               "title": "Kyrie Irving Likely To Avoid Suspension For Sharing Anti-Semitic Movie",
               "link": "https://basketball.realgm.com/wiretap/269210/Kyrie-Irving-Likely-To-Avoid-Suspension-For-Sharing-Anti-Semitic-Movie",
               "description": "<p>Kyrie Irving found himself in some trouble after many spoke out against Irving shared a link to an anti-Semitic movie on Twitter. The Brooklyn Nets, the NBA and Nets owner Joe Tsai all shared messages disapproving of hate or discrimination in any form.</p>\n<p>There doesn't seem to be any form of official punishment coming for Irving, either from the Nets or the NBA. Nets GM Sean Marks said anything further would be handled in-house, while a league source indicated there will be no fines nor suspensions for Irving.</p>\n<p>While the Nets and the NBA shared broad, generalized statements against any form of anti-Semitism or hate speech, Brooklyn's primary governor Tsai called Irving out directly in a tweet.</p>\n<p>\"The social media posts from, @KyrieIrving, are troubling. The book and film he promotes trade in deeply #antisemitic themes including those promoted by dangerous sects of the Black Hebrew Israelites movement. Irving should clarify now,\" tweeted Tsai.</p>\n<p>Irving initially refused to take down the tweet, saying \"I respect what Joe said, but there has a lot to do with the, not ego or pride of how proud I am to be an African heritage, but also to be living as a free black man here in America, knowing the historical complexities for me to get here. So, I'm not going to stand down on anything that I believe in. I'm only going to get stronger because I'm not alone. I have a whole army around me.\"</p>\n<p>However, the tweet was deleted as of Sunday evening.</p>",
               "pubDate": "Mon, 31 Oct 2022 06:13:01 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269210/Kyrie-Irving-Likely-To-Avoid-Suspension-For-Sharing-Anti-Semitic-Movie",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Irving_Kyrie_bkn_220630.jpg"
               }
            },
            {
               "title": "76ers Exercise 23-24 Options On Tyrese Maxey, Jaden Springer",
               "link": "https://basketball.realgm.com/wiretap/269209/76ers-Exercise-23-24-Options-On-Tyrese-Maxey-Jaden-Springer",
               "description": "<p>The Philadelphia 76ers have exercised the fourth-year contract option for Tyrese Maxey and the third-year contract option for Jaden Springer, both set to take effect for the 2023-24 season.  </p>\n<p>Maxey, now in his third professional season, holds career averages of 13.7 points (.480 FG, .403 3FG), 2.6 rebounds, 3.3 assists, and 26.9 minutes in 143 games (89 starts). The Texas native played in 75 games (74 starts) in his second NBA season in 2021-22, upping his scoring average from 8.0 to 17.5 while shooting .485 from the floor. His points-per-game increase ranked as the largest among second-year players last season, while his .427 mark from three-point range was third in the NBA. A 2022 Rising Stars selection, Maxey reached the 20-point mark on 25 occasions, including five games of 30-plus points. </p>\n<p>Originally selected by the 76ers with the No. 21 overall pick in the 2020 NBA Draft, Maxey, 21, has averaged 22.6 points on .504 shooting (.468 3FG), 3.7 rebounds, 3.4 assists, and 1.1 steals in seven games (all starts) this season. He set career highs in both points (44) and three-point field goals (nine) at Toronto on Oct. 28, becoming just the second player in 76ers franchise history to tally 40-plus points prior to the age of 22 (Iverson, five times). </p>\n<p>Springer, 20, has tallied seven points on 3-of-4 shooting in four career appearances for the 76ers. The No. 28 overall selection of the 2021 NBA Draft has competed in 19 career G League games (18 starts) for the Delaware Blue Coats, averaging 14.9 points, 4.7 rebounds, 2.8 assists and 1.5 steals in 26.8 minutes per contest. Springer helped lead Delaware to its second consecutive appearance in the G League Finals. </p>",
               "pubDate": "Sun, 30 Oct 2022 22:09:32 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269209/76ers-Exercise-23-24-Options-On-Tyrese-Maxey-Jaden-Springer",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Maxey_Tyrese_phi_210205.jpg"
               }
            },
            {
               "title": "Rockets Exercise 23-24 Options On Jalen Green, Alperen Sengun, Usman Garuba, Josh Christopher",
               "link": "https://basketball.realgm.com/wiretap/269208/Rockets-Exercise-23-24-Options-On-Jalen-Green-Alperen-Sengun-Usman-Garuba-Josh-Christopher",
               "description": "<p>The Houston Rockets have exercised the third-year options for Jalen Green, Alperen Sengun, Usman Garuba and Josh Christopher. All four players are 20 years old.</p>\n<p>Green was the second overall pick by Houston in the 2021 NBA Draft.  He is averaging 20.7 points this season after scoring 20-plus points in 17 of the final 25 games in 2021-22 while earning All-Rookie First Team honors.  Green is averaging 2.8 3-pointers made on 37.0% shooting this season and is tied for the fourth-most 3FGM (174) through the first 73 games played of a career.</p>\n<p>Sengun was originally the 16th overall pick by Oklahoma City in the 2021 NBA Draft before his rights were acquired by the Rockets.  He is averaging 15.3 ppg and 10.3 rpg in four games played this season, up from 9.5 ppg and 5.4 rpg as a rookie in 2021-22.  Dating back to 1976-77, Sengun is the first player to have recorded at least 60 points and 40 rebounds while playing fewer than 100 minutes through the first four games played in a season.</p>\n<p>Garuba was the 23rd overall pick by the Rockets in the 2021 NBA Draft.  In 28 career games, he is averaging 7.5 ppg, 12.5 rpg, 2.5 apg, 1.7 spg and 1.4 bpg per 36 minutes played.  This past summer, Garuba helped Spain win the FIBA EuroBasket Championship.</p>\n<p>Christopher was the 24th overall pick by Houston in the 2021 NBA Draft.  Over the final 18 games of 2021-22, he averaged 11.1 ppg, 3.3 rpg, 2.6 apg and 1.1 spg in 22.6 mpg while shooting 47.8% from the floor.  Christopher had the third-most games of recording multiple steals (21) by any rookie last season.</p>",
               "pubDate": "Sun, 30 Oct 2022 22:08:09 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269208/Rockets-Exercise-23-24-Options-On-Jalen-Green-Alperen-Sengun-Usman-Garuba-Josh-Christopher",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Green_Jalen_hou_211012.jpg"
               }
            },
            {
               "title": "Bojan Bogdanovic Agrees To Two-Year, $39.1M Extension With Pistons Through 2024-25 Season",
               "link": "https://basketball.realgm.com/wiretap/269207/Bojan-Bogdanovic-Agrees-To-Two-Year-$391M-Extension-With-Pistons-Through-2024-25-Season",
               "description": "<p>Bojan Bogdanovic agreed to a two-year, $39.1 million extension with the Detroit Pistons, sources told Adrian Wojnarowski of ESPN.</p>\n<p>Bogdanovic is making $19.5 million in the final year of his contract, with the extension running through the 2024-25 season. </p>\n<p>Bogdanovic, who was acquired from the Jazz this offseason, is averaging 23 points per game this season.</p>",
               "pubDate": "Sun, 30 Oct 2022 16:48:01 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269207/Bojan-Bogdanovic-Agrees-To-Two-Year-$391M-Extension-With-Pistons-Through-2024-25-Season",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Bogdanovic_Bojan_uta_200518.jpg"
               }
            },
            {
               "title": "Kawhi Leonard Out Monday Due To Knee Stiffness, Status 'Day-To-Day'",
               "link": "https://basketball.realgm.com/wiretap/269206/Kawhi-Leonard-Out-Monday-Due-To-Knee-Stiffness-Status-Day-To-Day",
               "description": "<p>Kawhi Leonard will miss the Los Angeles Clippers' Monday game against the Houston Rockets due to knee stiffness.</p>\n<p>Ty Lue added that Leonard's status was \"day-to-day.\"</p>\n<p>Leonard has been out since last Tuesday's game against the Thunder due to <a href=\"https://basketball.realgm.com/wiretap/269202/Kawhi-Leonard-Out-For-Sunday-Game-Due-To-Knee-Injury-Management\">right knee injury management</a>. </p>",
               "pubDate": "Sun, 30 Oct 2022 16:35:11 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269206/Kawhi-Leonard-Out-Monday-Due-To-Knee-Stiffness-Status-Day-To-Day",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Leonard_Kawhi_lac_210717.jpg"
               }
            },
            {
               "title": "Players Would Risk Lockout To Stop NBA's Push For Hard Cap",
               "link": "https://basketball.realgm.com/wiretap/269205/Players-Would-Risk-Lockout-To-Stop-NBAs-Push-For-Hard-Cap",
               "description": "<p>The NBA is pushing for a hard cap as part of its next CBA negotiations, which is being described instead as an \"Upper Spending Limit.\"</p>\n<p>\"There will be a lockout before there's a hard cap,\" said one source from the players' side to Marc Stein.</p>\n<p>Currently, there are only three ways a team can be hard-capped:</p>\n<ol>\n<li>Acquire a free agent via sign-and-trade</li>\n<li>Sign a free agent with the non-taxpayer mid-level exception</li>\n<li>Signing a free agent with the bi-annual exception</li>\n</ol>\n<p>Sources say there is a strong desire from some within the league to limit overall team spending while the value of individual contracts continues to climb due to another influx of television money. </p>\n<p>The league's current system is built around a salary cap and a luxury tax.</p>\n<p>The two sides have until the Dec. 15th deadline to opt out of the current CBA, which would terminate the agreement on June 30, 2023.</p>",
               "pubDate": "Sun, 30 Oct 2022 13:04:17 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269205/Players-Would-Risk-Lockout-To-Stop-NBAs-Push-For-Hard-Cap",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/McCollum_CJ_nop_220215.jpg"
               }
            },
            {
               "title": "Warriors-Suns Averages 2.32M Viewers, Most Viewership On ESPN And TNT Up From Last Year",
               "link": "https://basketball.realgm.com/wiretap/269204/Warriors-Suns-Averages-232M-Viewers-Most-Viewership-On-ESPN-And-TNT-Up-From-Last-Year",
               "description": "<p>Entering the weekend, 9 out of 12 games on ESPN and TNT posted an increase in viewers from last season.</p>\n<p>The games include the Suns versus Warriors on Tuesday, which averaged 2.32 million viewers on TNT. That number doubled the equivalent game from last year (Nuggets versus Jazz at 1.2 million) while becoming the most-watched game of the season outside of Opening Night.</p>\n<p>Wednesday's Bucks versus Nets game combined for a 1.1 rating with 2.0 million viewers, which represented ESPN's biggest audience in four years for the first half of a weeknight doubleheader. </p>",
               "pubDate": "Sun, 30 Oct 2022 12:17:49 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269204/Warriors-Suns-Averages-232M-Viewers-Most-Viewership-On-ESPN-And-TNT-Up-From-Last-Year",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/nba_realgm.jpg"
               }
            },
            {
               "title": "Robert Covington Placed In Health And Safety Protocols",
               "link": "https://basketball.realgm.com/wiretap/269203/Robert-Covington-Placed-In-Health-And-Safety-Protocols",
               "description": "<p>Robert Covington was placed in the league's health and safety protocols on Saturday.</p>\n<p>Covington is out indefinitely.</p>\n<p>Covington is averaging 5.2 points in 17 minutes on the season. </p>",
               "pubDate": "Sun, 30 Oct 2022 12:08:35 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269203/Robert-Covington-Placed-In-Health-And-Safety-Protocols",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Covington_Robert_lac_220425.jpg"
               }
            },
            {
               "title": "Kawhi Leonard Out For Sunday Game Due To Knee Injury Management",
               "link": "https://basketball.realgm.com/wiretap/269202/Kawhi-Leonard-Out-For-Sunday-Game-Due-To-Knee-Injury-Management",
               "description": "<p>Kawhi Leonard is set to miss Sunday's game against the New Orleans Pelicans due to right knee injury management.</p>\n<p>Leonard will now miss three consecutive games after initially being held out against the Thunder last Tuesday due to stiffness in his knee.</p>\n<p>Sunday's game is the first of a back-to-back for the Clippers, with Leonard stating before the season that he likely would not play both games of a back-to-back. </p>",
               "pubDate": "Sun, 30 Oct 2022 12:04:33 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269202/Kawhi-Leonard-Out-For-Sunday-Game-Due-To-Knee-Injury-Management",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Leonard_Kawhi_lac_210717.jpg"
               }
            },
            {
               "title": "Anthony Davis Questionable For Sunday Return Against Nuggets",
               "link": "https://basketball.realgm.com/wiretap/269201/Anthony-Davis-Questionable-For-Sunday-Return-Against-Nuggets",
               "description": "<p>Anthony Davis is listed as questionable for the Los Angeles Lakers' Sunday game against the Denver Nuggets.</p>\n<p>Davis sat out on Friday due to a sore back.</p>\n<p>Juan Toscano-Anderson is also listed as questionable. </p>",
               "pubDate": "Sat, 29 Oct 2022 20:43:36 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269201/Anthony-Davis-Questionable-For-Sunday-Return-Against-Nuggets",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Davis_Anthony_lal_220208.jpg"
               }
            },
            {
               "title": "Former Female Spurs Employee Accusing Joshua Primo Hires Attorney Tony Buzbee",
               "link": "https://basketball.realgm.com/wiretap/269200/Former-Female-Spurs-Employee-Accusing-Joshua-Primo-Hires-Attorney-Tony-Buzbee-",
               "description": "<p>A former San Antonio Spurs female employee alleging that Joshua Primo exposed himself to her has hired attorney Tony Buzbee, according to Shams Charania of The Athletic.</p>\n<p>Buzbee represented the women in a sexual misconduct lawsuit against Deshaun Watson.</p>\n<p>Primo, who was waived by the Spurs on Friday, allegedly <a href=\"https://basketball.realgm.com/wiretap/269198/Joshua-Primo-Allegedly-Exposed-Himself-To-Multiple-Women\">exposed himself to multiple woman</a>.</p>",
               "pubDate": "Sat, 29 Oct 2022 20:40:35 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269200/Former-Female-Spurs-Employee-Accusing-Joshua-Primo-Hires-Attorney-Tony-Buzbee-",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Primo_Josh_sas_210120.jpg"
               }
            },
            {
               "title": "Zion Williamson Questionable For Sunday Return",
               "link": "https://basketball.realgm.com/wiretap/269199/Zion-Williamson-Questionable-For-Sunday-Return",
               "description": "<p>Zion Williamson is listed as questionable for the New Orleans Pelicans' Sunday matchup against the Los Angeles Clippers.</p>\n<p>Williamson has missed the last two games due to a right posterior hip and lower back bruise.</p>\n<p>\"If I feel great, I'm going to go. If I feel like it's too much soreness or it got worse, then I'm not going to go,\" said Williamson after practice on Saturday.</p>\n<p>Herb Jones is also questionable for Sunday after missing the last two games with a hyperextended right knee. </p>",
               "pubDate": "Sat, 29 Oct 2022 19:16:26 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269199/Zion-Williamson-Questionable-For-Sunday-Return",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Williamson_Zion_nop_210121.jpg"
               }
            },
            {
               "title": "Joshua Primo Allegedly Exposed Himself To Multiple Women",
               "link": "https://basketball.realgm.com/wiretap/269198/Joshua-Primo-Allegedly-Exposed-Himself-To-Multiple-Women",
               "description": "<p>Joshua Primo is accused in multiple instances of exposing himself to women, sources told Ramona Shelburne and Adrian Wojnarowski of ESPN.</p>\n<p>Primo was <a href=\"https://basketball.realgm.com/wiretap/269188/Spurs-Waive-Joshua-Primo\">abruptly waived by the Spurs</a> on Friday night. </p>\n<p>Primo released a statement after the move saying he was <a href=\"https://basketball.realgm.com/wiretap/269190/Joshua-Primo-Puts-Out-Statement-After-Getting-Released-Will-Focus-On-My-Mental-Health\">focusing on his mental health</a>.</p>\n<p>Sources add that multiple teams remain interested in signing Primo, though they are searching for a more complete picture to the situation.</p>\n<p>Should a team place a claim to acquire Primo, they would either need the cap space or a traded player exception large enough to absorb his $4.1 million salary for this year. The team would also owe him $4.3 million for his 2023-24 contract.  </p>\n<p>Primo will clear waivers and become a free agent on Monday.</p>",
               "pubDate": "Sat, 29 Oct 2022 19:12:25 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269198/Joshua-Primo-Allegedly-Exposed-Himself-To-Multiple-Women",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Primo_Josh_sas_210120.jpg"
               }
            },
            {
               "title": "Corey Kispert Out Sunday Versus Celtics",
               "link": "https://basketball.realgm.com/wiretap/269197/Corey-Kispert-Out-Sunday-Versus-Celtics",
               "description": "<p>The Washington Wizards listed Corey Kispert as out for Sunday's game against the Boston Celtics with a sprained left ankle. </p>\n<p>Kispert, who has yet to make an appearance this season, suffered the injury on October 2. </p>",
               "pubDate": "Sat, 29 Oct 2022 18:09:30 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269197/Corey-Kispert-Out-Sunday-Versus-Celtics",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Kispert_Corey_was_211108.jpg"
               }
            },
            {
               "title": "Baba Miller To Miss First Half Of Florida State Season Due To Improper Benefits",
               "link": "https://basketball.realgm.com/wiretap/269196/Baba-Miller-To-Miss-First-Half-Of-Florida-State-Season-Due-To-Improper-Benefits",
               "description": "<p>Florida State freshman Boba Miller is set to miss the first half of the season due after losing an appeal over receiving improper travel benefits.</p>\n<p>Miller received travel benefits while going from Spain to the United States to attend a training camp prior to committing to FSU.</p>\n<p>Miller is seen as one of the top international prospects attending college for the 2022 class. </p>",
               "pubDate": "Sat, 29 Oct 2022 17:03:27 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269196/Baba-Miller-To-Miss-First-Half-Of-Florida-State-Season-Due-To-Improper-Benefits",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Logo_FloridaState.jpg"
               }
            },
            {
               "title": "Get Your Latest NBA News From RealGM's Basketball Wiretap",
               "link": "https://basketball.realgm.com/news",
               "description": "Get all the latest news and happenings from around the NBA with RealGM's Basketball Wiretap.",
               "pubDate": "Tue, 01 Nov 2022 11:17:01 EDT",
               "guid": "https://basketball.realgm.com/news"
            }
         ]
      },
      "_xmlns:media": "http://search.yahoo.com/mrss/",
      "_version": "2.0"
   }
}