{
    "rss": {
       "channel": {
          "title": "RealGM Basketball Wiretap",
          "link": "https://basketball.realgm.com/news",
          "description": "Basketball News, Rumors, Scores, Stats, Analysis, Depth Charts, Forums",
          "language": "en-us",
          "pubDate": "Sat, 17 Sep 2022 11:17:02 EDT",
          "lastBuildDate": "Sat, 17 Sep 2022 11:17:02 EDT",
          "item": [
             {
                "title": "Lakers, Dennis Schroder Agree To One-Year Contract",
                "link": "https://basketball.realgm.com/wiretap/268641/Lakers-Dennis-Schroder-Agree-To-One-Year-Contract",
                "description": "<p>The Los Angeles Lakers are going back to a familiar face to add some depth for the upcoming season. The Lakers and Dennis Schroder have agreed to a one-year, veteran minimum contract.</p>\n<p>Schroder played in 61 games for Los Angeles during the 2020-21 season. The veteran point guard averaged 15.4 points and 5.7 assists in 32.1 minutes per game.</p>\n<p>Last season, Schroder split the year between the Boston Celtics and Houston Rockets. Schroder joined Boston on the Taxpayer Mid-Level Exception, before being traded to Houston at the trade deadline.</p>\n<p>This summer, Schroder has played well as one of the leaders for Germany during EuroBasket. Schroder helped lead the German team to the EuroBasket semi-finals, which sparked interest around the NBA in bringing him.</p>",
                "pubDate": "Fri, 16 Sep 2022 17:55:01 EDT",
                "guid": "https://basketball.realgm.com/wiretap/268641/Lakers-Dennis-Schroder-Agree-To-One-Year-Contract",
                "thumbnail": {
                   "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Schroder_Dennis_hou_220222.jpg"
                }
             },
             {
                "title": "Lakers Strongly Considering Bringing Russell Westbrook Off Bench",
                "link": "https://basketball.realgm.com/wiretap/268642/Lakers-Strongly-Considering-Bringing-Russell-Westbrook-Off-Bench",
                "description": "<p>The Los Angeles Lakers are strongly considering bringing Russell Westbrook off the bench this season, sources told Jovan Buha and Sam Amick of The Athletic.</p>\n<p>The organization is willing to back any decision Darvin Ham ends up making regarding his rotation.</p>\n<p>The news comes on the heels of the <a href=\"https://basketball.realgm.com/wiretap/268641/Lakers-Dennis-Schroder-Agree-To-One-Year-Contract\">Lakers signing Dennis Schroder to a one-year deal</a> on Friday. The team also traded for Patrick Beverley in late August. </p>\n<p>Sources also added that it is becoming more and more likely that Westbrook will have role with the Lakers this season as training camp approaches. </p>",
                "pubDate": "Sat, 17 Sep 2022 01:48:30 EDT",
                "guid": "https://basketball.realgm.com/wiretap/268642/Lakers-Strongly-Considering-Bringing-Russell-Westbrook-Off-Bench",
                "thumbnail": {
                   "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Westbrook_Russell_lal_211022.jpg"
                }
             },
             {
                "title": "Suns' Minority Owner Jahm Najafi Calls For Robert Sarver's Resignation",
                "link": "https://basketball.realgm.com/wiretap/268633/Suns-Minority-Owner-Jahm-Najafi-Calls-For-Robert-Sarvers-Resignation",
                "description": "<p>Phoenix Suns vice chairman and minority owner Jahm Najafi called for Robert Sarver's resignation in an open letter to team employees on Thursday night.</p>\n<p>Najafi is the second-largest stakeholder in the team.</p>\n<p>\"I cannot in good judgment sit back and allow our children and future generations of fans to think that this behavior is tolerated because of wealth and privilege. Therefore, in accordance with my commitment to helping eradicate any form of racism, sexism and bias, as Vice Chairman of the Phoenix Suns, I am calling for the resignation of Robert Sarver,\" wrote Najafi in the letter.</p>\n<p>Najafi added that he had no interest in becoming the managing partner of the team. </p>\n<p>Sarver was suspended for <a href=\"https://basketball.realgm.com/wiretap/268607/Robert-Sarver-Suspended-One-Year-Fined-$10M\">one year and fined $10 million</a> following an investigation into toxic workplace issues under his ownership. </p>\n<p>The league granted minority owner Sam Garvin <a href=\"https://basketball.realgm.com/wiretap/268632/NBA-Grants-Suns-Minority-Owner-Sam-Garvin-Authority-To-Act-As-Interim-Governor\">the authority to act as interim governor</a>. </p>",
                "pubDate": "Fri, 16 Sep 2022 01:41:04 EDT",
                "guid": "https://basketball.realgm.com/wiretap/268633/Suns-Minority-Owner-Jahm-Najafi-Calls-For-Robert-Sarvers-Resignation",
                "thumbnail": {
                   "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/nba_phoenixsuns.jpg"
                }
             },
             {
                "title": "PayPal Won't Continue Jersey Sponsorship With Suns If Robert Sarver Remains With Team",
                "link": "https://basketball.realgm.com/wiretap/268640/PayPal-Wont-Continue-Jersey-Sponsorship-With-Suns-If-Robert-Sarver-Remains-With-Team",
                "description": "<p>PayPal announced that it will not continue its jersey patch sponsorship with the Phoenix Suns should Robert Sarver continue in his role with the team at the end of his one-year suspension.</p>\n<p>PayPal's deal with the Suns is set to expire after the 22-23 season and was worth $3 million during the 21-22 season.</p>\n<p>\"PayPal is a values-driven company and has a strong record of combatting racism, sexism and all forms of discrimination,\" PayPal CEO and president Dan Schulman said in a statement. \"We have reviewed the report of the NBA league's independent investigation into Phoenix Suns owner Robert Sarver and have found his conduct unacceptable and in conflict with our values.</p>\n<p>\"... In light of the findings of the NBA's investigation, we will not renew our sponsorship should Robert Sarver remain involved with the Suns organization, after serving his suspension,\" Schulman said in his statement.</p>",
                "pubDate": "Fri, 16 Sep 2022 13:28:46 EDT",
                "guid": "https://basketball.realgm.com/wiretap/268640/PayPal-Wont-Continue-Jersey-Sponsorship-With-Suns-If-Robert-Sarver-Remains-With-Team",
                "thumbnail": {
                   "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Sarver_Robert_phx_211111.jpg"
                }
             },
             {
                "title": "Gary Payton II Underwent Surgery On Core Muscle, Expected To Fully Recover By Regular Season",
                "link": "https://basketball.realgm.com/wiretap/268643/Gary-Payton-II-Underwent-Surgery-On-Core-Muscle-Expected-To-Fully-Recover-By-Regular-Season",
                "description": "<p>Gary Payton II underwent surgery in July to address a core muscle injury, according to the Portland Trail Blazers.</p>\n<p>Payton is expected to be fully healthy by the start of the regular season.</p>\n<p>The Blazers signed Payton to a three-year, $28 million deal this offseason. </p>",
                "pubDate": "Sat, 17 Sep 2022 01:55:38 EDT",
                "guid": "https://basketball.realgm.com/wiretap/268643/Gary-Payton-II-Underwent-Surgery-On-Core-Muscle-Expected-To-Fully-Recover-By-Regular-Season",
                "thumbnail": {
                   "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Payton_Gary_gsw_220425.jpg"
                }
             },
             {
                "title": "Pacers Sign Kendall Brown To Two-Way Contract",
                "link": "https://basketball.realgm.com/wiretap/268644/Pacers-Sign-Kendall-Brown-To-Two-Way-Contract",
                "description": "<p>The Indiana Pacers have signed Kendall Brown to a Two-Way contract. Brown was drafted with the 18th pick of the second round of the 2022 NBA Draft by the Minnesota Timberwolves before his rights were traded to Indiana.</p>\n<p>In his lone season at Baylor, Brown started in all 34 games for the Bears. The 6-foot-8 wing averaged 9.7 points and 4.9 rebounds in 27 minutes per game.</p>\n<p> </p>\n<p> </p>",
                "pubDate": "Sat, 17 Sep 2022 09:01:24 EDT",
                "guid": "https://basketball.realgm.com/wiretap/268644/Pacers-Sign-Kendall-Brown-To-Two-Way-Contract",
                "thumbnail": {
                   "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/nba_indianapacers.jpg"
                }
             },
             {
                "title": "Pacers Sign James Johnson, Bennie Boatwright, David Stockton, Gabe York To Camp Deals",
                "link": "https://basketball.realgm.com/wiretap/268645/Pacers-Sign-James-Johnson-Bennie-Boatwright-David-Stockton-Gabe-York-To-Camp-Deals",
                "description": "<p>The Indiana Pacers have completed their training camp roster by signing a foursome of players. James Johnson, Bennie Boatwright, David Stockton and Gabe York all signed what are expected to be non-guaranteed training camp deals with Indiana.</p>\n<p>Johnson is a 13-year NBA veteran. He appeared in 62 games for the Brooklyn Nets last season. In 19.2 minutes per game, Johnson averaged 5.5 points and 3.5 rebounds per game.</p>\n<p>Boatwright was briefly with the Pacers last preseason, but did not appear in a game. Boatwright then played for the Fort Wayne Mad Ants of the G League before injuring his knee and missing the remainder of the season. The 6-foot-10 forward was a four-year starter at USC and averaged 18.2 points per game as a senior in 2018-19.</p>\n<p>Stockton has appeared in six NBA games over two seasons with the Sacramento Kings and Utah Jazz. Last season, in 14 G League games with the Memphis Hustle, the 31-year-old point guard averaged 11.2 points and 4.2 assists per game.</p>\n<p>York finished last season on a Two-Way contract with the Pacers. The combo guard appeared in two NBA games with Indiana. In 34 games with the Mad Ants of the G League, York averaged 21.7 points, 4.7 rebounds, 4.2 assists and 2.5 steals per game.</p>",
                "pubDate": "Sat, 17 Sep 2022 09:16:01 EDT",
                "guid": "https://basketball.realgm.com/wiretap/268645/Pacers-Sign-James-Johnson-Bennie-Boatwright-David-Stockton-Gabe-York-To-Camp-Deals",
                "thumbnail": {
                   "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Johnson_James_bkn_211130.jpg"
                }
             },
             {
                "title": "Pistons Waive Keifer Sykes",
                "link": "https://basketball.realgm.com/wiretap/268648/Pistons-Waive-Keifer-Sykes",
                "description": "<p>The Detroit Pistons have waived guard Keifer Sykes. Sykes was recently signed in a move designed to gain his G League rights for the Motor City Cruise.</p>\n<p>Sykes appeared in 32 games (11 starts) for the Indiana Pacers last season. The 6-foot guard averaged 5.6 points for the Pacers. Sykes averaged 16.5 points, 4.3 rebounds and 7.5 assists for the Fort Wayne Mad Ants of the G League.</p>\n<p> </p>",
                "pubDate": "Sat, 17 Sep 2022 09:39:22 EDT",
                "guid": "https://basketball.realgm.com/wiretap/268648/Pistons-Waive-Keifer-Sykes",
                "thumbnail": {
                   "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/nba_detroitpistons.jpg"
                }
             },
             {
                "title": "Jazz Waive Xavier Sneed, Paris Bass",
                "link": "https://basketball.realgm.com/wiretap/268646/Jazz-Waive-Xavier-Sneed-Paris-Bass",
                "description": "<p>The Utah Jazz have waived Xavier Sneed from his Two-Way contract. Utah also waived the recently signed Paris Bass from his non-guaranteed training camp deal.</p>\n<p>Sneed appeared in nine games between the Jazz and Memphis Grizzlies last season. The 6-foot-5 wing played in 15 G League games between the Salt Lake City Stars and the Greensboro Swarm. Sneed averaged 15.1 and 6.2 rebounds in the G League. He signed a two-year Two-Way deal with Utah in mid-February.</p>\n<p>Bass was signed and almost immediately waived by the Jazz. This set of transactions was designed for Utah to acquire Bass' G League rights. He's expected to play for Salt Lake City during this upcoming G League season.</p>",
                "pubDate": "Sat, 17 Sep 2022 09:23:02 EDT",
                "guid": "https://basketball.realgm.com/wiretap/268646/Jazz-Waive-Xavier-Sneed-Paris-Bass",
                "thumbnail": {
                   "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/nba_utahjazz.jpg"
                }
             },
             {
                "title": "Bucks Sign And Waive Rob Edwards",
                "link": "https://basketball.realgm.com/wiretap/268647/Bucks-Sign-And-Waive-Rob-Edwards",
                "description": "<p>The Milwaukee Bucks have signed and waived guard Rob Edwards. This set of transactions was designed to get Edwards' G League rights for the Wisconsin Herd.</p>\n<p>Edwards appeared in two NBA games for the Oklahoma City Thunder last season while on a hardship callup. In 32 G League games for the Oklahoma City Blue, Edwards averaged 13.3 points. The Arizona State product also averaged 4.4 rebounds per game.</p>",
                "pubDate": "Sat, 17 Sep 2022 09:31:05 EDT",
                "guid": "https://basketball.realgm.com/wiretap/268647/Bucks-Sign-And-Waive-Rob-Edwards",
                "thumbnail": {
                   "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/nba_milwaukeebucks.jpg"
                }
             },
             {
                "title": "David Duke Jr. Re-Signs With Nets On Two-Way Contract",
                "link": "https://basketball.realgm.com/wiretap/268637/David-Duke-Jr-Re-Signs-With-Nets-On-Two-Way-Contract",
                "description": "<p>The Brooklyn Nets have re-signed David Duke Jr. to a Two-Way contract.</p>\n<p>Duke appeared in 22 games last season with the Nets, averaging 4.7 points and 3.1 rebounds in 15.5 minutes.</p>\n<p><a href=\"https://basketball.realgm.com/player/David-Duke/Summary/119514#D-League\">Duke also played in 13 G League games</a>, averaging 16.2 points, 6.3 rebounds and 3.1 assists in 29.5 minutes.</p>",
                "pubDate": "Fri, 16 Sep 2022 10:07:07 EDT",
                "guid": "https://basketball.realgm.com/wiretap/268637/David-Duke-Jr-Re-Signs-With-Nets-On-Two-Way-Contract",
                "thumbnail": {
                   "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/nba_brooklynnets.jpg"
                }
             },
             {
                "title": "Knicks' Front Office Hierarchy Considered Confusing By League Sources",
                "link": "https://basketball.realgm.com/wiretap/268639/Knicks-Front-Office-Hierarchy-Considered-Confusing-By-League-Sources",
                "description": "<p>The front office hierarchy of the New York Knicks under Leon Rose has been considered confusing by many league sources who spoke with <a href=\"https://nypost.com/2022/09/15/how-the-knicks-fumbled-its-long-pursuit-of-donovan-mitchell/\">Marc Berman of the New York Post</a>. The confusion of who is in charge can get amplified during trade talks, which is why Rose put Gersson Rosas as the point man to communicate with Justin Zanik of the Utah Jazz on a Donovan Mitchell trade.</p>\n<p>In addition to Rose and Rosas, the Knicks also have William Wesley, Brock Aller and Scott Perry in influential roles.</p>\n<p>\"Leon delegates too much - delegates to a fault,\" one coaching source said. \"They had a breakaway layup and blew it.\"</p>\n<p>The Knicks have also been inactive during each of the past two trade deadlines. </p>\n<p>People around the league say Tom Thibodeau was disheartened when the Knicks were unable to trade for Mitchell. </p>",
                "pubDate": "Fri, 16 Sep 2022 10:49:59 EDT",
                "guid": "https://basketball.realgm.com/wiretap/268639/Knicks-Front-Office-Hierarchy-Considered-Confusing-By-League-Sources",
                "thumbnail": {
                   "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Rose_Leon_nyk_200304.jpg"
                }
             },
             {
                "title": "Nets Sign Chris Chiozza",
                "link": "https://basketball.realgm.com/wiretap/268638/Nets-Sign-Chris-Chiozza",
                "description": "<p>The Brooklyn Nets have signed free agent guard Chris Chiozza. </p>\n<p>Chiozza (5'11\", 179) has seen action in 91 career NBA games (four starts) across four seasons with Golden State (2021-22), Brooklyn (2020, 2020-21), Washington (2019) and Houston (2019), averaging 3.3 points, 1.3 rebounds and 2.4 assists in 11.4 minutes per game. The Memphis, Tenn., native returns to the Nets after spending the 2021-22 season with the Warriors, appearing in 34 games (one start) with the 2022 NBA champions and averaging 2.0 points, 1.1 rebounds and 1.9 assists in 10.9 minutes per contest. In 40 games (three starts) over his two seasons in Brooklyn, Chiozza posted averages of 5.1 points, 1.6 rebounds and 3.0 assists in 12.8 minutes per game while shooting 39.2 percent from the field, 44.8 percent from 3-point range and 81.8 percent from the free-throw line. He also appeared in and started 10 games with the Long Island Nets, Brooklyn's NBA G League affiliate, during the 2019-20 season and has appeared in 70 career NBA G League games (68 starts) across three seasons with Santa Cruz, Long Island, Capital City and Rio Grande Valley, registering averages of 13.0 points, 4.8 rebounds, 7.5 assists and 2.0 steals in 33.1 minutes per contest.</p>",
                "pubDate": "Fri, 16 Sep 2022 10:33:24 EDT",
                "guid": "https://basketball.realgm.com/wiretap/268638/Nets-Sign-Chris-Chiozza",
                "thumbnail": {
                   "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/nba_brooklynnets.jpg"
                }
             },
             {
                "title": "Javonte Smart, Pelicans Agree To Exhibit 10 Deal",
                "link": "https://basketball.realgm.com/wiretap/268636/Javonte-Smart-Pelicans-Agree-To-Exhibit-10-Deal",
                "description": "<p>The New Orleans Pelicans have agreed to sign Javonte Smart to an Exhibit 10 deal.</p>\n<p>Smart spent last season on Two-Way contracts with the Milwaukee Bucks and Miami Heat.</p>\n<p>Smart went undrafted in 2021 out of LSU.</p>",
                "pubDate": "Fri, 16 Sep 2022 10:03:11 EDT",
                "guid": "https://basketball.realgm.com/wiretap/268636/Javonte-Smart-Pelicans-Agree-To-Exhibit-10-Deal",
                "thumbnail": {
                   "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/nba_neworleanspelicans.jpg"
                }
             },
             {
                "title": "Hawks To Sign Malik Ellison To Camp Deal",
                "link": "https://basketball.realgm.com/wiretap/268635/Hawks-To-Sign-Malik-Ellison-To-Camp-Deal",
                "description": "<p>The Atlanta Hawks are set to sign Malik Ellison. It's expected that Ellison will sign a non-guaranteed training camp deal with Atlanta.</p>\n<p>The 6-foot-6 wing was with the Hawks last season on a hardship callup, but did not appear in an NBA game. In 25 G League games with the College Park Skyhawks, Ellison averaged 7.1 points and 4.9 rebounds per game.</p>",
                "pubDate": "Fri, 16 Sep 2022 08:56:22 EDT",
                "guid": "https://basketball.realgm.com/wiretap/268635/Hawks-To-Sign-Malik-Ellison-To-Camp-Deal",
                "thumbnail": {
                   "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/nba_atlantahawks.jpg"
                }
             },
             {
                "title": "NBA, National Basketball Referees Association Agree To New Collective Bargaining Agreement",
                "link": "https://basketball.realgm.com/wiretap/268634/NBA-National-Basketball-Referees-Association-Agree-To-New-Collective-Bargaining-Agreement",
                "description": "<p>The NBA and the National Basketball Referees Association entered a new collective bargaining agreement lasting through the 2028-29 season on Thursday.</p>\n<p>The previous agreement expired at the end of the 2021-22 season.</p>\n<p>The new agreement addressed issues surrounding salary, travel, and pension, and was ratified by the overwhelming majority of refs.</p>\n<p>\"The league has made clear that they value the contributions we make to the game's integrity, and we look forward to a long and prosperous relationship together. We are all excited to start the new season,\" said NBRA board member and veteran official Marc Davis. </p>",
                "pubDate": "Fri, 16 Sep 2022 01:46:49 EDT",
                "guid": "https://basketball.realgm.com/wiretap/268634/NBA-National-Basketball-Referees-Association-Agree-To-New-Collective-Bargaining-Agreement",
                "thumbnail": {
                   "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/nba_realgm.jpg"
                }
             },
             {
                "title": "NBA Grants Suns Minority Owner Sam Garvin Authority To Act As Interim Governor",
                "link": "https://basketball.realgm.com/wiretap/268632/NBA-Grants-Suns-Minority-Owner-Sam-Garvin-Authority-To-Act-As-Interim-Governor",
                "description": "<p>The NBA granted Phoenix Suns vice chairman and minority owner Sam Garvin the authority to act as the team's interim governor during Robert Sarver's year-long suspension, reported Baxter Holmes and Zach Lowe of ESPN.</p>\n<p>Sarver was suspended for <a href=\"https://basketball.realgm.com/wiretap/268607/Robert-Sarver-Suspended-One-Year-Fined-$10M\">one year and fined $10 million</a> following an investigation into toxic workplace issues under his ownership. </p>\n<p>Garvin, who has been a minority owner since 2004, became the team's alternate governor in 2007.</p>\n<p>Sources told ESPN that Sarver would work with the league to appoint an interim governor for the team.</p>\n<p>Sarver also reportedly did not accept the idea that he deserved to be punished and became \"acrimonious\" during the punitive part of the investigation. </p>",
                "pubDate": "Fri, 16 Sep 2022 01:31:44 EDT",
                "guid": "https://basketball.realgm.com/wiretap/268632/NBA-Grants-Suns-Minority-Owner-Sam-Garvin-Authority-To-Act-As-Interim-Governor",
                "thumbnail": {
                   "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/nba_phoenixsuns.jpg"
                }
             },
             {
                "title": "WynnBET Promo Code XREALGM Earns Bet $100, Get $100 In Free Bets Offer",
                "link": "https://basketball.realgm.com/wiretap/268631/WynnBET-Promo-Code-XREALGM-Earns-Bet-$100-Get-$100-In-Free-Bets-Offer",
                "description": "<p>The NFL and college football seasons provide a wide variety of betting options, while the MLB race for the postseason presents it's own unique brand of opportunities. So, if you're a sports bettor looking for a place to get started you may want to try the <strong>WynnBET promo code XREALGM</strong>, which features the Bet $100, Get $100 in free-bet tokens deal for new customers.</p>\n<div class=\"gdcg-oplist\" data-gdcg_rankid=\"1181\"> </div>\n<p>This is one of the only promo codes that is gifting free money to customers whether they win a bet or not. This is a really exciting opportunity to take advantage of as you start your new betting career. Anyone that is 21 years or older can utilize this great offer.</p>\n<p>Once you have placed your first bet and earned your free-bet tokens with our <strong>WynnBET promo code XREALGM</strong>, there is a multitude of opportunities to take advantage of on the app. This is a great time of the year to start betting futures. Future bets allow you to pick who you think will win the championship across multiple sports.</p>\n<h2>WynnBET Promo Code XREALGM: $100 in Free Bets</h2>\n<p>Our<strong> WynnBET promo code XREALGM</strong> is one of the best introductory offers on any of the top <a href=\"https://basketball.realgm.com/wiretap/266131/Best-Sports-Betting-Apps-2022-Legal-Online-Sportsbook-Apps\" target=\"_blank\" rel=\"noopener\">sports betting apps</a>. Here is how to take advantage of our great offer:</p>\n<div class=\"gdcg-oplist\" data-gdcg_rankid=\"1181\"> </div>\n<ul>\n<li>Any new user that is 21 or older can follow our link to the app to get started.</li>\n<li>Then you will have to fill out some quick personal information to set up your account.</li>\n<li>Next, enter our <strong>WynnBET promo code XREALGM</strong> and make an initial deposit of $100 or more.</li>\n<li>Finally, you have to place your first bet at odds of -120 or longer for $100 or more to qualify for the promotion.</li>\n</ul>\n<p>You will then be awarded a $100 free bet within 24 hours of your $100 first wager being settled. This free bet will be added to your account if your $100 qualifying bet wins, loses or pushes.</p>\n<div class=\"gdcg-oplist\" data-gdcg_rankid=\"1181\"> </div>\n<h2>Other WynnBET Features</h2>\n<p>There are plenty of great features to explore on the WynnBET app to try out once you have placed your first bet. Of all the sports betting sites, this operator has some of the best daily odds boosts.</p>\n<p>Their experts pick out different combinations of bets from the biggest events of the day and boost their odds to increase your payout. You can also start betting on futures which allows you to pick who you think will win the championship across multiple sports.</p>\n<p>The first step is to sign up today using the <strong>WynnBet promo code</strong> offer.</p>\n<div class=\"gdcg-oplist\" data-gdcg_rankid=\"5\"> </div>",
                "pubDate": "Thu, 15 Sep 2022 17:17:38 EDT",
                "guid": "https://basketball.realgm.com/wiretap/268631/WynnBET-Promo-Code-XREALGM-Earns-Bet-$100-Get-$100-In-Free-Bets-Offer",
                "thumbnail": {
                   "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/gdc_wynnbet_generic.jpg"
                }
             },
             {
                "title": "RealGM Radio: Rob Mahoney, Matt Moore On The Southwest Division (2022)",
                "link": "https://basketball.realgm.com/wiretap/268630/RealGM-Radio-Rob-Mahoney-Matt-Moore-On-The-Southwest-Division-2022",
                "description": "<p>Host Danny Leroux (@DannyLeroux), Rob Mahoney of The Ringer (@RobMahoney) and Matt Moore of The Action Network (@HPBasketball) go in-depth on the NBA's Southwest Division.</p>\n<p>They discuss how the Rockets, Pelicans, Spurs, Mavericks and Grizzlies fared in the off-season, including which teams improved and what moves stood out. The three also predict the season to come, including projected finish, breakout players and rookies they are most excited to see. Also, Danny pays tribute to his friend Jonathan Tjarks.</p>\n<p>Subscribe to RealGM Radio on <a href=\"https://podcasts.apple.com/us/podcast/realgm-radio/id325045115\">Apple Podcasts</a> or via the <a href=\"https://realgmradio.libsyn.com/rss\">RSS feed</a>. </p>\n<p><iframe style=\"border: none;\" title=\"Embed Player\" src=\"https://play.libsyn.com/embed/episode/id/24390321/height/192/theme/modern/size/large/thumbnail/yes/custom-color/f36c24/time-start/00:00:00/playlist-height/200/direction/backward/download/yes\" width=\"100%\" height=\"192\" scrolling=\"no\" allowfullscreen=\"allowfullscreen\"></iframe></p>",
                "pubDate": "Thu, 15 Sep 2022 17:01:18 EDT",
                "guid": "https://basketball.realgm.com/wiretap/268630/RealGM-Radio-Rob-Mahoney-Matt-Moore-On-The-Southwest-Division-2022",
                "thumbnail": {
                   "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Doncic_Luka_dal_220226.jpg"
                }
             },
             {
                "title": "FanDuel Promo Code Reintroduces Popular $1000 No Sweat First Bet Offer",
                "link": "https://basketball.realgm.com/wiretap/268628/FanDuel-Promo-Code-Reintroduces-Popular-$1000-No-Sweat-First-Bet-Offer",
                "description": "<p>Sports fans cannot wait for summer to end and the fall to start. The NFL and college football season kicks into high gear, and the MLB season culminates with the postseason. Take advantage of all the football and baseball action by signing up with the <a href=\"https://basketball.realgm.com/betting/sportsbooks/fanduel\" target=\"_blank\" rel=\"noopener\">FanDuel promo code</a> offer and redeeming the $1,000 No Sweat First Bet deal.  </p>\n<div class=\"gdcg-oplist\" data-gdcg_rankid=\"1179\"> </div>\n<p>The <strong>FanDuel promo code</strong> offer protects the first wager after signing up, ensuring reimbursement of up to $1,000 if your qualifying bet doesn't win. The refund is paid out within 72 hours, and bettors have 14 days to reinvest the site credit. The $1,000 No Sweat First Bet welcome offer has a few key advantages, including the straightforward redemption process.</p>\n<p>Click the link on this page, sign up, deposit at least $10, and commit to a qualifying wager. If you prefer accessing picks on <a href=\"https://basketball.realgm.com/wiretap/266131/Best-Sports-Betting-Apps-2022-Legal-Online-Sportsbook-Apps\">sports betting apps</a>, download the FanDuel mobile app and sign up on it instead. The <strong>FanDuel sportsbook promo code</strong> offer is available on the mobile app.  </p>\n<h2>FanDuel Promo Code Has It Factor Bettors Love </h2>\n<p>The $1,000 No Sweat First Bet signup bonus is a risk-free bet similar to several prominent risk-free bets offered by top online sportsbooks. However, one aspect of the <strong>FanDuel promo code </strong>offer makes it a superstar welcome bonus.</p>\n<div class=\"gdcg-oplist\" data-gdcg_rankid=\"1179\"> </div>\n<p>The online sportsbook doesn't require you to invest the site credit on one follow-up bet, instead providing the freedom to make as many bets as you want. For example, say your $500 qualifying bet loses. You can use the $500 on as many bets as you wish, offering ample opportunities to increase your bankroll. Just specify the amount you want to redeem, and lock in the bet.</p>\n<p>The freedom to invest the site credit on an unlimited number of follow-up bets puts even more emphasis on the qualifying wager. The more you deposit and stake, the higher the redemption if your bet loses. Imagine having $1,000 in site credit to use on as many follow-up bets as you like. Remember, you have 14 days to reinvest every dollar of site credit before it expires.</p>\n<h2>FanDuel Promo Code: Refer 10 Friends, Earn $1000 </h2>\n<p>The refer-a-friend <strong>FanDuel promo code</strong> offer does things a little differently than most betting sites. You can earn up to $1,000 by referring 10 friends, though the site credit is split between the online sportsbook and casino. So, you can earn $500 worth of online sportsbook credit and $500 in casino credit if you refer 10 friends.</p>\n<div class=\"gdcg-oplist\" data-gdcg_rankid=\"1179\"> </div>\n<p>In addition, both the referrer and the referred benefit from this offer. Send each friend a referral link, which they must click on to activate the bonus. Both parties receive a $50 online sportsbook free-bet token when the new joiner clicks on the link, signs up, deposits, and wagers at least $10.</p>\n<p>The site credit is deposited into the referred and the referrer's accounts within 72 hours.</p>\n<p>The referred and referrer earn an additional $50 casino token if the new joiner invests at least $10 on any casino game.</p>\n<p>Convince 10 friends to sign up by clicking on your referral links, and you can earn the $1,000 maximum, split evenly between sportsbook and casino credit.</p>\n<div class=\"gdcg-oplist\" data-gdcg_rankid=\"5\"> </div>",
                "pubDate": "Thu, 15 Sep 2022 14:05:53 EDT",
                "guid": "https://basketball.realgm.com/wiretap/268628/FanDuel-Promo-Code-Reintroduces-Popular-$1000-No-Sweat-First-Bet-Offer",
                "thumbnail": {
                   "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/gamb_fanduel_hero_220223.jpg"
                }
             },
             {
                "title": "Caesars Sportsbook Promo Code REALGMFULL Lands $1250 Free Bet And More",
                "link": "https://basketball.realgm.com/wiretap/268627/Caesars-Sportsbook-Promo-Code-REALGMFULL-Lands-$1250-Free-Bet-And-More",
                "description": "<p>Week 1 of the NFL season got off to an exciting start with upsets and close finishes. Meanwhile, MLB teams in contention make one last push to make the playoffs. The transition from summer to fall presents fans with an ideal opportunity to get in on the action. Sign up for the <a href=\"https://basketball.realgm.com/betting/sportsbooks/caesars\" target=\"_blank\" rel=\"noopener\">Caesars Sportsbook promo code</a> REALGMFULL and redeem the up to $1,250 in first-bet insurance.</p>\n<div class=\"gdcg-oplist\" data-gdcg_rankid=\"1177\"> </div>\n<p>Sports betting enhances the experience of watching your favorite sport, especially when you know your first bet is covered should it lose. The Caesars Sportsbook $1,250 free bet guarantees a refund on losing first wagers up to $1,250 within 72 hours. Feel free to swing for the fences with your qualifying wager, as the safety net provided by first-bet insurance ensures a free follow-up pick if you don't win.   </p>\n<p>The second part of the welcome offer is yours whether your first bet wins, loses or is a push. You're guaranteed 1,000 Credit Rewards and 1,000 Tier Credits when you click the link on this page, apply <strong>Caesars Sportsbook promo code REALGMFULL</strong>, deposit and wager at least $10. </p>\n<h2>Caesars Sportsbook Promo Code: Parlay Insurance</h2>\n<p>There are several principal ongoing sportsbook promo codes from the <a href=\"https://basketball.realgm.com/wiretap/266131/Best-Sports-Betting-Apps-2022-Legal-Online-Sportsbook-Apps\" target=\"_blank\" rel=\"noopener\">top sports betting apps</a>, including profit boost and parlay insurance. Caesars Sportsbook offers both routinely, and all you have to do to redeem is join the online sportsbook. Many sports bettors prefer the convenience of sports betting apps, so if you're in that group, download the Caesars Sportsbook mobile app and enter <strong>Caesars Sportsbook promo code REALGMFULL</strong>. </p>\n<div class=\"gdcg-oplist\" data-gdcg_rankid=\"1177\"> </div>\n<p>While Caesars Sportsbook varies its bonuses consistently, it also regularly provides insurance on parlays that come within a whisker of winning. Make a parlay with four or more legs, and the online sportsbook refunds the stake on bets up to $25. The offer is usually on for a couple of days at a time, so keep an eye out. The site credit is deposited into your account no later than two days after the promotion expires. Same game parlays are another bet type Caesars Sportsbook provides insurance on.     </p>\n<p>Profit boosts are also handed out consistently. Sign into your account, and head to the bet slip or bonus drawer to see if any current profit boosts are ongoing. Profit boosts add a percentage of winnings to successful wagers, increasing the overall payout. You can immediately withdraw profit boosts, one of the bonus type's main perks. </p>\n<h2>Refer Friends, Get $1000 With Caesars Sportsbook</h2>\n<p>Caesars Sportsbook's refer-a-friend bonus is one of those rare offers that sound too good to be true but isn't. Like all betting sites, Caesars Sportsbook encourages you to get your friends to create an account, and you can redeem $1,000 just for convincing friends to sign up.</p>\n<div class=\"gdcg-oplist\" data-gdcg_rankid=\"1177\"> </div>\n<p>You must have an account to take part in the refer-a-friend promotion. Remember to apply <strong>Caesars Sportsbook promo code REALGMFULL</strong> during signup, as that promo code ensures access to the $1,250 first-bet insurance. </p>\n<p>Each referral is worth a $100 free-bet token, and you can refer up to 10 friends, all of whom must be in the same state. Once you send each friend a referral link, the ball is in their court. They must click on the link, sign up, deposit, and make a qualifying wager of at least $50. After those steps are confirmed, you'll receive the $100 free-bet token within seven days. </p>\n<p>You have 30 days to use the site credit as the stake on a subsequent bet. Be an even better friend and tell your referrals about the advantage of applying <strong>Caesars Sportsbook promo code REALGMFULL</strong> during signup. That way, your friends won't be left out in the cold and will have access to the $1,250 free bet welcome bonus. </p>\n<div class=\"gdcg-oplist\" data-gdcg_rankid=\"5\"> </div>",
                "pubDate": "Thu, 15 Sep 2022 11:56:33 EDT",
                "guid": "https://basketball.realgm.com/wiretap/268627/Caesars-Sportsbook-Promo-Code-REALGMFULL-Lands-$1250-Free-Bet-And-More",
                "thumbnail": {
                   "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/gdc-caesars-new-hero.jpg"
                }
             },
             {
                "title": "Keifer Sykes, Pistons Sign Exhibit 10 Deal",
                "link": "https://basketball.realgm.com/wiretap/268626/Keifer-Sykes-Pistons-Sign-Exhibit-10-Deal",
                "description": "<p>The Detroit Pistons have signed Keifer Sykes to an Exhibit 10 deal.</p>\n<p>Sykes appeared in 32 games last season with the Pacers, averaging 5.6 points, 1.4 rebounds and 1.9 assists in 17.7 minutes.</p>\n<p>Sykes, who went undrafted out of Green Bay in 2015, had largely played overseas before his NBA debut last season.</p>",
                "pubDate": "Thu, 15 Sep 2022 10:27:31 EDT",
                "guid": "https://basketball.realgm.com/wiretap/268626/Keifer-Sykes-Pistons-Sign-Exhibit-10-Deal",
                "thumbnail": {
                   "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/nba_detroitpistons.jpg"
                }
             },
             {
                "title": "Damian Lillard: I Do Plan On Being A Trail Blazer For Life",
                "link": "https://basketball.realgm.com/wiretap/268625/Damian-Lillard-I-Do-Plan-On-Being-A-Trail-Blazer-For-Life",
                "description": "<p>While on The Dave Pasch Podcast, Damian Lillard was asked about his future with the Portland Trail Blazers. Lillard was clear when asked if he hopes to be with Portland for his entire career.</p>\n<p>\"Yes, I do (plan on being a Blazer for life),\" Lillard said. \"I've had my share of people saying 'Man, you got to get out of there! You've got to do this; you've got do to that.' But I'm the type of person that I'm never going to be marching to the beat of nobody else's drum.\"</p>\n<p>Lillard went on to say he follows his heart. He added that he's loyal to the Trail Blazers organization.</p>\n<p>\"I'm gonna always do what I feel like is in my best interest and that I really feel in my heart,\" Lillard said. \"I've said this on many different occasions, they call it 'He's being loyal!' and 'Loyalty this, loyalty that' and I'm like, I'm naturally a loyal person but I do have a level of loyalty to the organization. But this loyalty that they're talking about is ultimately to who I am as a person. I'm being loyal to who I am and not getting beside myself because I'm somebody that, I believe what I believe.\"</p>\n<p>Lillard said he knows many think he needs to leave Portland to win a championship. But he believes that he can win at the highest levels with the Trail Blazers.</p>\n<p>\"I think I can get it done. Now, everybody else might say 'There's no way the Blazers will ever win. They need to do this, they need to do that.' But that's just not how I feel about the situation,\" Lillard said. \"I feel like we'll have a chance to win, I feel like that moment is going to come, I feel like that opportunity is going to come. And that's that.\"</p>",
                "pubDate": "Thu, 15 Sep 2022 09:37:36 EDT",
                "guid": "https://basketball.realgm.com/wiretap/268625/Damian-Lillard-I-Do-Plan-On-Being-A-Trail-Blazer-For-Life",
                "thumbnail": {
                   "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Lillard_Damian_por_210629.jpg"
                }
             },
             {
                "title": "Lakers, Jazz Talking Bojan Bogdanovic Trade",
                "link": "https://basketball.realgm.com/wiretap/268624/Lakers-Jazz-Talking-Bojan-Bogdanovic-Trade",
                "description": "<p>After trading Rudy Gobert and Donovan Mitchell, the Utah Jazz are exploring the trade market for the remaining veterans on their roster. Utah has talked trades with rival teams involving Bojan Bogdanovic, Mike Conley, Jordan Clarkson, Rudy Gay and Malik Beasley.</p>\n<p>In particular, the Jazz have held ongoing talks with the Los Angeles Lakers surrounding Bojan Bogdanovic. The veteran forward averaged 18.1 points on 45/39/86 shooting splits a season ago.</p>\n<p>Utah and Los Angeles have already linked up for one deal this offseason. The Lakers sent Talen Horton-Tucker and Stanley Johnson to the Jazz in exchange for Patrick Beverley. Landing Bogdanovic would go a long way towards adding depth to the Lakers rotation.</p>\n<p>The challenge is Los Angeles may find it difficult to match salary in a trade for Bogdanovic. In part, that may be why Utah isn't close to trading Bogdanovic at this time.</p>",
                "pubDate": "Thu, 15 Sep 2022 08:59:45 EDT",
                "guid": "https://basketball.realgm.com/wiretap/268624/Lakers-Jazz-Talking-Bojan-Bogdanovic-Trade",
                "thumbnail": {
                   "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Bogdanovic_Bojan_uta_200518.jpg"
                }
             },
             {
                "title": "Celtics Sign Justin Jackson, Jake Layman, Denzel Valentine",
                "link": "https://basketball.realgm.com/wiretap/268623/Celtics-Sign-Justin-Jackson-Jake-Layman-Denzel-Valentine",
                "description": "<p>The Boston Celtics have signed Justin Jackson, Jake Layman and Denzel Valentine. All three are expected to have signed non-guaranteed, training camp contracts.</p>\n<p>Jackson appeared in seven NBA games between the Celtics and Phoenix Suns last season. Jackson also played in 28 games for the Texas Legends of the G League. Jackson averaged 22.2 points, 6.7 rebounds and 3.4 assists for the Legends.</p>\n<p>Layman spent the last three seasons with the Minnesota Timberwolves. The Massachusetts native averaged 2.4 points in 6.8 minutes per game last season. Layman also played for the Portland Trail Blazers for three seasons.</p>\n<p>Valentine played in 24 NBA games with the Cleveland Cavaliers and Utah Jazz. The veteran wing also played in 12 games for the Maine Celtics of the G League. Valentine averaged 14.6 points, 10.3 rebounds and 7.0 assists per game in the G League.</p>",
                "pubDate": "Thu, 15 Sep 2022 08:37:05 EDT",
                "guid": "https://basketball.realgm.com/wiretap/268623/Celtics-Sign-Justin-Jackson-Jake-Layman-Denzel-Valentine",
                "thumbnail": {
                   "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/nba_bostonceltics.jpg"
                }
             },
             {
                "title": "Donovan Mitchell 'Thought For Sure' He Was Getting Traded To Knicks",
                "link": "https://basketball.realgm.com/wiretap/268622/Donovan-Mitchell-Thought-For-Sure-He-Was-Getting-Traded-To-Knicks",
                "description": "<p>Donovan Mitchell admitted that he thought he'd get traded to the New York Knicks during his introductory press conference with the Cleveland Cavaliers.</p>\n<p>\"I thought for sure I was going back home, I'm not gonna lie about that.</p>\n<p>\"But when I found out where I was headed, who I was playing with, the group, the team, the coaching staff, I couldn't be more happier to be here,\" said Mitchell.</p>\n<p>Mitchell also added that he was surprised when he found out he was getting traded to the Cavs.</p>\n<p>\"Honestly, I had no idea. My agent AB (Austin Brown) called me on Wednesday and he said you're going to Cleveland and, like I said, my reaction was what it was,\" said Mitchell.</p>\n<p>Mitchell would express his excitement of partnering with the Cavs' young core, adding \"to join these phenomenal guys and add to it, I think that, for me, is what I'm truly excited about.\"</p>\n<p> </p>",
                "pubDate": "Thu, 15 Sep 2022 00:59:38 EDT",
                "guid": "https://basketball.realgm.com/wiretap/268622/Donovan-Mitchell-Thought-For-Sure-He-Was-Getting-Traded-To-Knicks",
                "thumbnail": {
                   "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Mitchell_Donovan_uta_220726.jpg"
                }
             },
             {
                "title": "Joe Harris Expected To Be 100% For Nets Training Camp",
                "link": "https://basketball.realgm.com/wiretap/268621/Joe-Harris-Expected-To-Be-100-perc-For-Nets-Training-Camp",
                "description": "<p>Joe Harris is expected to be fully healed in time for Brooklyn Nets training camp, his agent Mark Bartelstein told ESPN.</p>\n<p>\"He's doing great. Feeling great, ready to roll,\" said Bartelstein.</p>\n<p>Harris had ankle surgery in late November last season, then underwent another procedure in March.</p>\n<p>The 31-year-old Harris averaged 11.6 points in 14 games last season. </p>",
                "pubDate": "Thu, 15 Sep 2022 00:39:36 EDT",
                "guid": "https://basketball.realgm.com/wiretap/268621/Joe-Harris-Expected-To-Be-100-perc-For-Nets-Training-Camp",
                "thumbnail": {
                   "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Harris_Joe_bkn_211129.jpg"
                }
             },
             {
                "title": "NBA Initiated Tampering Investigation On 76ers, Knicks With Findings Expected Within Weeks",
                "link": "https://basketball.realgm.com/wiretap/268620/NBA-Initiated-Tampering-Investigation-On-76ers-Knicks-With-Findings-Expected-Within-Weeks",
                "description": "<p>The NBA initiated its investigations on potential tampering conducted this offseason by the Philadelphia 76ers and New York Knicks as it was not based on a complaint from a team.</p>\n<p>\"The statuses of those investigations are ongoing. Hopefully they'll be wrapped up in the next few weeks,\" said Adam Silver.</p>\n<p>\"I think what prompted them was sort of just the tick-tock chronology around sort of when signings are permissible and the announcements of those signings and the information that came out about them, which was cause for the league office to investigate.\"</p>\n<p>Last year, the Miami Heat and Chicago Bulls were each forced to forfeit a second round pick due to tampering charges. </p>",
                "pubDate": "Wed, 14 Sep 2022 22:01:40 EDT",
                "guid": "https://basketball.realgm.com/wiretap/268620/NBA-Initiated-Tampering-Investigation-On-76ers-Knicks-With-Findings-Expected-Within-Weeks",
                "thumbnail": {
                   "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Brunson_Jalen_dal_220517.jpg"
                }
             },
             {
                "title": "LeBron James, Chris Paul Denounce NBA's Sanction Of Robert Sarver As Falling Short",
                "link": "https://basketball.realgm.com/wiretap/268619/LeBron-James-Chris-Paul-Denounce-NBAs-Sanction-Of-Robert-Sarver-As-Falling-Short",
                "description": "<p>LeBron James and Chris Paul were amongst the players to speak out about the NBA's decision to suspend Robert Server for one year.</p>\n<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Read through the Sarver stories a few times now. I gotta be honest...Our league definitely got this wrong. I don't need to explain why. Y'all read the stories and decide for yourself. I said it before and I'm gonna say it again, there is no place in this league for that kind of</p>\n- LeBron James (@KingJames) <a href=\"https://twitter.com/KingJames/status/1570184134827573248?ref_src=twsrc%5Etfw\">September 14, 2022</a></blockquote>\n<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">behavior. I love this league and I deeply respect our leadership. But this isn't right. There is no place for misogyny, sexism, and racism in any work place. Don't matter if you own the team or play for the team. We hold our league up as an example of our values and this aint it.</p>\n- LeBron James (@KingJames) <a href=\"https://twitter.com/KingJames/status/1570184138010812416?ref_src=twsrc%5Etfw\">September 14, 2022</a></blockquote>\n<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Like many others, I reviewed the report. I was and am horrified and disappointed by what I read. This conduct especially towards women is unacceptable and must never be repeated.</p>\n- Chris Paul (@CP3) <a href=\"https://twitter.com/CP3/status/1570220416224075779?ref_src=twsrc%5Etfw\">September 15, 2022</a></blockquote>\n<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">I am of the view that the sanctions fell short in truly addressing what we can all agree was atrocious behavior. My heart goes out to all of the people that were affected.</p>\n- Chris Paul (@CP3) <a href=\"https://twitter.com/CP3/status/1570220418191228928?ref_src=twsrc%5Etfw\">September 15, 2022</a></blockquote>",
                "pubDate": "Wed, 14 Sep 2022 21:39:49 EDT",
                "guid": "https://basketball.realgm.com/wiretap/268619/LeBron-James-Chris-Paul-Denounce-NBAs-Sanction-Of-Robert-Sarver-As-Falling-Short",
                "thumbnail": {
                   "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/James_LeBron_lal_220208.jpg"
                }
             },
             {
                "title": "Jazz Sign Paris Bass To Exhibit 10 Deal",
                "link": "https://basketball.realgm.com/wiretap/268618/Jazz-Sign-Paris-Bass-To-Exhibit-10-Deal",
                "description": "<p>The Utah Jazz have signed forward Paris Bass. </p>\n<p>Bass (6-8, 200, Detroit-Mercy) joins the Jazz after most recently spending the 2021-22 season with the Phoenix Suns and the South Bay Lakers of the NBA G League. With the Suns, he appeared in two games, averaging 3.0 points and 2.0 rebounds in 3.5 minutes per contest and with South Bay posted averages of 17.4 points, 7.0 boards, 1.7 assists, and 1.4 steals in 26 games (one start).</p>\n<p>The native of Birmingham, Mich., has additional professional experience playing in the BSN of Puerto Rico with Atleticos de San German in 2019-20 and 2020-21. During the 2020-21 season, he posted averages of 22.9 points on 50.1 percent from the field, along with 9.4 rebounds, 4.8 assists, and 1.3 steals in 34.4 minutes per contest. During the 2016-17 season, he competed for the Erie BayHawks of the G League, appearing in 15 games, and averaging 3.9 points and 2.7 rebounds.</p>",
                "pubDate": "Wed, 14 Sep 2022 21:35:25 EDT",
                "guid": "https://basketball.realgm.com/wiretap/268618/Jazz-Sign-Paris-Bass-To-Exhibit-10-Deal",
                "thumbnail": {
                   "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/nba_utahjazz.jpg"
                }
             },
             {
                "title": "Get Your Latest NBA News From RealGM's Basketball Wiretap",
                "link": "https://basketball.realgm.com/news",
                "description": "Get all the latest news and happenings from around the NBA with RealGM's Basketball Wiretap.",
                "pubDate": "Sat, 17 Sep 2022 11:17:02 EDT",
                "guid": "https://basketball.realgm.com/news"
             }
          ]
       },
       "_xmlns:media": "http://search.yahoo.com/mrss/",
       "_version": "2.0"
    }
 }