{
    "rss": {
       "channel": {
          "title": "RealGM Basketball Wiretap",
          "link": "https://basketball.realgm.com/news",
          "description": "Basketball News, Rumors, Scores, Stats, Analysis, Depth Charts, Forums",
          "language": "en-us",
          "pubDate": "Fri, 16 Sep 2022 11:17:01 EDT",
          "lastBuildDate": "Fri, 16 Sep 2022 11:17:01 EDT",
          "item": [
             {
                "title": "Suns' Minority Owner Jahm Najafi Calls For Robert Sarver's Resignation",
                "link": "https://basketball.realgm.com/wiretap/268633/Suns-Minority-Owner-Jahm-Najafi-Calls-For-Robert-Sarvers-Resignation",
                "description": "<p>Phoenix Suns vice chairman and minority owner Jahm Najafi called for Robert Sarver's resignation in an open letter to team employees on Thursday night.</p>\n<p>Najafi is the second-largest stakeholder in the team.</p>\n<p>\"I cannot in good judgment sit back and allow our children and future generations of fans to think that this behavior is tolerated because of wealth and privilege. Therefore, in accordance with my commitment to helping eradicate any form of racism, sexism and bias, as Vice Chairman of the Phoenix Suns, I am calling for the resignation of Robert Sarver,\" wrote Najafi in the letter.</p>\n<p>Najafi added that he had no interest in becoming the managing partner of the team. </p>\n<p>Sarver was suspended for <a href=\"https://basketball.realgm.com/wiretap/268607/Robert-Sarver-Suspended-One-Year-Fined-$10M\">one year and fined $10 million</a> following an investigation into toxic workplace issues under his ownership. </p>\n<p>The league granted minority owner Sam Garvin <a href=\"https://basketball.realgm.com/wiretap/268632/NBA-Grants-Suns-Minority-Owner-Sam-Garvin-Authority-To-Act-As-Interim-Governor\">the authority to act as interim governor</a>. </p>",
                "pubDate": "Fri, 16 Sep 2022 01:41:04 EDT",
                "guid": "https://basketball.realgm.com/wiretap/268633/Suns-Minority-Owner-Jahm-Najafi-Calls-For-Robert-Sarvers-Resignation",
                "thumbnail": {
                   "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/nba_phoenixsuns.jpg"
                }
             },
             {
                "title": "David Duke Jr. Re-Signs With Nets On Two-Way Contract",
                "link": "https://basketball.realgm.com/wiretap/268637/David-Duke-Jr-Re-Signs-With-Nets-On-Two-Way-Contract",
                "description": "<p>The Brooklyn Nets have re-signed David Duke Jr. to a Two-Way contract.</p>\n<p>Duke appeared in 22 games last season with the Nets, averaging 4.7 points and 3.1 rebounds in 15.5 minutes.</p>\n<p><a href=\"https://basketball.realgm.com/player/David-Duke/Summary/119514#D-League\">Duke also played in 13 G League games</a>, averaging 16.2 points, 6.3 rebounds and 3.1 assists in 29.5 minutes.</p>",
                "pubDate": "Fri, 16 Sep 2022 10:07:07 EDT",
                "guid": "https://basketball.realgm.com/wiretap/268637/David-Duke-Jr-Re-Signs-With-Nets-On-Two-Way-Contract",
                "thumbnail": {
                   "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/nba_brooklynnets.jpg"
                }
             },
             {
                "title": "NBA Grants Suns Minority Owner Sam Garvin Authority To Act As Interim Governor",
                "link": "https://basketball.realgm.com/wiretap/268632/NBA-Grants-Suns-Minority-Owner-Sam-Garvin-Authority-To-Act-As-Interim-Governor",
                "description": "<p>The NBA granted Phoenix Suns vice chairman and minority owner Sam Garvin the authority to act as the team's interim governor during Robert Sarver's year-long suspension, reported Baxter Holmes and Zach Lowe of ESPN.</p>\n<p>Sarver was suspended for <a href=\"https://basketball.realgm.com/wiretap/268607/Robert-Sarver-Suspended-One-Year-Fined-$10M\">one year and fined $10 million</a> following an investigation into toxic workplace issues under his ownership. </p>\n<p>Garvin, who has been a minority owner since 2004, became the team's alternate governor in 2007.</p>\n<p>Sources told ESPN that Sarver would work with the league to appoint an interim governor for the team.</p>\n<p>Sarver also reportedly did not accept the idea that he deserved to be punished and became \"acrimonious\" during the punitive part of the investigation. </p>",
                "pubDate": "Fri, 16 Sep 2022 01:31:44 EDT",
                "guid": "https://basketball.realgm.com/wiretap/268632/NBA-Grants-Suns-Minority-Owner-Sam-Garvin-Authority-To-Act-As-Interim-Governor",
                "thumbnail": {
                   "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/nba_phoenixsuns.jpg"
                }
             },
             {
                "title": "Knicks' Front Office Hierarchy Considered Confusing By League Sources",
                "link": "https://basketball.realgm.com/wiretap/268639/Knicks-Front-Office-Hierarchy-Considered-Confusing-By-League-Sources",
                "description": "<p>The front office hierarchy of the New York Knicks under Leon Rose has been considered confusing by many league sources who spoke with <a href=\"https://nypost.com/2022/09/15/how-the-knicks-fumbled-its-long-pursuit-of-donovan-mitchell/\">Marc Berman of the New York Post</a>. The confusion of who is in charge can get amplified during trade talks, which is why Rose put Gersson Rosas as the point man to communicate with Justin Zanik of the Utah Jazz on a Donovan Mitchell trade.</p>\n<p>In addition to Rose and Rosas, the Knicks also have William Wesley, Brock Aller and Scott Perry in influential roles.</p>\n<p>\"Leon delegates too much - delegates to a fault,\" one coaching source said. \"They had a breakaway layup and blew it.\"</p>\n<p>The Knicks have also been inactive during each of the past two trade deadlines. </p>\n<p>People around the league say Tom Thibodeau was disheartened when the Knicks were unable to trade for Mitchell. </p>",
                "pubDate": "Fri, 16 Sep 2022 10:49:59 EDT",
                "guid": "https://basketball.realgm.com/wiretap/268639/Knicks-Front-Office-Hierarchy-Considered-Confusing-By-League-Sources",
                "thumbnail": {
                   "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Rose_Leon_nyk_200304.jpg"
                }
             },
             {
                "title": "RealGM Radio: Rob Mahoney, Matt Moore On The Southwest Division (2022)",
                "link": "https://basketball.realgm.com/wiretap/268630/RealGM-Radio-Rob-Mahoney-Matt-Moore-On-The-Southwest-Division-2022",
                "description": "<p>Host Danny Leroux (@DannyLeroux), Rob Mahoney of The Ringer (@RobMahoney) and Matt Moore of The Action Network (@HPBasketball) go in-depth on the NBA's Southwest Division.</p>\n<p>They discuss how the Rockets, Pelicans, Spurs, Mavericks and Grizzlies fared in the off-season, including which teams improved and what moves stood out. The three also predict the season to come, including projected finish, breakout players and rookies they are most excited to see. Also, Danny pays tribute to his friend Jonathan Tjarks.</p>\n<p>Subscribe to RealGM Radio on <a href=\"https://podcasts.apple.com/us/podcast/realgm-radio/id325045115\">Apple Podcasts</a> or via the <a href=\"https://realgmradio.libsyn.com/rss\">RSS feed</a>. </p>\n<p><iframe style=\"border: none;\" title=\"Embed Player\" src=\"https://play.libsyn.com/embed/episode/id/24390321/height/192/theme/modern/size/large/thumbnail/yes/custom-color/f36c24/time-start/00:00:00/playlist-height/200/direction/backward/download/yes\" width=\"100%\" height=\"192\" scrolling=\"no\" allowfullscreen=\"allowfullscreen\"></iframe></p>",
                "pubDate": "Thu, 15 Sep 2022 17:01:18 EDT",
                "guid": "https://basketball.realgm.com/wiretap/268630/RealGM-Radio-Rob-Mahoney-Matt-Moore-On-The-Southwest-Division-2022",
                "thumbnail": {
                   "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Doncic_Luka_dal_220226.jpg"
                }
             },
             {
                "title": "Nets Sign Chris Chiozza",
                "link": "https://basketball.realgm.com/wiretap/268638/Nets-Sign-Chris-Chiozza",
                "description": "<p>The Brooklyn Nets have signed free agent guard Chris Chiozza. </p>\n<p>Chiozza (5'11\", 179) has seen action in 91 career NBA games (four starts) across four seasons with Golden State (2021-22), Brooklyn (2020, 2020-21), Washington (2019) and Houston (2019), averaging 3.3 points, 1.3 rebounds and 2.4 assists in 11.4 minutes per game. The Memphis, Tenn., native returns to the Nets after spending the 2021-22 season with the Warriors, appearing in 34 games (one start) with the 2022 NBA champions and averaging 2.0 points, 1.1 rebounds and 1.9 assists in 10.9 minutes per contest. In 40 games (three starts) over his two seasons in Brooklyn, Chiozza posted averages of 5.1 points, 1.6 rebounds and 3.0 assists in 12.8 minutes per game while shooting 39.2 percent from the field, 44.8 percent from 3-point range and 81.8 percent from the free-throw line. He also appeared in and started 10 games with the Long Island Nets, Brooklyn's NBA G League affiliate, during the 2019-20 season and has appeared in 70 career NBA G League games (68 starts) across three seasons with Santa Cruz, Long Island, Capital City and Rio Grande Valley, registering averages of 13.0 points, 4.8 rebounds, 7.5 assists and 2.0 steals in 33.1 minutes per contest.</p>",
                "pubDate": "Fri, 16 Sep 2022 10:33:24 EDT",
                "guid": "https://basketball.realgm.com/wiretap/268638/Nets-Sign-Chris-Chiozza",
                "thumbnail": {
                   "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/nba_brooklynnets.jpg"
                }
             },
             {
                "title": "Javonte Smart, Pelicans Agree To Exhibit 10 Deal",
                "link": "https://basketball.realgm.com/wiretap/268636/Javonte-Smart-Pelicans-Agree-To-Exhibit-10-Deal",
                "description": "<p>The New Orleans Pelicans have agreed to sign Javonte Smart to an Exhibit 10 deal.</p>\n<p>Smart spent last season on Two-Way contracts with the Milwaukee Bucks and Miami Heat.</p>\n<p>Smart went undrafted in 2021 out of LSU.</p>",
                "pubDate": "Fri, 16 Sep 2022 10:03:11 EDT",
                "guid": "https://basketball.realgm.com/wiretap/268636/Javonte-Smart-Pelicans-Agree-To-Exhibit-10-Deal",
                "thumbnail": {
                   "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/nba_neworleanspelicans.jpg"
                }
             },
             {
                "title": "Hawks To Sign Malik Ellison To Camp Deal",
                "link": "https://basketball.realgm.com/wiretap/268635/Hawks-To-Sign-Malik-Ellison-To-Camp-Deal",
                "description": "<p>The Atlanta Hawks are set to sign Malik Ellison. It's expected that Ellison will sign a non-guaranteed training camp deal with Atlanta.</p>\n<p>The 6-foot-6 wing was with the Hawks last season on a hardship callup, but did not appear in an NBA game. In 25 G League games with the College Park Skyhawks, Ellison averaged 7.1 points and 4.9 rebounds per game.</p>",
                "pubDate": "Fri, 16 Sep 2022 08:56:22 EDT",
                "guid": "https://basketball.realgm.com/wiretap/268635/Hawks-To-Sign-Malik-Ellison-To-Camp-Deal",
                "thumbnail": {
                   "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/nba_atlantahawks.jpg"
                }
             },
             {
                "title": "Damian Lillard: I Do Plan On Being A Trail Blazer For Life",
                "link": "https://basketball.realgm.com/wiretap/268625/Damian-Lillard-I-Do-Plan-On-Being-A-Trail-Blazer-For-Life",
                "description": "<p>While on The Dave Pasch Podcast, Damian Lillard was asked about his future with the Portland Trail Blazers. Lillard was clear when asked if he hopes to be with Portland for his entire career.</p>\n<p>\"Yes, I do (plan on being a Blazer for life),\" Lillard said. \"I've had my share of people saying 'Man, you got to get out of there! You've got to do this; you've got do to that.' But I'm the type of person that I'm never going to be marching to the beat of nobody else's drum.\"</p>\n<p>Lillard went on to say he follows his heart. He added that he's loyal to the Trail Blazers organization.</p>\n<p>\"I'm gonna always do what I feel like is in my best interest and that I really feel in my heart,\" Lillard said. \"I've said this on many different occasions, they call it 'He's being loyal!' and 'Loyalty this, loyalty that' and I'm like, I'm naturally a loyal person but I do have a level of loyalty to the organization. But this loyalty that they're talking about is ultimately to who I am as a person. I'm being loyal to who I am and not getting beside myself because I'm somebody that, I believe what I believe.\"</p>\n<p>Lillard said he knows many think he needs to leave Portland to win a championship. But he believes that he can win at the highest levels with the Trail Blazers.</p>\n<p>\"I think I can get it done. Now, everybody else might say 'There's no way the Blazers will ever win. They need to do this, they need to do that.' But that's just not how I feel about the situation,\" Lillard said. \"I feel like we'll have a chance to win, I feel like that moment is going to come, I feel like that opportunity is going to come. And that's that.\"</p>",
                "pubDate": "Thu, 15 Sep 2022 09:37:36 EDT",
                "guid": "https://basketball.realgm.com/wiretap/268625/Damian-Lillard-I-Do-Plan-On-Being-A-Trail-Blazer-For-Life",
                "thumbnail": {
                   "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Lillard_Damian_por_210629.jpg"
                }
             },
             {
                "title": "NBA, National Basketball Referees Association Agree To New Collective Bargaining Agreement",
                "link": "https://basketball.realgm.com/wiretap/268634/NBA-National-Basketball-Referees-Association-Agree-To-New-Collective-Bargaining-Agreement",
                "description": "<p>The NBA and the National Basketball Referees Association entered a new collective bargaining agreement lasting through the 2028-29 season on Thursday.</p>\n<p>The previous agreement expired at the end of the 2021-22 season.</p>\n<p>The new agreement addressed issues surrounding salary, travel, and pension, and was ratified by the overwhelming majority of refs.</p>\n<p>\"The league has made clear that they value the contributions we make to the game's integrity, and we look forward to a long and prosperous relationship together. We are all excited to start the new season,\" said NBRA board member and veteran official Marc Davis. </p>",
                "pubDate": "Fri, 16 Sep 2022 01:46:49 EDT",
                "guid": "https://basketball.realgm.com/wiretap/268634/NBA-National-Basketball-Referees-Association-Agree-To-New-Collective-Bargaining-Agreement",
                "thumbnail": {
                   "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/nba_realgm.jpg"
                }
             },
             {
                "title": "Lakers, Jazz Talking Bojan Bogdanovic Trade",
                "link": "https://basketball.realgm.com/wiretap/268624/Lakers-Jazz-Talking-Bojan-Bogdanovic-Trade",
                "description": "<p>After trading Rudy Gobert and Donovan Mitchell, the Utah Jazz are exploring the trade market for the remaining veterans on their roster. Utah has talked trades with rival teams involving Bojan Bogdanovic, Mike Conley, Jordan Clarkson, Rudy Gay and Malik Beasley.</p>\n<p>In particular, the Jazz have held ongoing talks with the Los Angeles Lakers surrounding Bojan Bogdanovic. The veteran forward averaged 18.1 points on 45/39/86 shooting splits a season ago.</p>\n<p>Utah and Los Angeles have already linked up for one deal this offseason. The Lakers sent Talen Horton-Tucker and Stanley Johnson to the Jazz in exchange for Patrick Beverley. Landing Bogdanovic would go a long way towards adding depth to the Lakers rotation.</p>\n<p>The challenge is Los Angeles may find it difficult to match salary in a trade for Bogdanovic. In part, that may be why Utah isn't close to trading Bogdanovic at this time.</p>",
                "pubDate": "Thu, 15 Sep 2022 08:59:45 EDT",
                "guid": "https://basketball.realgm.com/wiretap/268624/Lakers-Jazz-Talking-Bojan-Bogdanovic-Trade",
                "thumbnail": {
                   "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Bogdanovic_Bojan_uta_200518.jpg"
                }
             },
             {
                "title": "Keifer Sykes, Pistons Sign Exhibit 10 Deal",
                "link": "https://basketball.realgm.com/wiretap/268626/Keifer-Sykes-Pistons-Sign-Exhibit-10-Deal",
                "description": "<p>The Detroit Pistons have signed Keifer Sykes to an Exhibit 10 deal.</p>\n<p>Sykes appeared in 32 games last season with the Pacers, averaging 5.6 points, 1.4 rebounds and 1.9 assists in 17.7 minutes.</p>\n<p>Sykes, who went undrafted out of Green Bay in 2015, had largely played overseas before his NBA debut last season.</p>",
                "pubDate": "Thu, 15 Sep 2022 10:27:31 EDT",
                "guid": "https://basketball.realgm.com/wiretap/268626/Keifer-Sykes-Pistons-Sign-Exhibit-10-Deal",
                "thumbnail": {
                   "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/nba_detroitpistons.jpg"
                }
             },
             {
                "title": "Celtics Sign Justin Jackson, Jake Layman, Denzel Valentine",
                "link": "https://basketball.realgm.com/wiretap/268623/Celtics-Sign-Justin-Jackson-Jake-Layman-Denzel-Valentine",
                "description": "<p>The Boston Celtics have signed Justin Jackson, Jake Layman and Denzel Valentine. All three are expected to have signed non-guaranteed, training camp contracts.</p>\n<p>Jackson appeared in seven NBA games between the Celtics and Phoenix Suns last season. Jackson also played in 28 games for the Texas Legends of the G League. Jackson averaged 22.2 points, 6.7 rebounds and 3.4 assists for the Legends.</p>\n<p>Layman spent the last three seasons with the Minnesota Timberwolves. The Massachusetts native averaged 2.4 points in 6.8 minutes per game last season. Layman also played for the Portland Trail Blazers for three seasons.</p>\n<p>Valentine played in 24 NBA games with the Cleveland Cavaliers and Utah Jazz. The veteran wing also played in 12 games for the Maine Celtics of the G League. Valentine averaged 14.6 points, 10.3 rebounds and 7.0 assists per game in the G League.</p>",
                "pubDate": "Thu, 15 Sep 2022 08:37:05 EDT",
                "guid": "https://basketball.realgm.com/wiretap/268623/Celtics-Sign-Justin-Jackson-Jake-Layman-Denzel-Valentine",
                "thumbnail": {
                   "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/nba_bostonceltics.jpg"
                }
             },
             {
                "title": "Donovan Mitchell 'Thought For Sure' He Was Getting Traded To Knicks",
                "link": "https://basketball.realgm.com/wiretap/268622/Donovan-Mitchell-Thought-For-Sure-He-Was-Getting-Traded-To-Knicks",
                "description": "<p>Donovan Mitchell admitted that he thought he'd get traded to the New York Knicks during his introductory press conference with the Cleveland Cavaliers.</p>\n<p>\"I thought for sure I was going back home, I'm not gonna lie about that.</p>\n<p>\"But when I found out where I was headed, who I was playing with, the group, the team, the coaching staff, I couldn't be more happier to be here,\" said Mitchell.</p>\n<p>Mitchell also added that he was surprised when he found out he was getting traded to the Cavs.</p>\n<p>\"Honestly, I had no idea. My agent AB (Austin Brown) called me on Wednesday and he said you're going to Cleveland and, like I said, my reaction was what it was,\" said Mitchell.</p>\n<p>Mitchell would express his excitement of partnering with the Cavs' young core, adding \"to join these phenomenal guys and add to it, I think that, for me, is what I'm truly excited about.\"</p>\n<p> </p>",
                "pubDate": "Thu, 15 Sep 2022 00:59:38 EDT",
                "guid": "https://basketball.realgm.com/wiretap/268622/Donovan-Mitchell-Thought-For-Sure-He-Was-Getting-Traded-To-Knicks",
                "thumbnail": {
                   "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Mitchell_Donovan_uta_220726.jpg"
                }
             },
             {
                "title": "Joe Harris Expected To Be 100% For Nets Training Camp",
                "link": "https://basketball.realgm.com/wiretap/268621/Joe-Harris-Expected-To-Be-100-perc-For-Nets-Training-Camp",
                "description": "<p>Joe Harris is expected to be fully healed in time for Brooklyn Nets training camp, his agent Mark Bartelstein told ESPN.</p>\n<p>\"He's doing great. Feeling great, ready to roll,\" said Bartelstein.</p>\n<p>Harris had ankle surgery in late November last season, then underwent another procedure in March.</p>\n<p>The 31-year-old Harris averaged 11.6 points in 14 games last season. </p>",
                "pubDate": "Thu, 15 Sep 2022 00:39:36 EDT",
                "guid": "https://basketball.realgm.com/wiretap/268621/Joe-Harris-Expected-To-Be-100-perc-For-Nets-Training-Camp",
                "thumbnail": {
                   "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Harris_Joe_bkn_211129.jpg"
                }
             },
             {
                "title": "NBA Initiated Tampering Investigation On 76ers, Knicks With Findings Expected Within Weeks",
                "link": "https://basketball.realgm.com/wiretap/268620/NBA-Initiated-Tampering-Investigation-On-76ers-Knicks-With-Findings-Expected-Within-Weeks",
                "description": "<p>The NBA initiated its investigations on potential tampering conducted this offseason by the Philadelphia 76ers and New York Knicks as it was not based on a complaint from a team.</p>\n<p>\"The statuses of those investigations are ongoing. Hopefully they'll be wrapped up in the next few weeks,\" said Adam Silver.</p>\n<p>\"I think what prompted them was sort of just the tick-tock chronology around sort of when signings are permissible and the announcements of those signings and the information that came out about them, which was cause for the league office to investigate.\"</p>\n<p>Last year, the Miami Heat and Chicago Bulls were each forced to forfeit a second round pick due to tampering charges. </p>",
                "pubDate": "Wed, 14 Sep 2022 22:01:40 EDT",
                "guid": "https://basketball.realgm.com/wiretap/268620/NBA-Initiated-Tampering-Investigation-On-76ers-Knicks-With-Findings-Expected-Within-Weeks",
                "thumbnail": {
                   "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Brunson_Jalen_dal_220517.jpg"
                }
             },
             {
                "title": "LeBron James, Chris Paul Denounce NBA's Sanction Of Robert Sarver As Falling Short",
                "link": "https://basketball.realgm.com/wiretap/268619/LeBron-James-Chris-Paul-Denounce-NBAs-Sanction-Of-Robert-Sarver-As-Falling-Short",
                "description": "<p>LeBron James and Chris Paul were amongst the players to speak out about the NBA's decision to suspend Robert Server for one year.</p>\n<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Read through the Sarver stories a few times now. I gotta be honest...Our league definitely got this wrong. I don't need to explain why. Y'all read the stories and decide for yourself. I said it before and I'm gonna say it again, there is no place in this league for that kind of</p>\n- LeBron James (@KingJames) <a href=\"https://twitter.com/KingJames/status/1570184134827573248?ref_src=twsrc%5Etfw\">September 14, 2022</a></blockquote>\n<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">behavior. I love this league and I deeply respect our leadership. But this isn't right. There is no place for misogyny, sexism, and racism in any work place. Don't matter if you own the team or play for the team. We hold our league up as an example of our values and this aint it.</p>\n- LeBron James (@KingJames) <a href=\"https://twitter.com/KingJames/status/1570184138010812416?ref_src=twsrc%5Etfw\">September 14, 2022</a></blockquote>\n<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Like many others, I reviewed the report. I was and am horrified and disappointed by what I read. This conduct especially towards women is unacceptable and must never be repeated.</p>\n- Chris Paul (@CP3) <a href=\"https://twitter.com/CP3/status/1570220416224075779?ref_src=twsrc%5Etfw\">September 15, 2022</a></blockquote>\n<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">I am of the view that the sanctions fell short in truly addressing what we can all agree was atrocious behavior. My heart goes out to all of the people that were affected.</p>\n- Chris Paul (@CP3) <a href=\"https://twitter.com/CP3/status/1570220418191228928?ref_src=twsrc%5Etfw\">September 15, 2022</a></blockquote>",
                "pubDate": "Wed, 14 Sep 2022 21:39:49 EDT",
                "guid": "https://basketball.realgm.com/wiretap/268619/LeBron-James-Chris-Paul-Denounce-NBAs-Sanction-Of-Robert-Sarver-As-Falling-Short",
                "thumbnail": {
                   "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/James_LeBron_lal_220208.jpg"
                }
             },
             {
                "title": "Jazz Sign Paris Bass To Exhibit 10 Deal",
                "link": "https://basketball.realgm.com/wiretap/268618/Jazz-Sign-Paris-Bass-To-Exhibit-10-Deal",
                "description": "<p>The Utah Jazz have signed forward Paris Bass. </p>\n<p>Bass (6-8, 200, Detroit-Mercy) joins the Jazz after most recently spending the 2021-22 season with the Phoenix Suns and the South Bay Lakers of the NBA G League. With the Suns, he appeared in two games, averaging 3.0 points and 2.0 rebounds in 3.5 minutes per contest and with South Bay posted averages of 17.4 points, 7.0 boards, 1.7 assists, and 1.4 steals in 26 games (one start).</p>\n<p>The native of Birmingham, Mich., has additional professional experience playing in the BSN of Puerto Rico with Atleticos de San German in 2019-20 and 2020-21. During the 2020-21 season, he posted averages of 22.9 points on 50.1 percent from the field, along with 9.4 rebounds, 4.8 assists, and 1.3 steals in 34.4 minutes per contest. During the 2016-17 season, he competed for the Erie BayHawks of the G League, appearing in 15 games, and averaging 3.9 points and 2.7 rebounds.</p>",
                "pubDate": "Wed, 14 Sep 2022 21:35:25 EDT",
                "guid": "https://basketball.realgm.com/wiretap/268618/Jazz-Sign-Paris-Bass-To-Exhibit-10-Deal",
                "thumbnail": {
                   "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/nba_utahjazz.jpg"
                }
             },
             {
                "title": "DaQuan Jeffries, Knicks Sign Camp Deal",
                "link": "https://basketball.realgm.com/wiretap/268617/DaQuan-Jeffries-Knicks-Sign-Camp-Deal",
                "description": "<p>The New York Knicks have agreed to sign Daquan Jeffries to a camp deal.</p>\n<p>Jeffries spent parts of the past three seasons with the Sacramento Kings, Houston Rockets and Memphis Grizzlies. </p>\n<p>The Knicks currently have two roster spots on their regular season roster. </p>",
                "pubDate": "Wed, 14 Sep 2022 15:54:39 EDT",
                "guid": "https://basketball.realgm.com/wiretap/268617/DaQuan-Jeffries-Knicks-Sign-Camp-Deal",
                "thumbnail": {
                   "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/nba_newyorkknicks.jpg"
                }
             },
             {
                "title": "Knicks Not Currently Interested In Blake Griffin, LaMarcus Aldridge, Carmelo Anthony",
                "link": "https://basketball.realgm.com/wiretap/268616/Knicks-Not-Currently-Interested-In-Blake-Griffin-LaMarcus-Aldridge-Carmelo-Anthony",
                "description": "<p>The New York Knicks have a pair of open roster spots, but are not interested in high profile veteran free agents Blake Griffin, LaMarcus Aldridge or Carmelo Anthony. The Knicks had kept the roster spots open as they discussed a trade for Donovan Mitchell, though a major deal involving Julius Randle or Evan Fournier remains possible. </p>\n<p>Anthony has been amenable to a return to the Knicks this offseason and the front office had internal discussions previously on signing him.</p>\n<p>Other veteran big men who remain available include Tristan Thompson, Dwight Howard, Cody Zeller and Hassan Whiteside. </p>\n<p>Tom Thibodeau has a history of making his 15th man someone who doesn't care about playing time.</p>",
                "pubDate": "Wed, 14 Sep 2022 15:45:54 EDT",
                "guid": "https://basketball.realgm.com/wiretap/268616/Knicks-Not-Currently-Interested-In-Blake-Griffin-LaMarcus-Aldridge-Carmelo-Anthony",
                "thumbnail": {
                   "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Griffin_Blake_bkn_210329.jpg"
                }
             },
             {
                "title": "Stephen Curry, Under Armour Close To $1B Lifetime Contract",
                "link": "https://basketball.realgm.com/wiretap/268615/Stephen-Curry-Under-Armour-Close-To-$1B-Lifetime-Contract",
                "description": "<p>Stephen Curry and Under Armour are close to agreement on a lifetime contract that could potentially be worth more than $1 billion.</p>\n<p>Curry signed with Under Armour in 2013 and soon became a two-time MVP and one of the most popular players in the NBA. When initially joining Under Armour, Curry was paid roughly $4 million per year.</p>\n<p>Curry's current $215 million deal with Under Armour expires in 2024.</p>",
                "pubDate": "Wed, 14 Sep 2022 10:31:21 EDT",
                "guid": "https://basketball.realgm.com/wiretap/268615/Stephen-Curry-Under-Armour-Close-To-$1B-Lifetime-Contract",
                "thumbnail": {
                   "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Curry_Stephen_gsw_211026.jpg"
                }
             },
             {
                "title": "Caesars Sportsbook Kansas Promo Code REALGMFULL Runs Out $1250 Free Bet",
                "link": "https://basketball.realgm.com/wiretap/268614/Caesars-Sportsbook-Kansas-Promo-Code-REALGMFULL-Runs-Out-$1250-Free-Bet",
                "description": "<p><strong> </strong>After the Chiefs dominated the Cardinals in Week 1, Kansas sports bettors look forward to getting in on the NFL action in the coming week. While the Chiefs try to build momentum in the AFC West, the Kansas and K-State football teams look to continue their hot starts. The busy month ahead provides the perfect opportunity to sign up for the <strong><a href=\"https://basketball.realgm.com/betting/sportsbooks/caesars\" target=\"_blank\" rel=\"noopener\">Caesars Sportsbook Kansas promo code</a></strong><strong> REALGMFULL</strong> which, along with guaranteed reward credits, gives out a refund of up to $1,250 on your opening bet. </p>\n<div class=\"gdcg-oplist\" data-gdcg_rankid=\"1177\" data-gdcg_country=\"us\" data-gdcg_region=\"ks\"> </div>\n<p>The online sportsbook matches the stake on a losing opening wager and deposits a matching site credit within 72 hours as long as you use the <strong>Caesars Kansas promo code REALGMFULL</strong>. It's that simple. You'll also receive 1,000 Reward Credits and 1,000 Tier Credits, regardless of whether your bet wins or loses. Redeem the offer by clicking the link on this page.</p>\n<p>Once you're redirected to the website, enter <strong>Caesars Sportsbook KS promo code REALGMFULL</strong>, sign up, deposit, and wager at least $10. The two-part welcome bonus is available by clicking the link and on the Caesars Sportsbook Kansas mobile app.</p>\n<p>Most bettors utilize <a href=\"https://basketball.realgm.com/wiretap/266131/Best-Sports-Betting-Apps-2022-Legal-Online-Sportsbook-Apps\" target=\"_blank\" rel=\"noopener\">sports betting apps</a> for some or all of their bets. The same <strong>Caesars Sportsbook KS promo code REALGMFULL</strong> applies if you sign up on the mobile app.  </p>\n<div class=\"gdcg-oplist\" data-gdcg_rankid=\"1177\" data-gdcg_country=\"us\" data-gdcg_region=\"ks\"> </div>\n<h2>Caesars Sportsbook KS Promo Code: Parlay Insurance</h2>\n<p>Caesars Sportsbook KS offers various bonuses in terms of ongoing sportsbook promo codes. The online sportsbook also freshens things up for bettors and changes the bonuses regularly. It offers daily odds boosts, profit boosts and parlay insurance. You must have a Caesars Sportsbook Kansas account before redeeming these bonuses. </p>\n<p>Log in to your account and lock in a parlay with four or more legs. If you fall only one leg short of winning, you'll receive a refund on bets up to $25. Caesars Sportsbook KS also regularly offers insurance on same game MLB parlays. Again, the parlay can only miss by a single leg. </p>\n<p>Profit boosts and odds boosts are also Caesars Sportsbook Kansas mainstays. Both are offered on an ongoing basis. Sign into your account and access the bonus drawer and bet slip to see if any profit boosts are available. <strong>Caesars Sportsbook promo code Kansas REALGMFULL</strong> isn't required for ongoing bonuses, but you must opt-in.</p>\n<div class=\"gdcg-oplist\" data-gdcg_rankid=\"1177\" data-gdcg_country=\"us\" data-gdcg_region=\"ks\"> </div>\n<h2>Access $1000 With Caesars Sportsbook KS Refer Bonus</h2>\n<p>Online sportsbooks deploy a wide range of tactics to garner increased signups. For example, Caesars Sportsbook KS has an outstanding refer-a-friend bonus, yielding up to $1,000 in site credit. All you have to do is refer 10 friends to increase your bankroll by $1,000. A bonus you might not initially think about when for an online sportsbook to join, this refer-a-friend offer is good enough to compel you to sign up.</p>\n<p>Send each friend an exclusive link, and you'll receive a $100 free-bet token for each referral. Your friends must click the referral link, sign up, deposit, and wager at least $50. Once each new account is confirmed, you'll receive the site credit within a week.</p>\n<p>Make sure to let your friends know that by applying <strong>Caesars Sportsbook promo code KS REALGMFULL</strong>, they'll get immediate access to the $1,250 first-bet insurance welcome offer. As with all betting sites, your friends must be 21 years old to participate.  </p>\n<div class=\"gdcg-oplist\" data-gdcg_rankid=\"5\" data-gdcg_country=\"us\" data-gdcg_region=\"ks\"> </div>",
                "pubDate": "Wed, 14 Sep 2022 10:22:08 EDT",
                "guid": "https://basketball.realgm.com/wiretap/268614/Caesars-Sportsbook-Kansas-Promo-Code-REALGMFULL-Runs-Out-$1250-Free-Bet",
                "thumbnail": {
                   "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/gdc_caesars_kansas.jpg"
                }
             },
             {
                "title": "Wizards Sign Jordan Goodwin",
                "link": "https://basketball.realgm.com/wiretap/268613/Wizards-Sign-Jordan-Goodwin",
                "description": "<p>The Washington Wizards have signed Jordan Goodwin. Goodwin will join the Wizards for training camp and the preseason.</p>\n<p>The 6-foot-3 guard appeared in two games with Washington last season. Goodwin joined the Wizards on a hardship callup in late-December.</p>\n<p>In 31 games with the Capital City Go-Go, Washington's G League affiliate), Goodwin averaged 16.1 points, 6.1 rebounds, 4.6 assists and 1.9 steals. It's expected Goodwin will rejoin the Go-Go after spending the preseason with the Wizards.</p>",
                "pubDate": "Wed, 14 Sep 2022 09:57:51 EDT",
                "guid": "https://basketball.realgm.com/wiretap/268613/Wizards-Sign-Jordan-Goodwin",
                "thumbnail": {
                   "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/nba_washingtonwizards.jpg"
                }
             },
             {
                "title": "Nerlens Noel's $58M Lawsuit Against Rich Paul Dismissed",
                "link": "https://basketball.realgm.com/wiretap/268612/Nerlens-Noels-$58M-Lawsuit-Against-Rich-Paul-Dismissed",
                "description": "<p>Nerlens Noel's $58 million lawsuit against Rich Paul and Klutch Sports Group was dismissed on Tuesday.</p>\n<p>The case was sent to the NBPA's arbitration system for further resolution. </p>\n<p>Noel initially filed the lawsuit against Paul in 2021, alleging that his former agent did \"little to no work\" to negotiate contracts, engage teams, and look for endorsement deals on his behalf.</p>\n<p>Noel's attorney also argued that the player left a four-year, $70 million deal from the Mavs on the table following the 2016-17 season due to Paul's advice. Noel was then \"forced to sign a series of qualifying offers and league minimum contracts which were well below the true value of Noel's services.\"</p>\n<p>Noel was most recently traded to the Pistons this summer.</p>",
                "pubDate": "Wed, 14 Sep 2022 01:35:00 EDT",
                "guid": "https://basketball.realgm.com/wiretap/268612/Nerlens-Noels-$58M-Lawsuit-Against-Rich-Paul-Dismissed",
                "thumbnail": {
                   "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Noel_Nerlens_nyk_210527.jpg"
                }
             },
             {
                "title": "Dwyane Wade Will Not Return To TNT's NBA Coverage This Season",
                "link": "https://basketball.realgm.com/wiretap/268611/Dwyane-Wade-Will-Not-Return-To-TNTs-NBA-Coverage-This-Season",
                "description": "<p>Dwyane Wade is set to leave TNT's NBA coverage for this upcoming season, reported Andrew Marchand of the New York Post.</p>\n<p>TNT reportedly made an offer to keep Wade, though Wade chose to focus on his other business ventures.</p>\n<p>Wade had been with the network for three years and there is no ill feelings between the two sides.</p>\n<p>Wade is also not expected to appear in ESPN's NBA coverage this season. </p>",
                "pubDate": "Wed, 14 Sep 2022 01:23:00 EDT",
                "guid": "https://basketball.realgm.com/wiretap/268611/Dwyane-Wade-Will-Not-Return-To-TNTs-NBA-Coverage-This-Season",
                "thumbnail": {
                   "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/nba_realgm.jpg"
                }
             },
             {
                "title": "Dennis Schroder Generating League-Wide Buzz Following Eurobasket Performance",
                "link": "https://basketball.realgm.com/wiretap/268610/Dennis-Schroder-Generating-League-Wide-Buzz-Following-Eurobasket-Performance",
                "description": "<p>Dennis Schroder is generating \"buzz\" around the league after impressing at Eurobasket, tweeted Marc Stein of Substack.</p>\n<p>Currently an unrestricted free agent, Schroder scored 26 points as Germany beat Greece to advance to the semifinals of the tournament.</p>\n<p>Stein previously reported that <a href=\"https://basketball.realgm.com/wiretap/268535/Mavericks-Considering-Adding-Veteran-Ballhandler-To-Roster\">the Mavs</a> and <a href=\"https://basketball.realgm.com/wiretap/268385/Lakers-Considering-Signing-Dennis-Schroder\">the Lakers</a> had interest in signing the point guard. </p>\n<p> </p>",
                "pubDate": "Wed, 14 Sep 2022 01:17:10 EDT",
                "guid": "https://basketball.realgm.com/wiretap/268610/Dennis-Schroder-Generating-League-Wide-Buzz-Following-Eurobasket-Performance",
                "thumbnail": {
                   "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Schroder_Dennis_hou_220222.jpg"
                }
             },
             {
                "title": "BetRivers Promo Code Earns Risk-Free Bet Up To $500 For New Users",
                "link": "https://basketball.realgm.com/wiretap/268609/BetRivers-Promo-Code-Earns-Risk-Free-Bet-Up-To-$500-For-New-Users",
                "description": "<p>Week 2 of the NFL season is already here, we'll be at midseason before you know it. There is no time to waste when it comes to launching your new sports betting account. When weighing which online sportsbook use, consider BetRivers. If you decide to go that way, make sure to take advantage of our <strong>BetRivers promo code</strong> offer and receive a risk-free bet, up to $500.</p>\n<div class=\"gdcg-oplist\" data-gdcg_rankid=\"1230\"> </div>\n<p>The <strong>BetRivers promo code</strong> offer is one of the more intriguing offers on any of the <a href=\"https://basketball.realgm.com/wiretap/266131/Best-Sports-Betting-Apps-2022-Legal-Online-Sportsbook-Apps\" target=\"_blank\" rel=\"noopener\">top sportsbook apps</a>. It allows you to take a $500 swing on your first bet. Even if you lose the bet, you'll get a second chance, there is no harm done.</p>\n<p>Once you make your first bet and you have received your risk-free bet through our <strong>BetRivers promo code</strong> offer, there are other great features of the app to utilize. From daily odds boosts to future bets, there is plenty of betting to be done.</p>\n<h2>BetRivers Promo Code: Risk-Free Bet Up To $500</h2>\n<p>Our <strong>BetRivers promo code</strong> deal is one of the best welcome offers on any of the betting sites. Here is how to get started on your new account:</p>\n<div class=\"gdcg-oplist\" data-gdcg_rankid=\"1230\"> </div>\n<ul>\n<li>If you are a new customer and 21 or older then you are eligible for this offer.</li>\n<li>The best way to get started is by following our link to the app.</li>\n<li>Then you will have to fill out a few pieces of personal information to get your account set up.</li>\n<li>Once all of that is done, you can make your initial deposit and place your first bet to take advantage of our <strong>BetRivers promo code</strong> offer.</li>\n</ul>\n<p>If you lose that first bet, you can get back up to a $500 ($100 in New York state) in free bets from BetRivers.</p>\n<p>The free bet you receive via the <strong>BetRivers promo code</strong> offer has minimum odds of -200 and a 1x rollover before you can cash out. You have 30 days to use the free bet.</p>\n<div class=\"gdcg-oplist\" data-gdcg_rankid=\"1230\"> </div>\n<h2>BetRivers Promotion: Futures Betting</h2>\n<p>Future bets allow customers to bet on an event that will happen in the future rather than a single upcoming game. For example, you can currently bet on who will win the <a href=\"https://football.realgm.com/betting/sportsbooks/super-bowl-odds\">Super Bowl</a> and each division and conference in the NFL. These odds are adjusted by oddsmakers throughout the season to reflect each team's performance.</p>\n<p>So, if there is a team you think will overperform, now is the time to bet on their future before the odds move against you.</p>\n<p>Get started today with the <strong>BetRivers promo code</strong> offer.</p>\n<div class=\"gdcg-oplist\" data-gdcg_rankid=\"5\"> </div>",
                "pubDate": "Tue, 13 Sep 2022 18:33:45 EDT",
                "guid": "https://basketball.realgm.com/wiretap/268609/BetRivers-Promo-Code-Earns-Risk-Free-Bet-Up-To-$500-For-New-Users",
                "thumbnail": {
                   "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/gdc_betrivers_sb.jpg"
                }
             },
             {
                "title": "BetMGM Bonus Code REALGM Unlocks Risk-Free Bet Up To $1000 For Fall Sports",
                "link": "https://basketball.realgm.com/wiretap/268608/betmgm-unlocks-risk-free-bet-up-to-1000-for-fall-sports",
                "description": "<p>September marks the start of the NFL season and the business end of the MLB year. The intersection of those two sports provides fans across the country with non-stop, meaningful games. New bettors can jump from the sidelines into the action by taking advantage of the <a href=\"https://basketball.realgm.com/betting/sportsbooks/betmgm\" target=\"_blank\" rel=\"noopener\">BetMGM bonus code</a> REALGM and redeem the outstanding $1,000<strong> </strong>risk-free first bet welcome offer. </p>\n<div class=\"gdcg-oplist\" data-gdcg_rankid=\"657\"> </div>\n<p>Not only does the <strong>BetMGM bonus code REALGM</strong> refund the stake on losing qualifying bets, but the online sportsbook guarantees payment within 24 hours. You'll be hard-pressed to find a faster payout. You also get the added benefit of a high potential payout, with BetMGM reimbursing losing initial wagers up to $1,000. If you want to get the most out of your $1,000 risk-free bet, wager at least $50. That way, if your bet loses, you'll receive the refund as five equal free-bet tokens, providing five free follow-up wagers. If your wager is $49 or less, you'll receive a single free-bet token.</p>\n<p>Redeeming the $1,000<strong> </strong>risk-free first bet is straightforward. Click the link on this page, sign up and enter <strong>BetMGM bonus code REALGM</strong>, make your initial deposit and commit to at least $10 on your qualifying wager. Then sit back, relax, and enjoy the action. You can also access the welcome offer and all online promotions on the mobile app, one of the most highly rated <a href=\"https://basketball.realgm.com/wiretap/266131/Best-Sports-Betting-Apps-2022-Legal-Online-Sportsbook-Apps\" target=\"_blank\" rel=\"noopener\">sports betting apps</a>. </p>\n<h2>BetMGM Bonus Code REALGM: Parlays Up For Grabs </h2>\n<p>Parlay bonuses are a big deal at BetMGM. You can redeem a bonus whether your parlay wins or loses. The two current parlay bonuses, Parlay Plus and One Game Parlay Insurance, are available for BetMGM account holders, so make sure you sign up and apply <strong>BetMGM bonus code REALGM</strong> while doing so.</p>\n<div class=\"gdcg-oplist\" data-gdcg_rankid=\"657\"> </div>\n<p>Parlay Plus offers a bonus on winning parlays. You can have the parlay combine across sports and games as long as it has at least four legs. You can also place the parlay on the same game. The bonus percentage ranges from 15 to 40, the latter of which is reserved for seven-leg winners. You'll earn 15% for four-leg winners, 20% for successful five-leg parlays and 30% for six-leg victors.</p>\n<p>The One Game Parlay Insurance bonus is a unique promotion you won't see offered by many betting sites. Available for MLB, EPL, and NFL, you'll receive a refund of up to $25 if your four-to-seven-leg parlay misses by a single leg. You don't need to enter BetMGM bonus code REALGM for either parlay bonus, but an account is required. </p>\n<div class=\"gdcg-oplist\" data-gdcg_rankid=\"657\"> </div>\n<h2>Earn $1000 With Underrated BetMGM Bonus </h2>\n<p>Sports bettors should pay close attention to this BetMGM bonus, as it allows you to increase your bankroll by $1,000. And all you need to do is get your friends to sign up on your say-so. You're not the only one who benefits from this bonus, as new joiners also receive the $50 site credit. Send each friend a referral invitation by text, social, or email.</p>\n<p>Your friends have 30 days to sign up after receiving the invitation. Once they sign up, deposit, and wager $50, the online sportsbook deposits a $50 free-bet token into the referred and the referrer's accounts. You must refer 20 friends to garner the $1,000 maximum.</p>\n<p>In addition, you must be in the same state as your friends, where BetMGM operates legally. If you want to be an even better friend, ensure those you send the invitations to apply <strong>BetMGM bonus code REALGM</strong> during signup. That promo code guarantees access to the $1,000 risk-free bet.</p>\n<div class=\"gdcg-oplist\" data-gdcg_rankid=\"5\"> </div>",
                "pubDate": "Tue, 13 Sep 2022 16:09:00 EDT",
                "guid": "https://basketball.realgm.com/wiretap/268608/betmgm-unlocks-risk-free-bet-up-to-1000-for-fall-sports",
                "thumbnail": {
                   "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/gdc-betmgm-new-hero.jpg"
                }
             },
             {
                "title": "Robert Sarver Suspended One Year, Fined $10M",
                "link": "https://basketball.realgm.com/wiretap/268607/Robert-Sarver-Suspended-One-Year-Fined-$10M",
                "description": "<p>Robert Sarver has been suspended for one year from the Phoenix Suns and fined $10 million following an investigation into toxic workplace issues under his ownership. Server must, during his suspension, complete a training program focused on respect and appropriate conduct in the workplace.</p>\n<p style=\"font-weight: 400;\">The report of the independent investigation was based on information gathered from interviews with 320 individuals, including current and former employees who worked for the teams during Sarver's 18-year tenure as Managing Partner, Sarver, and other relevant individuals; and from the evaluation of more than 80,000 documents and other materials, including emails, text messages and videos. Sarver and the Suns/Mercury organization cooperated fully with the investigative process.</p>\n<p style=\"font-weight: 400;\">As stated in the report, the independent investigation found that Sarver \"engaged in conduct that clearly violated common workplace standards, as reflected in team and League rules and policies. This conduct included the use of racially insensitive language; unequal treatment of female employees; sex-related statements and conduct; and harsh treatment of employees that on occasion constituted bullying.\"</p>\n<p style=\"font-weight: 400;\">Among the key findings:</p>\n<ul style=\"font-weight: 400;\">\n<li>Sarver, on at least five occasions during his tenure with the Suns/Mercury organization, repeated the N-word when recounting the statements of others.    </li>\n<li>Sarver engaged in instances of inequitable conduct toward female employees, made many sex-related comments in the workplace, made inappropriate comments about the physical appearance of female employees and other women, and on several occasions engaged in inappropriate physical conduct toward male employees. </li>\n<li>Sarver engaged in demeaning and harsh treatment of employees, including by yelling and cursing at them.</li>\n</ul>\n<p style=\"font-weight: 400;\">\"The statements and conduct described in the findings of the independent investigation are troubling and disappointing,\" said NBA Commissioner Adam Silver.  \"We believe the outcome is the right one, taking into account all the facts, circumstances and context brought to light by the comprehensive investigation of this 18-year period and our commitment to upholding proper standards in NBA workplaces.</p>\n<p style=\"font-weight: 400;\">\"I am hopeful that the NBA community will use this opportunity to reflect on what this great game means to people everywhere and the values of equality, respect and inclusion that it strives to represent.  Regardless of position, power or intent, we all need to recognize the corrosive and hurtful impact of racially insensitive and demeaning language and behavior.  On behalf of the entire NBA, I apologize to all of those impacted by the misconduct outlined in the investigators' report.  We must do better.\"</p>",
                "pubDate": "Tue, 13 Sep 2022 12:11:09 EDT",
                "guid": "https://basketball.realgm.com/wiretap/268607/Robert-Sarver-Suspended-One-Year-Fined-$10M",
                "thumbnail": {
                   "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Sarver_Robert_phx_211111.jpg"
                }
             },
             {
                "title": "Cavs Made Best Offer For Donovan Mitchell; Jazz Open To Trading Other Vets",
                "link": "https://basketball.realgm.com/wiretap/268606/Cavs-Made-Best-Offer-For-Donovan-Mitchell;-Jazz-Open-To-Trading-Other-Vets",
                "description": "<p>After Donovan Mitchell was traded from the Utah Jazz, there was a notion that Utah was determined to not trade Mitchell to the New York Knicks. Jazz GM Justin Zanik refuted that idea by saying Mitchell was traded to the Cleveland Cavaliers because the Cavs stepped up.</p>\n<p>\"It was the best offer,\" Zanik said. \"I think for them, they saw an opportunity to add to their team and open up a window with Donovan and a young group, I think they are going to be very good. And, you know, to get a good return, you have to give up something good as well. They certainly gave up a lot.\"</p>\n<p>Zanik also touched on Utah being in trade talks for the remaining veterans on their roster including Bojan Bogdanovic, Mike Conley and Rudy Gay.</p>\n<p>\"Those conversations continue to evolve, we've continued to be in touch with them directly and their representation,\" Zanik said. \"Obviously there's been a lot of change this summer, so it's natural for us to have those conversations.\"</p>",
                "pubDate": "Tue, 13 Sep 2022 09:18:46 EDT",
                "guid": "https://basketball.realgm.com/wiretap/268606/Cavs-Made-Best-Offer-For-Donovan-Mitchell;-Jazz-Open-To-Trading-Other-Vets",
                "thumbnail": {
                   "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/nba_utahjazz.jpg"
                }
             },
             {
                "title": "Get Your Latest NBA News From RealGM's Basketball Wiretap",
                "link": "https://basketball.realgm.com/news",
                "description": "Get all the latest news and happenings from around the NBA with RealGM's Basketball Wiretap.",
                "pubDate": "Fri, 16 Sep 2022 11:17:01 EDT",
                "guid": "https://basketball.realgm.com/news"
             }
          ]
       },
       "_xmlns:media": "http://search.yahoo.com/mrss/",
       "_version": "2.0"
    }
 }