{
   "rss": {
      "channel": {
         "title": "RealGM Basketball Wiretap",
         "link": "https://basketball.realgm.com/news",
         "description": "Basketball News, Rumors, Scores, Stats, Analysis, Depth Charts, Forums",
         "language": "en-us",
         "pubDate": "Mon, 24 Oct 2022 18:17:01 EDT",
         "lastBuildDate": "Mon, 24 Oct 2022 18:17:01 EDT",
         "item": [
            {
               "title": "Bucks Engaged Suns In Jae Crowder Trade Talks",
               "link": "https://basketball.realgm.com/wiretap/269136/Bucks-Engaged-Suns-In-Jae-Crowder-Trade-Talks",
               "description": "<p>A few different Eastern Conference contenders have been linked to trade interest in Jae Crowder of the Phoenix Suns. Now, we can add the Milwaukee Bucks to that list too.</p>\n<p>The Bucks and Suns recently engaged in trade talks surrounding the veteran forward. The Atlanta Hawks, Miami Heat and Boston Celtics have all been mentioned as potential landing spots for Crowder too. For now, Crowder remains away from the Suns, as Phoenix works on finding a trade partner.</p>\n<p>Milwaukee has a few different trade avenues to land the 3&D combo forward. Most would involve the Bucks parting with at least one rotation player, but Crowder could give them the defense and floor spacing they've lacked at the forward spot since losing P.J. Tucker in free agency before last season.</p>",
               "pubDate": "Mon, 24 Oct 2022 09:41:43 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269136/Bucks-Engaged-Suns-In-Jae-Crowder-Trade-Talks",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Crowder_Jae_phx_210202.jpg"
               }
            },
            {
               "title": "Lakers, Spurs Recently Talked Trades Centered Around Russell Westbrook, Josh Richardson",
               "link": "https://basketball.realgm.com/wiretap/269138/Lakers-Spurs-Recently-Talked-Trades-Centered-Around-Russell-Westbrook-Josh-Richardson",
               "description": "<p>The Los Angeles Lakers preferred path forward with Russell Westbrook is to find a way for him to work within the team's offensive and defensive systems. But that hasn't kept the Lakers from continuing to look into trade options involving Westbrook.</p>\n<p>In recent weeks, Los Angeles engaged the San Antonio Spurs in trade talks for Josh Richardson. Richardson is a veteran on an expiring contract, so it's expected San Antonio will look to trade him during this rebuilding season.</p>\n<p>The Lakers have remained interested in potential trades with the Indiana Pacers (for Buddy Hield and Myles Turner) and the Charlotte Hornets (for Terry Rozier), as well. All trade talks have seen rival teams ask Los Angeles for either one or both of the Lakers tradable future first-round picks.</p>\n<p>A deal that sends Westbrook to either Indiana or San Antonio would be easier to complete, because those teams still have considerable cap space. Both the Pacers and Spurs have approximately $30 million in available cap space. That would make absorbing Westbrook's $47.1 million contract easier than a team that would have to fully match salary in a deal.</p>",
               "pubDate": "Mon, 24 Oct 2022 10:00:01 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269138/Lakers-Spurs-Recently-Talked-Trades-Centered-Around-Russell-Westbrook-Josh-Richardson",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Westbrook_Russell_lal_210106.jpg"
               }
            },
            {
               "title": "Charles Bassey, Spurs Agree To Two-Way Contract",
               "link": "https://basketball.realgm.com/wiretap/269141/Charles-Bassey-Spurs-Agree-To-Two-Way-Contract",
               "description": "<p>The San Antonio Spurs have agreed to sign Charles Bassey to a Two-Way contract.</p>\n<p>Bassey is entering his second season after he was a second round pick by the Philadelphia 76ers in 2021.</p>",
               "pubDate": "Mon, 24 Oct 2022 13:28:58 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269141/Charles-Bassey-Spurs-Agree-To-Two-Way-Contract",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/nba_sanantoniospurs.jpg"
               }
            },
            {
               "title": "Timberwolves Begin Extension Talks With Jaylen Nowell, Naz Reid",
               "link": "https://basketball.realgm.com/wiretap/269137/Timberwolves-Begin-Extension-Talks-With-Jaylen-Nowell-Naz-Reid",
               "description": "<p>The Minnesota Timberwolves have begun extension talks with two of their valuable young players. The Wolves are looking to lock up both Jaylen Nowell and Naz Reid to deals before the end of the season. Reid seems the more likely to ink a new contract, as Nowell appears headed for free agency in the summer of 2023.</p>\n<p>Both Nowell and Reid are finishing the four-year deals they signed as rookies in 2019. Because they are on expiring contracts, Nowell and Reid are extension-eligible through June 30. Both players are eligible to sign extensions worth up to $58 million over as many as four seasons.</p>\n<p>Nowell has improved each year and has seen his role grow for Minnesota each season. He's averaged 8.3 points on 44.5% shooting in 122 games, mostly off the Wolves bench.</p>\n<p>Reid became a key backup for the Timberwolves over the last two seasons. He's largely played behind Karl-Anthony Towns at the center spot, and this season is backing up Rudy Gobert. In 179 appearances (32 starts), Reid has averaged 9.5 points, 4.2 rebounds and nearly on block in 17.2 minutes per game.</p>",
               "pubDate": "Mon, 24 Oct 2022 09:50:18 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269137/Timberwolves-Begin-Extension-Talks-With-Jaylen-Nowell-Naz-Reid",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Nowell_Jaylen_min_220517.jpg"
               }
            },
            {
               "title": "Hornets' Interest In Russell Westbrook Based On Unloading Long-Term Salary",
               "link": "https://basketball.realgm.com/wiretap/269139/Hornets-Interest-In-Russell-Westbrook-Based-On-Unloading-Long-Term-Salary",
               "description": "<p>The interest the Charlotte Hornets previously had in acquiring Russell Westbrook from the Los Angeles Lakers was rooted in unloading long-term salary with the expectation they would sign Miles Bridges to a major contract, sources tell Kevin O'Connor of The Ringer.</p>\n<p>Bridges remains unsigned following his domestic violence arrest that occurred on the eve of the offseason. Due to the serious nature of the charges, Bridges' entire future in the NBA is in serious question.</p>\n<p>Charlotte was expected to consider taking on Westbrook for Terry Rozier and Gordon Hayward.</p>",
               "pubDate": "Mon, 24 Oct 2022 11:41:59 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269139/Hornets-Interest-In-Russell-Westbrook-Based-On-Unloading-Long-Term-Salary",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Westbrook_Russell_lal_210106.jpg"
               }
            },
            {
               "title": "Damian Lillard, Jayson Tatum Named NBA's Players Of The Week",
               "link": "https://basketball.realgm.com/wiretap/269143/Damian-Lillard-Jayson-Tatum-Named-NBAs-Players-Of-The-Week",
               "description": "<p>Damian Lillard and Jayson Tatum have been named the NBA's Players of the Week for Week 1.</p>\n<p>Lillard averaged 34.0 points, 5.3 rebounds and 4.3 assists as the Portland Trail Blazers went 3-0.</p>\n<p>Tatum averaged 34.7 points and 8.3 rebounds as the Boston Celtics also went 3-0.</p>",
               "pubDate": "Mon, 24 Oct 2022 15:31:16 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269143/Damian-Lillard-Jayson-Tatum-Named-NBAs-Players-Of-The-Week",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Lillard_Damian_por_220209.jpg"
               }
            },
            {
               "title": "Lakers, Jazz Expected To Discuss Russell Westbrook Trade Again",
               "link": "https://basketball.realgm.com/wiretap/269140/Lakers-Jazz-Expected-To-Discuss-Russell-Westbrook-Trade-Again",
               "description": "<p>The Los Angeles Lakers and Utah Jazz are expected to return to the negotiation table later this season on a potential trade centered on Russell Westbrook.</p>\n<p>Before the Jazz traded Bojan Bogdanovic to the Detroit Pistons, the Lakers offered Westbrook, a future first round pick, and second rounders for a package that included Bogdanovic and others.</p>\n<p>The Jazz also have Mike Conley and Rudy Gay that could be included in a potential trade. Jordan Clarkson could also be a potential piece, though Utah is said to prefer to keep him.</p>",
               "pubDate": "Mon, 24 Oct 2022 11:47:32 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269140/Lakers-Jazz-Expected-To-Discuss-Russell-Westbrook-Trade-Again",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Westbrook_Russell_lal_211012.jpg"
               }
            },
            {
               "title": "Caesars Sportsbook Promo Code Illinois Gets You $1250 First-Bet Insurance",
               "link": "https://basketball.realgm.com/wiretap/269135/Caesars-Sportsbook-Promo-Code-Illinois-Gets-You-$1250-First-Bet-Insurance",
               "description": "<p>The Bears look to rebound after three consecutive losses, with Matt Eberflus' team traveling to New England as considerable underdogs in the Monday night tilt against the Patriots. The 2-4 Bears should represent solid underdog value for most of the season. You can take advantage of the best Bears' picks after you apply <strong>Caesars Sportsbook promo</strong><strong> </strong><strong>code</strong><strong> Illinois </strong><strong>REALGMFULL</strong> and redeem the first-bet insurance, up to $1,250.</p>\n<div class=\"gdcg-oplist\" data-gdcg_rankid=\"1177\" data-gdcg_country=\"us\" data-gdcg_region=\"il\"> </div>\n<p>Pick your preferred bet type and back a team from any sport when redeeming one of the best sportsbook promo codes in<a href=\"https://football.realgm.com/wiretap/47374/Illinois-Sports-Betting-Legal-Online-Sports-Betting-in-ILL\" target=\"_blank\" rel=\"noopener\"> Illinois sports betting</a>. The online sportsbook provides a one-time insurance policy on your opening wager after you sign up and enter <strong>Caesars Sportsbook promo</strong><strong> </strong><strong>code</strong><strong> Illinois</strong><strong> </strong><strong>REALGMFULL</strong>. Lose the opening bet, and Caesars Sportsbook Illinois refunds the stake up to $1,250.  </p>\n<p>You'll get the most out of this welcome offer by backing an underdog, such as the Bears tonight, with your qualifying wager. You'll enjoy a markedly higher profit margin if the Bears pull through. And if the underdog loses, you'll receive a refund as a single free-bet token, facilitating a free do-over bet.  </p>\n<h2>Caesars Sportsbook Promo Code Illinois Offers Free Credits </h2>\n<table>\n<tbody>\n<tr>\n<td>Caesars Sportsbook Promo Code Ilinois</td>\n<td>REALGMFULL</td>\n</tr>\n<tr>\n<td>Caesars Sportsbook Illinois Bonus</td>\n<td>First-bet insurance up to $1250, plus 1,000 Tier Credits and 1,000 Reward Credits</td>\n</tr>\n<tr>\n<td>Terms & Conditions</td>\n<td>New customers 21 and over in Illinois as well as AZ, CO, IA, KS, LA, MI, NV, NJ, NY, PA, TN, VA, WV. Insurance awarded in a single free bet.</td>\n</tr>\n</tbody>\n</table>\n<div class=\"gdcg-oplist\" data-gdcg_rankid=\"1177\" data-gdcg_country=\"us\" data-gdcg_region=\"il\"> </div>\n<p>In addition to the free-bet insurance up to $1,250 on losing qualifying wagers, Caesars Sportsbook Illinois also guarantees 1,000 Reward Credits and 1,000 Tier Credits for signing up. After entering <strong>Caesars Sportsbook</strong><strong> </strong><strong>promo</strong><strong> </strong><strong>code Illinois</strong><strong> </strong><strong>REALGMFULL</strong>, and once your account is confirmed, you'll receive 1,000 Reward Credits and 1,000 Tier Credits. </p>\n<p>You can redeem the credits on countless experiences, including dining experiences and accommodation discounts. You can also cash in credits toward free bets or accumulate points, increasing your tier standing as a Caesars Sportsbook Rewards member. </p>\n<p>Online sportsbooks rarely include reward credits as part of their signup offers, another reason Caesars Sportsbook Illinois is one of the industry's <a href=\"https://basketball.realgm.com/wiretap/266131/Best-Sports-Betting-Apps-2022-Legal-Online-Sportsbook-Apps\" target=\"_blank\" rel=\"noopener\">top sports betting apps</a>. The single free-bet token is deposited into your account within 72 hours on unsuccessful opening wagers. Bettors have two weeks to use the site credit on a follow-up wager, and you only need to make an initial $10 deposit to activate the welcome offer.   </p>\n<div class=\"gdcg-oplist\" data-gdcg_rankid=\"1177\" data-gdcg_country=\"us\" data-gdcg_region=\"il\"> </div>\n<h2>Bonuses With Caesars Sportsbook Promo Code Illinois</h2>\n<p>Once you join and submit the <strong>Caesars Sportsbook promo code Illinois REALGMFULL</strong>, you'll be able to access a myriad of weekly bonus offers. The best betting sites pride themselves on offering solid ongoing bonuses that can continually increase your bankroll. Caesars Sportsbook Illinois changes its offers weekly but has several staples it relies on. </p>\n<p>Expect to see parlay insurance offers. Commit to a multi-leg parlay, usually with at least three or four legs, and earn a refund of up to $25 on accumulators that miss by a single leg. The parlay insurance offers are provided on an array of markets, including the NFL, NBA, NHL and MLB. </p>\n<p>Odds boosts are also readily available, which lengthen the odds to ensure a higher payout on successful bets. The online sportsbook also offers ticket giveaways and bonuses on prop, moneyline and spread bets. <strong>Caesars Sportsbook promo code Illinois REALGMFULL</strong> isn't required, but you must opt-in to redeem. </p>\n<div class=\"gdcg-oplist\" data-gdcg_rankid=\"5\" data-gdcg_country=\"us\" data-gdcg_region=\"il\"> </div>",
               "pubDate": "Mon, 24 Oct 2022 09:11:51 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269135/Caesars-Sportsbook-Promo-Code-Illinois-Gets-You-$1250-First-Bet-Insurance",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/gdc_caesars_il_hero.jpg"
               }
            },
            {
               "title": "Brandon Ingram Placed In NBA's Concussion Protocol",
               "link": "https://basketball.realgm.com/wiretap/269145/Brandon-Ingram-Placed-In-NBAs-Concussion-Protocol",
               "description": "<p>Brandon Ingram has sustained a concussion has been placed in the NBA's concussion protocol. </p>\n<p>Ingram sustained the injury during Sunday's loss by the New Orleans Pelicans to the Utah Jazz. </p>",
               "pubDate": "Mon, 24 Oct 2022 16:31:55 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269145/Brandon-Ingram-Placed-In-NBAs-Concussion-Protocol",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Ingram_Brandon_nop_191106.jpg"
               }
            },
            {
               "title": "Brandon Ingram Leaves Game With Head Injury, Treated For Concussion-Like Symptoms",
               "link": "https://basketball.realgm.com/wiretap/269133/Brandon-Ingram-Leaves-Game-With-Head-Injury-Treated-For-Concussion-Like-Symptoms",
               "description": "<p>Brandon Ingram left the New Orleans Pelicans' game against the Utah Jazz in the first quarter after colliding with Naji Marshall.</p>\n<p>Ingram, who did not return to the game, is being treated for concussion-like symptoms.</p>\n<p>Ingram is averaging 28 points and 8 rebounds through the Pelicans' first two games. </p>",
               "pubDate": "Sun, 23 Oct 2022 22:13:22 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269133/Brandon-Ingram-Leaves-Game-With-Head-Injury-Treated-For-Concussion-Like-Symptoms",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Ingram_Brandon_nop_191106.jpg"
               }
            },
            {
               "title": "Zion Williamson Diagnosed With Posterior Hip Contusion After Hard Fall",
               "link": "https://basketball.realgm.com/wiretap/269134/Zion-Williamson-Diagnosed-With-Posterior-Hip-Contusion-After-Hard-Fall",
               "description": "<p>Zion Williamson was diagnosed with a posterior hip contusion after landing hard <a href=\"https://twitter.com/SportsCenter/status/1584353289058930689\">during a dunk attempt against the Utah Jazz</a>. </p>\n<p>Williamson, who missed the end of the game, finished with 25 points and 6 rebounds in 30 minutes. </p>\n<p>Brandon Ingram also left the game in the first quarter <a href=\"https://basketball.realgm.com/wiretap/269133/Brandon-Ingram-Leaves-Game-With-Head-Injury-Treated-For-Concussion-Like-Symptoms\">due to concussion-like symptoms</a>. </p>",
               "pubDate": "Sun, 23 Oct 2022 22:25:00 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269134/Zion-Williamson-Diagnosed-With-Posterior-Hip-Contusion-After-Hard-Fall",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Williamson_Zion_nop_210121.jpg"
               }
            },
            {
               "title": "Heat's Caleb Martin, Nikola Jovic Suspended One Game; Raptors Christian Koloko fined $15K",
               "link": "https://basketball.realgm.com/wiretap/269132/Heats-Caleb-Martin-Nikola-Jovic-Suspended-One-Game;-Raptors-Christian-Koloko-fined-$15K",
               "description": "<p>The NBA has suspended Miami Heat forwards Caleb Martin and Nikola Jovic for one game apiece for their roles in an altercation against the Toronto Raptors on Saturday night. Toronto's Christian Koloko was fined $15,000 for his part in the incident.</p>\n<p>While battling for position with 7:46 remaining in Saturday's game in Miami, Martin taunted Koloko before tackling him into the stands. Koloko then grabbed Martin during the altercation. Jovic is being suspended for leaving the bench area and getting involved in the dustup.</p>\n<p>Both Martin and Jovic will serve their suspensions as the Heat again host the Raptors on Monday.</p>",
               "pubDate": "Sun, 23 Oct 2022 21:51:38 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269132/Heats-Caleb-Martin-Nikola-Jovic-Suspended-One-Game;-Raptors-Christian-Koloko-fined-$15K",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Martin_Caleb_mia_220120.jpg"
               }
            },
            {
               "title": "Dunc'd On: First Weekend Wrap-Up",
               "link": "https://basketball.realgm.com/wiretap/269131/Duncd-On-First-Weekend-Wrap-Up",
               "description": "<p><iframe src=\"https://player.simplecast.com/443401c5-b4bb-4ff0-a258-5d84e7557755?dark=false\" width=\"100%\" height=\"200px\" frameborder=\"no\" scrolling=\"no\" seamless=\"\" data-mce-fragment=\"1\"></iframe></p>\n<p>We continue familiarizing ourselves with all these teams at the start of the season, with a focus on TOR/MIA, GSW/DEN, HOU/MEM, ATL/ORL, plus some smaller notes on the Spurs, Pacers, Thunder, and Pistons.</p>\n<p>Plus, Friday Daily Duncs.</p>\n<p><strong>Friday Daily Duncs</strong></p>\n<p><strong>Rob Murphy</strong></p>\n<p>The Pistons are investigating assistant general manager Rob Murphy over an allegation of workplace misconduct involving a former female employee, <a href=\"https://twitter.com/wojespn/status/1583243707532574720\">according to Adrian Wojnarowski of ESPN</a>. Hopefully, the investigation will produce a just outcome.</p>\n<p>James Edwards III of The Athletic <a href=\"https://theathletic.com/3445382/2022/08/01/detroit-pistons-rob-murphy-mother/\">profiled Murphy</a> in August.</p>\n<p><strong>LeBron James</strong></p>\n<p>LeBron James <a href=\"https://duncdon.supportingcast.fm/posts/wednesday-daily-duncs-101922\">drew attention to the Lakers' lack of quality 3-point shooting</a> after they shot 10-for-40 (25%) from beyond the arc in their season-opener.</p>\n<p>Well, they shot even worse - 9-for-45 (20%) - in a loss to the Clippers last night.</p>\n<p>LeBron:</p>\n<blockquote>\n<p>\"Our ballclub is our ballclub, and I'm definitely not going to sit here and harp on what we can't do every single game. That's not a leader. What I know we can do: We can defend our ass off. And we did that tonight, which gave us an opportunity to win, and we just couldn't make it happen. But, I'm OK with that.\"</p>\n</blockquote>\n<p>LeBron both tries to be a good leader <em>and </em>sometimes makes passive-aggressive comments. In this case, he has already made his point. The Lakers' roster has a crucial flaw, particularly for a LeBron team. The front office heard that. Not much else to be done at this moment.</p>\n<p>At some point, LeBron might try to accelerate the Lakers' <a href=\"https://duncdon.supportingcast.fm/posts/thursday-daily-duncs-102022\">trade timeline</a> or reiterate what he wants a trade to accomplish.</p>\n<p>But for now, LeBron is seemingly settling into trying to win games with the teammates he has.</p>\n<p><strong>Darvin Ham</strong></p>\n<p>Russell Westbrook said coming off the bench in the Lakers' preseason finale <a href=\"https://duncdon.supportingcast.fm/posts/wednesday-daily-duncs-101922\">\"absolutely\" could have contributed to his hamstring injury</a>.</p>\n<p><a href=\"https://twitter.com/MarkG_Medina/status/1583251687992545280\">Lakers coach Darvin Ham</a>:</p>\n<blockquote>\n<p>\"First and foremost, let me be clear with this. The Lakers, myself, my staff - we in no way, shape or form would ever put anybody - a player, an employee - in harm's way, be it physically, mentally, spiritually. We don't stand for that. We're not about that. That's not who we are.\"</p>\n</blockquote>\n<p>Ham said he and Westbrook had a \"brief discussion.\"</p>\n<p>Ham:</p>\n<blockquote>\n<p>\"We moved on. We've got an understanding. And again, as the coach of this team, my staff and I, we're going to do what's best for our team to be as successful as it can be. And I'll just leave it at that.\"</p>\n</blockquote>\n<p>Ham was hired in part for his ability to hold players accountable. Westbrook is a different challenge. But Ham sounds resolute.</p>\n<p>Ham, <a href=\"https://www.ocregister.com/2022/10/20/lakers-coach-darvin-ham-deftly-handles-controversial-quotes-from-his-stars/\">via Kyle Goon of The Orange County Register</a>:</p>\n<blockquote>\n<p>\"You have to be prepared to do whatever your team needs you to do,\" he added. \"And that's called being a professional. So, however we choose to use him, there has to be a willingness there to sacrifice for your teammates and the overall good of the team if that course of action is going to lead to success.\"</p>\n</blockquote>\n<p>The true test will come if Ham decides bringing Westbrook off the bench would be better for the Lakers. And, really, we might not know if that happens. We'll know only if Ham follows through. Assuming the coach does, we'll see how Westbrook buys in - and how Ham responds if Westbrook makes more waves.</p>\n<p>But for now, Ham can call this latest issue quashed.</p>\n<p><strong>Christian Wood</strong></p>\n<p>Which of Luka Doncic's Mavericks teammates has been the best player? Kristaps Porzingis set the bar while fizzling, which says something about the bar. I'd say Jalen Brunson last year.</p>\n<p>Tim Cato of The Athletic <a href=\"https://theathletic.com/3711848/2022/10/20/mavericks-suns-christian-wood-luka-doncic/\">analyzes whether it might be Christian Wood</a>.</p>\n<p>Wood isn't even starting for Dallas. But he's darned talented and, as Cato details, has already shown nice chemistry with Doncic. That seems sustainable given the multiple ways Wood can attack the pick-and-roll. If Wood defends a little better - I believe he's capable - this pairing could really work.</p>\n<p><strong>Santi Aldama</strong></p>\n<p>Danny's pick for <a href=\"https://duncdon.supportingcast.fm/posts/2022-23-predictions\">biggest surprise player</a> - Grizzlies forward Santi Aldama - looks pretty good. Starting at power forward with Jaren Jackson Jr. out, Aldama scored 18 points on 3-of-8 3-point shooting and grabbed 11 rebounds in Memphis' season-opening win over the Knicks on Wednesday. The Grizzlies outscored New York by 18 in his 39 minutes (and got outscored by 15 in the other nine minutes).</p>\n<p>Damichael Cole of the Memphis Commercial Appeal <a href=\"https://www.commercialappeal.com/story/sports/nba/grizzlies/2022/10/20/santi-aldama-shines-for-memphis-grizzlies-against-new-york-knicks/69564539007/\">looked deeper into Aldama's performance</a>, including how the slender Aldama held up defensively against the burlier Julius Randle.</p>\n<p><strong>Victor Wembanyama</strong></p>\n<p>Want more Victor Wembanyama hype? David Aldridge of The Athletic <a href=\"https://theathletic.com/3690276/2022/10/19/victor-wembanyama-nba-draft/\">talked to six NBA personnel people</a> about the presumptive No. 1 pick in the 2023 draft and delivers plenty.</p>\n<p>My favorite quote:</p>\n<blockquote>\n<p>It's not just his skill. It's the flexibility he moves with. It's incredible. It's like seeing a giraffe, but a giraffe that's moving like a completely different animal. And you're going: 'Wait a minute; that's a giraffe, it's supposed to move slowly.' And, meanwhile, it's like this giraffe that's a predator. The giraffe is hunting you. And you're going wait, what? It's something we've never seen before.</p>\n</blockquote>\n<p>It's also interesting how Aldridge's sources seem divided on how to best deploy the 7-foot-4 Wembanyama defensively.</p>\n<p>One: \"He's not a switch defender; he's a drop guy.\"</p>\n<p>Another: \"He slides and moves so well, if they put him in pick-and-roll, he can switch. There's not a lot of fives in our league that can do that.\"</p>\n<p>A third: \"He's a four. He's not going to be able to guard threes out on the perimeter all the time.\"</p>\n<p>A fourth: \"No one that big is going to stay in front of prime-time NBA guards consistently out on the perimeter. But he has enough lateral movement - it's probably the best I've ever seen in anybody that big - that he'll surprise you from time to time on some stuff out there. But the great equalizer, if you blow by him, you talk about some guys that'll be looking over their shoulder as they're going to the basket. You could beat him, and he could be at the free-throw line, and he takes one step and he's pinning the thing.\"</p>\n<p>A fifth: \"If whoever he gets drafted by ever had some type of conception of utilizing a zone? Can you imagine having a backline (with him) - or maybe even putting him in the top of defenses, trying to see over this albatross of a player?\"</p>\n<p><strong>Pick swaps</strong></p>\n<p>Pick swaps have become the rage as teams look to circumvent the Stepien Rule, which prohibits trading future first-round picks in consecutive drafts. Pick swaps allow teams to convey value in consecutive future drafts by retaining a first-rounder every other year, albeit a lower first-rounder.</p>\n<p>Think of pick swaps, and the first one that comes to mind is probably Celtics-Nets in 2017. As a condition of the Kevin Garnett-Paul Pierce trade four years earlier, Boston swapped its first-round pick (No. 27) for Brooklyn's (No. 1). The Celtics traded down to No. 3 and picked Jayson Tatum, who has developed into a star and left the Nets (and 76ers, who moved up to get Markelle Fultz No. 1) looking foolish.</p>\n<p>But pick swaps don't usually work like that.</p>\n<p>Zach Kram of The Ringer <a href=\"https://www.theringer.com/nba/2022/10/12/23399637/nba-draft-swap-picks\">dug into the history of pick swaps</a> and found most don't even get exercised. He determined the average value of a first-round pick swap is the No. 36 pick.</p>\n<p>Kram's research and presentation are certainly useful. Read his article, and you will be more informed.</p>\n<p>But I think he underplays the upside of pick swaps. The draft - and therefore, draft picks - are about upside. For many teams, the draft is the best - maybe only - way to get a franchise-changing star. That's more likely to happen high in the draft.</p>\n<p>A high second-rounder might have the <em>average </em>value of a pick swap. But only an unprotected pick swap has that limitless upside. That carries significant value.</p>\n<p>At some point, successful teams have all hit big on a player. Moderately positive moves aren't enough. You can keep hitting singles. But in a league with 29 other teams, some of them will hit home runs and surpass you. If you want to get to the top, you sometimes have to swing for the fences - even if you're more likely to strike out.</p>\n<p><strong>Scoring record</strong></p>\n<p>You probably know LeBron James will soon pass Kareem Abdul-Jabbar for the NBA's all-time scoring record. Do you know how many points Abdul-Jabbar scored? I sure didn't.</p>\n<p>Finding an excellent angle on such a well-covered storyline, Dan Woike of the Los Angeles Times looked into <a href=\"https://www.latimes.com/sports/lakers/story/2022-10-17/lakers-season-preview-lebron-james-all-time-scoring-record\">how few people know the number and why that is</a>. This is a really cool article.</p>\n<p>After reading it, I can tell you Abdul-Jabbar's career scoring mark is 38,387 - a number I'm sure to forget by tomorrow.</p>\n<p><strong>Rudy Gobert/Karl-Anthony Towns</strong></p>\n<p>Nikola Jokic has become an All-NBA mainstay at center. Joel Embiid and Anthony Davis are likely All-NBA players when healthy, which isn't always. Often, it feels like one spot is left for Rudy Gobert or Karl-Anthony Towns. In fact, Gobert or Towns - but never both - have made All-NBA each of the last six years.</p>\n<p>Jon Krawczynski of The Athletic explored <a href=\"https://theathletic.com/3701966/2022/10/18/karl-anthony-towns-rudy-gobert-2/\">how Gobert and Towns viewed each other while foes and now teammates</a> with the Timberwolves.</p>\n<p><strong>Thanasis Antetokounmpo</strong></p>\n<p>Thanasis Antetokounmpo actually played a small role on the Bucks last season as a defensive specialist on the wing, helping to shed the image he's in the NBA only because he's Giannis Antetokounmpo's brother.</p>\n<p>But good luck convincing anyone now.</p>\n<p><a href=\"https://twitter.com/NBAonTNT/status/1583246828123787265\">Video caught Thanasis picking Giannis' nose</a> before Milwaukee's win over the 76ers last night.</p>\n<p>In defense of Thanasis, it wasn't a deep pick. He did the ol' thumb-out move. Though technically a pick, that's barely more than a scratch.</p>\n<p>In prosecution of Thanasis, it was someone else's nose!</p>\n<p><em>-Dan Feldman</em></p>\n<p>More episodes are available exclusively on Dunc'd On Prime!<a href=\"http://duncdon.supportingcast.fm/join\"> DuncdOn.SupportingCast.FM/join</a></p>\n<p>Subscribe to<a href=\"http://nateduncannba.com/free/\"> our weekly mailing list</a> for free bonus content and all the info you need to keep up with the latest from Nate and Danny!</p>\n<p>With <a href=\"http://twitter.com/dannyleroux\">@DannyLeroux</a> and<a href=\"https://cms.megaphone.fm/organizations/1e91b938-a9d5-11e7-bf4c-b34da90893d7/podcasts/7af881f0-ec38-11e9-a40d-33d4bbe7b567/episodes/2582afc4-ec39-11e9-b6df-e7d09ab570aa/twitter.com/NateDuncanNBA\"> @NateDuncanNBA</a></p>",
               "pubDate": "Sun, 23 Oct 2022 21:04:10 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269131/Duncd-On-First-Weekend-Wrap-Up",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Butler_Jimmy_mia_220517.jpg"
               }
            },
            {
               "title": "Darvin Ham On Benching Russell Westbrook Late: We Don't Have Time For People To Be In Their Feelings",
               "link": "https://basketball.realgm.com/wiretap/269130/Darvin-Ham-On-Benching-Russell-Westbrook-Late-We-Dont-Have-Time-For-People-To-Be-In-Their-Feelings",
               "description": "<p>Late in the Los Angeles Lakers loss to the Portland Trail Blazers, Russell Westbrook was on the bench for the Lakers. Los Angeles coach Darvin Ham was blunt when asked if he was concerned about how Westbrook would take the benching.</p>\n<p>\"We don't have time for people to be in their feelings,\" said Ham.</p>\n<p>With just under 30 seconds left, and the Lakers holding a lead, Westbrook took a pull-up mid-range jumper. Westbrook said he was looking to make sure Los Angeles would have a 2-for-1 opportunity. Ham didn't find fault with that, but said he wished Westbrook would have \"attacked the rim directly\", as opposed to pulling up.</p>\n<p>With the loss, the Lakers feel to 0-3 on the young season. The Trail Blazers improved to 3-0.</p>",
               "pubDate": "Sun, 23 Oct 2022 19:49:03 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269130/Darvin-Ham-On-Benching-Russell-Westbrook-Late-We-Dont-Have-Time-For-People-To-Be-In-Their-Feelings",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Ham_Darvin_lal_221012.jpg"
               }
            },
            {
               "title": "Facundo Campazzo's Mavericks Debut Delayed By Visa Issue",
               "link": "https://basketball.realgm.com/wiretap/269129/Facundo-Campazzos-Mavericks-Debut-Delayed-By-Visa-Issue",
               "description": "<p>The Dallas Mavericks added point guard Facundo Campazzo to their roster right at the end of the preseason. Campazzo hasn't played in either of the Mavs' first two games because of a visa issue.</p>\n<p>Dallas coach Jason Kidd said they hope to have Campazzo active and available by the team's next game on Tuesday. The Argentina native is having his visa recalibrated to allow him to continue to work in the United States.</p>\n<p>Campazzo joined the Mavericks after two seasons with the Denver Nuggets. The 5-foot-11 guard is expected to help Dallas replace some of the depth they lost at point guard over the summer.</p>",
               "pubDate": "Sun, 23 Oct 2022 08:34:18 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269129/Facundo-Campazzos-Mavericks-Debut-Delayed-By-Visa-Issue",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Campazzo_Facundo_den_210504.jpg"
               }
            },
            {
               "title": "Joel Embiid Battled Plantar Fasciitis Before Training Camp",
               "link": "https://basketball.realgm.com/wiretap/269128/Joel-Embiid-Battled-Plantar-Fasciitis-Before-Training-Camp",
               "description": "<p>Joel Embiid acknowledged that his conditioning isn't where it needs to be to start the NBA season. Embiid said that is because he was fighting plantar fasciitis over the summer. That left the Sixers star unable to do any basketball work for the two months leading up to the start of training camp.</p>\n<p>\"Coming into training camp I hadn't done anything in like two months, so it really slowed me down,\" Embiid said. \"Still trying to work my way back and hopefully everything goes back to normal.\"</p>\n<p>76ers coach Doc Rivers said that his All-Star center is currently pain free, but that it clearly impacted Embiid's training and conditioning. When Embiid wrapped up his media availability, he said he's \"fine\", as far as having any lingering foot pain.</p>",
               "pubDate": "Sun, 23 Oct 2022 08:21:48 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269128/Joel-Embiid-Battled-Plantar-Fasciitis-Before-Training-Camp",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Embiid_Joel_phi_220208.jpg"
               }
            },
            {
               "title": "No Minutes Restriction For Zach LaVine Upon Return",
               "link": "https://basketball.realgm.com/wiretap/269127/No-Minutes-Restriction-For-Zach-LaVine-Upon-Return",
               "description": "<p>Zach LaVine is set to make his season-debut on Saturday night. The Chicago Bulls All-Star will do so without any sort of minutes restriction.</p>\n<p>LaVine missed the Bulls first two games of the season after having a sore left knee at the end of the preseason. Chicago coach Billy Donovan said LaVine won't have his minutes restrict, but that playing the All-Star for 38 or more minutes wouldn't be ideal.</p>\n<p>\"He feels fine,\" Donovan said about LaVine on Friday. \"He was able to get work in and told me he felt good. Obviously yesterday (Thursday) was a very, very light day. He had player development guys out there guarding him, he was coming off screens, working on his ballhandling, using pick-and-rolls. He was doing his normal things. He needed a crisp workout, and he was able to do that.\"</p>",
               "pubDate": "Sat, 22 Oct 2022 17:48:06 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269127/No-Minutes-Restriction-For-Zach-LaVine-Upon-Return",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/LaVine_Zach_chi_220513.jpg"
               }
            },
            {
               "title": "NBA To More Closely Look At Expansion After Negotiating Next TV Deals",
               "link": "https://basketball.realgm.com/wiretap/269126/NBA-To-More-Closely-Look-At-Expansion-After-Negotiating-Next-TV-Deals",
               "description": "<p>It seems to be a fairly open secret that the NBA will expand in coming years. NBA Commissioner Adam Silver has touched on the topic several times in recent years, but has always labeled expansion as something for the future.</p>\n<p>Now, Silver has put a very loose timeline to the idea of expansion. The Commissioner said it's something league will look at more closely after they negotiate the next TV rights deal. The NBA's current media contracts expire following the 2024-25 season. Negotiations are expected to be complete well in advance of the rights expiring.</p>\n<p>Silver said a dilution of talent is something that will be considered in expansion discussions, but that the NBA is doing well overall. Silver also noted that there is no shortage of strong cities for expansions teams. Seattle and Las Vegas are considered to be the most likely cities to get expansion teams.</p>",
               "pubDate": "Sat, 22 Oct 2022 17:41:58 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269126/NBA-To-More-Closely-Look-At-Expansion-After-Negotiating-Next-TV-Deals",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/nba_realgm.jpg"
               }
            },
            {
               "title": "Adam Silver Says NBA Has Thought About The Concept Of Relegation To Combat Tanking",
               "link": "https://basketball.realgm.com/wiretap/269125/Adam-Silver-Says-NBA-Has-Thought-About-The-Concept-Of-Relegation-To-Combat-Tanking",
               "description": "<p>Adam Silver says that the NBA is aware that team may considering tanking this season for Victor Wembanyama. While not naming Wembanyama directly, Silver said he understands why teams would tank when a \"once-in-a-generation player\" is expected to be available.</p>\n<p>Because of that factor, the NBA Commissioner said about tanking, \"We put teams on notice. We're going to be paying particular attention to the issue this year.\"</p>\n<p>Silver also said the league has thought about the concept of relegation as a potential solution to tanking. In many worldwide soccer leagues, leagues are set up so the best teams in a season are promoted to a higher-level league, while the worst teams are demoted down to a lower-level league.</p>\n<p>Silver ultimately said it's probably a non-starter for the NBA for several reasons, including it being \"destabilizing\" for the league.</p>\n<p>\"It would so disrupt our business model,\" Silver said. \"And even if you took two teams up from the G League, they wouldn't be equipped to compete in the NBA.\"</p>",
               "pubDate": "Sat, 22 Oct 2022 17:29:58 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269125/Adam-Silver-Says-NBA-Has-Thought-About-The-Concept-Of-Relegation-To-Combat-Tanking",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Silver_Adam_nba_200325.jpg"
               }
            },
            {
               "title": "Sam Merrill Selected First Overall At 2022 G League Draft",
               "link": "https://basketball.realgm.com/wiretap/269124/Sam-Merrill-Selected-First-Overall-At-2022-G-League-Draft",
               "description": "<p>Two-year NBA veteran Sam Merrill was the first overall selection at the 2022 NBA Draft. Merrill was selected the Cleveland Charge, who are the Cleveland Cavaliers G League affiliate. Merrill remains an NBA free agent and free to sign with any NBA team, despite playing for the Charge this season.</p>\n<p>Joe Wieskamp, who played for the San Antonio Spurs last season was selected second overall by the Wisconsin Herd. The Herd are the affiliate of the Milwaukee Bucks.</p>\n<p>Other notable players selected were rookie Jared Rhoden (College Park Skyhawks - Atlanta Hawks), three-year NBA veteran Rashad Vaughn (Cleveland Charge - Cleveland Cavaliers) and six-year NBA veteran Norris Cole (Grand Rapids Gold - Denver Nuggets).</p>",
               "pubDate": "Sat, 22 Oct 2022 17:22:14 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269124/Sam-Merrill-Selected-First-Overall-At-2022-G-League-Draft",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/gleague_logo.jpg"
               }
            },
            {
               "title": "Adam Silver Apologized To Suns Employees",
               "link": "https://basketball.realgm.com/wiretap/269123/Adam-Silver-Apologized-To-Suns-Employees",
               "description": "<p>Before the Phoenix Suns opened their season last Wednesday, NBA commissioner Adam Silver spoke to hundreds of Suns employees. Silver apologized for himself and the NBA letting them down as far as punishing Robert Sarver for years of unacceptable behavior.</p>\n<p>Silver told Suns employees: \"To the extent that you feel let down by the league, I apologize. I take responsibility for that.\"</p>\n<p>Silver acknowledged the NBA had heard Sarver was difficult to deal with, but \"that's very different than conduct which is viewed as discriminatory in any way.\"</p>\n<p>The NBA commissioner encouraged Phoenix employees to continue to bring up concerns they have. Silver also acknowledged that he didn't have any \"deep answers\", but that it's important \"just to really listen to people.\"</p>",
               "pubDate": "Sat, 22 Oct 2022 11:01:31 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269123/Adam-Silver-Apologized-To-Suns-Employees",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Silver_Adam_nba_220225.jpg"
               }
            },
            {
               "title": "Kevin Knox: I Didn't Make Best Of Opportunity With Knicks",
               "link": "https://basketball.realgm.com/wiretap/269122/Kevin-Knox-I-Didnt-Make-Best-Of-Opportunity-With-Knicks",
               "description": "<p>Kevin Knox didn't have any sort of revenge game on his mind when his Detroit Pistons faced the New York Knicks. Instead, Knox took ownership for him not playing well enough for the Knicks.</p>\n<p>\"I had my fair opportunity; didn't make the best of it, unfortunately,\" Knox said.</p>\n<p>Knox said he learned a lot while playing in New York, including that he has to play harder. The fifth year forward also said he's taking advantage of being with the Pistons now.</p>\n<p>\"I got to go out there and work harder, play better defense, all the narrative that they created. But I put it all on me. I got to go out there and play better, perform better,\" said Knox. \"I have another opportunity here. So, I'm going to go out there and show what I can do.\"</p>",
               "pubDate": "Sat, 22 Oct 2022 09:12:26 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269122/Kevin-Knox-I-Didnt-Make-Best-Of-Opportunity-With-Knicks",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Knox_Kevin_nyk_181107.jpg"
               }
            },
            {
               "title": "Lakers Bring Moe Harkless In For Workout, Meeting",
               "link": "https://basketball.realgm.com/wiretap/269121/Lakers-Bring-Moe-Harkless-In-For-Workout-Meeting",
               "description": "<p>The Los Angeles Lakers brought in Moe Harkless for a workout and a meeting, sources told Shams Charania of The Athletic. </p>\n<p>The team is considering signings to add to their wing and front court depth. </p>\n<p>Harkless was most recently <a href=\"https://basketball.realgm.com/wiretap/268946/Rockets-Waive-Moe-Harkless\">waived by the Rockets</a>. </p>",
               "pubDate": "Sat, 22 Oct 2022 00:59:34 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269121/Lakers-Bring-Moe-Harkless-In-For-Workout-Meeting",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Harkless_Maurice_sac_210527.jpg"
               }
            },
            {
               "title": "Keegan Murray Cleared To Make NBA Debut On Saturday",
               "link": "https://basketball.realgm.com/wiretap/269120/Keegan-Murray-Cleared-To-Make-NBA-Debut-On-Saturday",
               "description": "<p>Keegan Murray was cleared to make his NBA debut on Saturday against the Los Angeles Clippers.</p>\n<p>Murray, who was placed in the league's health and safety protocols on October 14, missed the Kings' opening game loss against the Blazers. </p>",
               "pubDate": "Sat, 22 Oct 2022 00:48:50 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269120/Keegan-Murray-Cleared-To-Make-NBA-Debut-On-Saturday",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Murray_Keegan_ia_220331.jpg"
               }
            },
            {
               "title": "BetMGM VA Bonus Code REALGM Unfurls Risk-Free Bet Up To $1000 For Virginia",
               "link": "https://basketball.realgm.com/wiretap/269119/betmgm-va-unfurls-risk-free-bet-up-to-1000-for-virginia",
               "description": "<p>Late October is a sports bettor's paradise. Baseball's World Series is on the horizon and midseason in the NFL is quickly approaching. The NBA and NHL seasons are also underway, there are countless opportunities to put your sports knowledge to get use. Just sign up with the <strong><a href=\"https://basketball.realgm.com/betting/sportsbooks/virginia/betmgm\" target=\"_blank\" rel=\"noopener\">BetMGM VA bonus code</a> REALGM</strong> and redeem the $1,000 risk-free first bet welcome offer to get started.</p>\n<div class=\"gdcg-oplist\" data-gdcg_rankid=\"657\" data-gdcg_country=\"us\" data-gdcg_region=\"va\"> </div>\n<p>The welcome offer is one of the most highly rated sportsbook promo codes available, and it's yours when you join BetMGM Virginia. Your first bet, up to $1,000, is covered if unsuccessful. So, sign up, submit <strong>BetMGM VA bonus code REALGM</strong>, deposit no less than $10 and wait to see how your qualifying pick does. </p>\n<p>You can pick any sport, team or bet type as your qualifying bet and backing an underdog comes highly recommended. Win the bet and, thanks to longer odds of the underdog, reap the rewards of a higher payout. Lose and the online sportsbook deposits the refund within 24 hours.  </p>\n<h2>Earn Free Bets With BetMGM VA Bonus Code REALGM</h2>\n<table>\n<tbody>\n<tr>\n<td>BetMGM VA Bonus Code</td>\n<td>REALGM</td>\n</tr>\n<tr>\n<td>BetMGM Virginia Promotion</td>\n<td>$1,000 risk-free bet</td>\n</tr>\n<tr>\n<td>Terms & Conditions</td>\n<td>New customers, 21 and over in Virginia as well as AZ, CO, IN, IA, IL, KS, LA, MI, MS, NV, NJ, PA, TN, WV, WY. Losing wagers under $50 will be matched with a single free bet.</td>\n</tr>\n</tbody>\n</table>\n<div class=\"gdcg-oplist\" data-gdcg_rankid=\"657\" data-gdcg_country=\"us\" data-gdcg_region=\"va\"> </div>\n<p>The $1,000 risk-free first bet differs from other <a href=\"https://basketball.realgm.com/wiretap/266131/Best-Sports-Betting-Apps-2022-Legal-Online-Sportsbook-Apps\" target=\"_blank\" rel=\"noopener\">sports betting apps</a>' welcome offers as it provides five free follow-up bets if the following requirements are met. First, you must have an account to redeem the offer. If you don't, click the link on this page and submit <strong>BetMGM VA bonus code REALGM</strong>. Then, place a qualifying wager of no less than $50. </p>\n<p>You'll receive five equal free-bet tokens if your bet loses. The five free-bet tokens are deposited into your account within 24 hours. You then get five free follow-up bets, providing the perfect platform to increase your bankroll almost immediately after joining the online sportsbook. The site credit must be invested within a week. </p>\n<p>Losing qualifying wagers of $49 or less receive a single free-bet token, which must be used as the stake on the follow-up bet. As with all online sportsbooks, you must be 21 years old and in Virginia or another state in which BetMGM operates. You can also sign up on the  mobile app. Remember to submit <strong>BetMGM Virginia bonus code REALGM</strong> to access the signup offer. </p>\n<div class=\"gdcg-oplist\" data-gdcg_rankid=\"657\" data-gdcg_country=\"us\" data-gdcg_region=\"va\"> </div>\n<h2>BetMGM VA Bonus Code: Parlays Take Center Stage </h2>\n<p>BetMGM VA was one of the first betting sites to prioritize weekly parlay bonuses. The online sportsbook stuck to its guns, continually promoting parlay play and offering two staple bonuses. Join and enter <strong>BetMGM Virginia bonus code REALGM</strong> If you want to redeem either offer. The two offers, Parlay Plus and One Game Parlay Insurance, provide incentives for losses and wins. </p>\n<p>The One Game Parlay Insurance bonus applies to NFL, MLB, NHL and EPL. You'll earn a redemption of up to $25 on parlays that miss by a single leg. The parlay must be placed on the same game and have at least four legs. Like the welcome offer, you'll receive the refund within 24 hours. </p>\n<p>Parlay Plus rewards bettors for successful four-to-seven-leg parlays. The bonus amount depends on the number of legs. Four-leg triumphs garner a 15% bonus, five-leg winners get 20%, while successful six and seven-leg winners yield 30 and 40% bonuses, respectively. You can combine different sports and events, so use your creativity and resourcefulness to concoct the perfect parlay. </p>\n<p>Get started today with the <strong>BetMGM Virginia bonus code REALGM</strong>.</p>\n<div class=\"gdcg-oplist\" data-gdcg_rankid=\"5\" data-gdcg_country=\"us\" data-gdcg_region=\"va\"> </div>",
               "pubDate": "Fri, 21 Oct 2022 09:03:44 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269119/betmgm-va-unfurls-risk-free-bet-up-to-1000-for-virginia",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/gdc_betmgm_Va.jpg"
               }
            },
            {
               "title": "Kawhi Leonard Comes Off Bench For First Time In Nine Years",
               "link": "https://basketball.realgm.com/wiretap/269118/Kawhi-Leonard-Comes-Off-Bench-For-First-Time-In-Nine-Years",
               "description": "<p>Kawhi Leonard made his return to the court after a year-and-a-half, but that return took a bit longer than was expected. Leonard came off the bench for the first time since November of 213, when he was still and up-and-coming player with the San Antonio Spurs.</p>\n<p>In all, Leonard played three separate stints of six-to-seven minutes and 21:17 total. The LA Clippers star said he made the decision after coming off the bench in conjunction with head coach Ty Lue. The Clippers had Leonard simulate the feel of coming off the bench in scrimmages and analyzed substitution patterns where he wouldn't sit for too long, while still making an impact at the end of the game.</p>\n<p>Make an impact at the end of the game is exactly what Leonard did. He drew a key charge from LeBron James late in the fourth quarter. Leonard then knocked down a jumper with under a minute to play to help the Clippers hold off the rival Lakers.</p>\n<p>\"One scenario with me starting, I would have been sitting like 35 minutes real time,\" Leonard said of starting and still being able to finish the game. \"That's way too long. So, I just thought this was the best situation. But we'll see how it goes moving forward.\"</p>\n<p>Both Lue and Leonard said if either party didn't feel this was working, they'd turn back to Leonard starting. For his part, Leonard has his eyes on the long-term.</p>\n<p>\"You gotta gradually play minutes in order to get the ACL strong,\" Leonard said. \"Once you start playing 38 minutes first game, it could easily weaken up, but I'm listening to the doctor with that.</p>\n<p>\"It's a long season. We wanna get in the playoffs and want me to play in the playoffs.\"</p>",
               "pubDate": "Fri, 21 Oct 2022 08:05:35 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269118/Kawhi-Leonard-Comes-Off-Bench-For-First-Time-In-Nine-Years",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Leonard_Kawhi_lac_210717.jpg"
               }
            },
            {
               "title": "Knicks Rule Quentin Grimes Out For Friday Due To Foot Soreness, No Timetable For Return",
               "link": "https://basketball.realgm.com/wiretap/269117/Knicks-Rule-Quentin-Grimes-Out-For-Friday-Due-To-Foot-Soreness-No-Timetable-For-Return",
               "description": "<p>Quentin Grimes has been ruled out for the New York Knicks home opener on Friday due to foot soreness.</p>\n<p>There is no timetable for Grimes' return.</p>\n<p>Grimes said that injury may be due to overtraining in the offseason.</p>\n<p>\"They said it was kind of a overuse thing. Just being in the gym a lot (in the summer). Coming back at night, going back to Houston, working on it and working on it. Then (Tom Thibodeau) had us in there for sure, working out (presumably in training camp)... It was an overuse thing really,\" said Grimes. </p>\n<p>The Knicks added that they won't clear Grimes until he's pain-free. </p>",
               "pubDate": "Fri, 21 Oct 2022 01:17:54 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269117/Knicks-Rule-Quentin-Grimes-Out-For-Friday-Due-To-Foot-Soreness-No-Timetable-For-Return",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Grimes_Quentin_nyk_220225.jpg"
               }
            },
            {
               "title": "Myles Turner Expected To Miss At Least One Week With Sprained Ankle",
               "link": "https://basketball.realgm.com/wiretap/269116/Myles-Turner-Expected-To-Miss-At-Least-One-Week-With-Sprained-Ankle",
               "description": "<p>Myles Turner is expected to be out at least one week due to a sprained ankle, sources told Shams Charania of The Athletic.</p>\n<p>Turner suffered the sprain after <a href=\"https://basketball.realgm.com/wiretap/269102/Myles-Turner-Sprains-Ankle-After-Landing-On-Ball-Boys-Foot-During-Warmups\">landing on a ball boy's foot</a> during pregame warmups.</p>\n<p>Turner appeared in just 42 games last season due to a stress reaction in his left foot. </p>",
               "pubDate": "Fri, 21 Oct 2022 01:12:21 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269116/Myles-Turner-Expected-To-Miss-At-Least-One-Week-With-Sprained-Ankle",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Turner_Myles_ind_210128.jpg"
               }
            },
            {
               "title": "Joe Harris Listed As Probable For Friday",
               "link": "https://basketball.realgm.com/wiretap/269115/Joe-Harris-Listed-As-Probable-For-Friday-",
               "description": "<p>Joe Harris is listed as probable for the Brooklyn Nets matchup against the Toronto Raptors on Friday.</p>\n<p>Harris, who played just 14 games last season, underwent two ankle surgeries during the year. </p>",
               "pubDate": "Fri, 21 Oct 2022 01:08:13 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269115/Joe-Harris-Listed-As-Probable-For-Friday-",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/Harris_Joe_bkn_211129.jpg"
               }
            },
            {
               "title": "Pistons Assistant GM Rob Murphy On Leave During Investigation Of Alleged Misconduct",
               "link": "https://basketball.realgm.com/wiretap/269114/Pistons-Assistant-GM-Rob-Murphy-On-Leave-During-Investigation-Of-Alleged-Misconduct",
               "description": "<p>Rob Murphy, assistant general manager of the Detroit Pistons, is on leave after the franchise opened an investigation into an allegation of workplace misconduct with a former female employee.</p>\n<p>Murphy, who is from Detroit, was promoted to assistant GM in June after starting as the franchise's G League president and general manager in March 2021. He had spent the previous two decades as a college coach, including 10 years at Eastern Michigan as head coach until 2021.</p>\n<p>Detroit's probe involving Murphy follows the season-long suspension by the Boston Celtics of Ime Udoka. </p>",
               "pubDate": "Thu, 20 Oct 2022 22:51:05 EDT",
               "guid": "https://basketball.realgm.com/wiretap/269114/Pistons-Assistant-GM-Rob-Murphy-On-Leave-During-Investigation-Of-Alleged-Misconduct",
               "thumbnail": {
                  "_url": "https://basketball.realgm.com/images/nba/4.2/wiretap/photos/2006/nba_detroitpistons.jpg"
               }
            },
            {
               "title": "Get Your Latest NBA News From RealGM's Basketball Wiretap",
               "link": "https://basketball.realgm.com/news",
               "description": "Get all the latest news and happenings from around the NBA with RealGM's Basketball Wiretap.",
               "pubDate": "Mon, 24 Oct 2022 18:17:01 EDT",
               "guid": "https://basketball.realgm.com/news"
            }
         ]
      },
      "_xmlns:media": "http://search.yahoo.com/mrss/",
      "_version": "2.0"
   }
}